#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

//++ СкребковЮМ 10.02.26 СКЛ.19
Функция cbr_СоздатьПриходныйОрдерИзДвиженияПродукцииИМатериалов(ДвижениеПродукции, Распоряжение, Помещение) Экспорт

	Результат = Неопределено;
	
	ОрдерСсылка = cbr_ПолучитьПриходныйОрдерПоРаспоряжениюПомещению(Распоряжение, Помещение);
	
	Если ОрдерСсылка <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериалов.Отправитель КАК Отправитель,
	|	ДвижениеПродукцииИМатериалов.Получатель КАК Получатель,
	|	ДвижениеПродукцииИМатериалов.Дата КАК Дата,
	|	ДвижениеПродукцииИМатериалов.Номер КАК Номер,
	|	ДвижениеПродукцииИМатериалов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|		ПО ДвижениеПродукцииИМатериалов.Получатель = СкладскиеЯчейки.Владелец
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДвижениеПродукции);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Не Выборка.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗонаПриемки = cbr_ПолучитьСкладскуюЯчейку(Выборка.Получатель);
	
	Основание = Новый Структура;
	Основание.Вставить("Распоряжение",				Распоряжение);
	Основание.Вставить("Отправитель",				Выборка.Отправитель);
	Основание.Вставить("Склад",						Выборка.Получатель);
	Основание.Вставить("Помещение",					Помещение);
	Основание.Вставить("ЗонаПриемки",				ЗонаПриемки);
	Основание.Вставить("ДатаВходящегоДокумента",	Выборка.Дата);
	Основание.Вставить("НомерВходящегоДокумента",	Выборка.Номер);
	Основание.Вставить("ДатаПоступления",			ТекущаяДатаСеанса());
	Основание.Вставить("ХозяйственнаяОперация",		Выборка.ХозяйственнаяОперация);
	
	ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ПриходныйОрдер.Заполнить(Основание);
	
	Если ПриходныйОрдер.Товары.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при создании документа ""Приходный ордер на товары"" по распоряжению %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Распоряжение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Результат;
	КонецЕсли;
	
	ПриходныйОрдер.Дата = ТекущаяДатаСеанса();
	ПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
	
	ПриходныйОрдер.Записать(РежимЗаписиДокумента.Запись);
	
	ТекстСообщения = НСтр("ru = 'Создан документ %1'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ПриходныйОрдер.Ссылка);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ПриходныйОрдер.Ссылка);

	Возврат ПриходныйОрдер.Ссылка;

КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ СкребковЮМ 10.02.26 СКЛ.19
Функция cbr_ПолучитьПриходныйОрдерПоРаспоряжениюПомещению(Распоряжение, Помещение)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	НЕ ПриходныйОрдерНаТовары.ПометкаУдаления
	|	И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
	|	И ПриходныйОрдерНаТовары.Помещение = &Помещение";

	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("Помещение", Помещение);

	РезультатЗапроса = Запрос.Выполнить();
	
	ПриходныеОрдера = РезультатЗапроса.Выгрузить();
	
	Если ПриходныеОрдера.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат ПриходныеОрдера[0].Ссылка;
	
КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

//++ СкребковЮМ 10.02.26 СКЛ.19
Функция cbr_ПолучитьСкладскуюЯчейку(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкладскиеЯчейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	НЕ СкладскиеЯчейки.ПометкаУдаления
		|	И СкладскиеЯчейки.Владелец = &Склад
		|	И СкладскиеЯчейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Приемка)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СкладскиеЯчейки = РезультатЗапроса.Выгрузить();
	
	Если СкладскиеЯчейки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СкладскиеЯчейки[0].Ссылка;
	
КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

#КонецОбласти

#КонецЕсли