#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ БаженоваЕО 13.02.2026 СКЛ.4
	Если Комментарий = "Создано автоматически: АРМ Поступление/Отгрузка" Тогда
		
		//создание ОтборРазмещениеТоваров	
		НовыйОтборРазмещениеТоваров = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
		НовыйОтборРазмещениеТоваров.Заполнить(Ссылка);
		НовыйОтборРазмещениеТоваров.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено;
		
		Попытка
			НовыйОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		//создание ПриобретениеТоваровУслуг
		НовыйПриобретениеТоваровУслуг = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
		
		ДанныеЗаполнения = КонвертироватьОбъектВСтруктуру(Распоряжение);
		НовыйПриобретениеТоваровУслуг.Заполнить(ДанныеЗаполнения);
		НовыйПриобретениеТоваровУслуг.Дата = ТекущаяДата();
		
//		НовыйПриобретениеТоваровУслуг.Товары.Очистить();
		Номенклатура = Распоряжение.Товары.ВыгрузитьКолонку("Номенклатура");
		Назначение = Распоряжение.Товары.ВыгрузитьКолонку("Назначение");
		Характеристика = Распоряжение.Товары.ВыгрузитьКолонку("Характеристика");

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления = &Распоряжение
		|	И ТоварыКПоступлениюОстатки.Номенклатура В (&Номенклатура)
		|	И ТоварыКПоступлениюОстатки.Характеристика В (&Характеристика)
		|	И ТоварыКПоступлениюОстатки.Назначение В (&Назначение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Распоряжение";

		Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Назначение", Назначение);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);

		Результат = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрРаспоряжения Из НовыйПриобретениеТоваровУслуг.Товары Цикл
			Для Каждого Стр Из Результат Цикл
				Если Стр.Номенклатура = СтрРаспоряжения.Номенклатура И Стр.Назначение = СтрРаспоряжения.Назначение
					И Стр.Характеристика = СтрРаспоряжения.Характеристика Тогда
				
					СтрРаспоряжения.Серия = Стр.Серия;
					СтрРаспоряжения.КоличествоУпаковок = Стр.Количество;
					СтрРаспоряжения.Количество = Стр.Количество;
					
				Иначе
					
					СтрРаспоряжения.КоличествоУпаковок = 0;
					СтрРаспоряжения.Количеств = 0;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		СтруктураДляПоиска = Новый Структура("Количество", 0); 
		МассивПустыхСтрок = НовыйПриобретениеТоваровУслуг.Товары.НайтиСтроки(СтруктураДляПоиска);
		Для каждого Строка Из МассивПустыхСтрок Цикл 
			НовыйПриобретениеТоваровУслуг.Товары.Удалить(Строка); 
		КонецЦикла; 
		
		Попытка
			НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		ТекстСообщения = "Документы ""Отбор (размещение) товаров"" и ""Приобретение товаров и услуг"" успешно созданы";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	//-- БаженоваЕО 13.02.2026
	
КонецПроцедуры

//++ БаженоваЕО 06.03.2026 СКЛ.4
Функция КонвертироватьОбъектВСтруктуру(Распоряжение)

	ДанныеЗаполнения = Новый Структура;

	//ДокументОснование
	ДокументОснование = Новый Массив;
	ДокументОснование.Добавить(Распоряжение);
	ДанныеЗаполнения.Вставить("ДокументОснование", ДокументОснование);
	
	//РеквизитыШапки
	РеквизитыШапки = Новый Структура;
	РеквизитыШапки.Вставить("БанковскийСчетОрганизации", Распоряжение.БанковскийСчет);
	РеквизитыШапки.Вставить("Валюта", Распоряжение.Валюта);
	РеквизитыШапки.Вставить("ВалютаВзаиморасчетов", Распоряжение.Валюта);
	РеквизитыШапки.Вставить("ВернутьМногооборотнуюТару", Распоряжение.ВернутьМногооборотнуюТару);
	РеквизитыШапки.Вставить("ВидЦеныПоставщика", Неопределено);
	РеквизитыШапки.Вставить("ГруппаФинансовогоУчета", Распоряжение.ГруппаФинансовогоУчета);
	РеквизитыШапки.Вставить("Договор", Распоряжение.Договор);
	РеквизитыШапки.Вставить("ЗакупкаПодДеятельность", Распоряжение.ЗакупкаПодДеятельность);
	РеквизитыШапки.Вставить("ЗапрещеноВыбиратьГруппуСкладов", Ложь);
	РеквизитыШапки.Вставить("КалендарьВозвратаТары", Справочники.ПроизводственныеКалендари.ПустаяСсылка());
	РеквизитыШапки.Вставить("Контрагент", Распоряжение.Контрагент);
	РеквизитыШапки.Вставить("НалогообложениеНДС", Распоряжение.НалогообложениеНДС);
	РеквизитыШапки.Вставить("НаправлениеДеятельности", Распоряжение.НаправлениеДеятельности);
	РеквизитыШапки.Вставить("ОперацияССамозанятым", Распоряжение.ОперацияССамозанятым);
	РеквизитыШапки.Вставить("Организация", Распоряжение.Организация);
	РеквизитыШапки.Вставить("Партнер", Распоряжение.Партнер);
	РеквизитыШапки.Вставить("Подразделение", Распоряжение.Подразделение);
	РеквизитыШапки.Вставить("ПорядокРасчетов", Распоряжение.ПорядокРасчетов);
	РеквизитыШапки.Вставить("РассчитыватьДатуВозвратаТарыПоКалендарю", Ложь);
	РеквизитыШапки.Вставить("РегистрироватьЦеныПоставщика", Распоряжение.РегистрироватьЦеныПоставщика);
	РеквизитыШапки.Вставить("Склад", Распоряжение.Склад);
	РеквизитыШапки.Вставить("СкладПоступления", Распоряжение.Склад);
	РеквизитыШапки.Вставить("Соглашение", Распоряжение.Соглашение);
	РеквизитыШапки.Вставить("СрокВозвратаМногооборотнойТары", Распоряжение.СрокВозвратаМногооборотнойТары);
	РеквизитыШапки.Вставить("ТребуетсяЗалогЗаТару", Распоряжение.ТребуетсяЗалогЗаТару);
	РеквизитыШапки.Вставить("ФормаОплаты", Распоряжение.ФормаОплаты);
	РеквизитыШапки.Вставить("ХозяйственнаяОперация", Распоряжение.ХозяйственнаяОперация);
	РеквизитыШапки.Вставить("ЦенаВключаетНДС", Распоряжение.ЦенаВключаетНДС);

	ДанныеЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
	
	//СкладПоступления
	СкладПоступления = Неопределено;
	ДанныеЗаполнения.Вставить("СкладПоступления", СкладПоступления);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции //-- БаженоваЕО 06.03.2026

#КонецОбласти
