#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ БаженоваЕО 13.02.2026 СКЛ.4
	Если Комментарий = "Создано автоматически: АРМ Поступление/Отгрузка" Тогда
		
		//создание ОтборРазмещениеТоваров	
		НовыйОтборРазмещениеТоваров = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
		НовыйОтборРазмещениеТоваров.Заполнить(Ссылка);
		НовыйОтборРазмещениеТоваров.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено;
		
		Попытка
			НовыйОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		//создание ПриобретениеТоваровУслуг
		НовыйПриобретениеТоваровУслуг = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
		НовыйПриобретениеТоваровУслуг.Заполнить(Распоряжение);
		НовыйПриобретениеТоваровУслуг.Дата = ТекущаяДата();
		
		НовыйПриобретениеТоваровУслуг.Товары.Очистить();
		Номенклатура = Распоряжение.Товары.ВыгрузитьКолонку("Номенклатура");
		Назначение = Распоряжение.Товары.ВыгрузитьКолонку("Назначение");
		Характеристика = Распоряжение.Товары.ВыгрузитьКолонку("Характеристика");

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток КАК Количество,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток КАК КоличествоКОформлению
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления = &Распоряжение
		|	И ТоварыКПоступлениюОстатки.Номенклатура В (&Номенклатура)
		|	И ТоварыКПоступлениюОстатки.Характеристика В (&Характеристика)
		|	И ТоварыКПоступлениюОстатки.Назначение В (&Назначение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Распоряжение";

		Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Назначение", Назначение);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);

		Результат = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из Результат Цикл
			НоваяСтрокаТЧ = НовыйПриобретениеТоваровУслуг.Товары.Добавить();
			НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
			НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
			НоваяСтрокаТЧ.Назначение = Стр.Назначение;
			НоваяСтрокаТЧ.Серия = Стр.Серия;
			НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
			НоваяСтрокаТЧ.Количество = Стр.Количество;
		КонецЦикла;

		Попытка
			НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		ТекстСообщения = "Документы ""Отбор (размещение) товаров"" и ""Приобретение товаров и услуг"" успешно созданы";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	//-- БаженоваЕО 13.02.2026
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Перем ИмяПоля;
	Перем ДокументОснование;
	Перем ДатаПоступления;
	ТекстСообщенияОНекорректномСоздании = НСтр("ru = 'Приходный ордер на товары нужно вводить из формы ""Приемка"".';
												|en = 'To register a goods receipt, use the ""Receipt"" form.'");

	Если ДанныеЗаполнения = "АвтоТест" Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		ДанныеЗаполнения.Свойство("Склад",                      Склад);
		ДанныеЗаполнения.Свойство("Помещение",                  Помещение);
		ДанныеЗаполнения.Свойство("Распоряжение",               Распоряжение);
		ДанныеЗаполнения.Свойство("ДатаПоступления",            ДатаПоступления);
		ДанныеЗаполнения.Свойство("ЗонаПриемки",                ЗонаПриемки);
		ДанныеЗаполнения.Свойство("СкладскаяОперация",          СкладскаяОперация);
		ДанныеЗаполнения.Свойство("Отправитель",                Отправитель);
		ДанныеЗаполнения.Свойство("ДатаВходящегоДокумента",     ДатаВходящегоДокумента);
		ДанныеЗаполнения.Свойство("НомерВходящегоДокумента",    НомерВходящегоДокумента);
		ДанныеЗаполнения.Свойство("ХозяйственнаяОперация",      ХозяйственнаяОперация);

		Если СкладскаяОперация <> Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваров
			И ЗначениеЗаполнено(Распоряжение) Тогда
			СкладскаяОперация = СкладыКлиентСервер.СкладскаяОперацияПриемкиПоХозяйственнойОперации(ХозяйственнаяОперация);
			УстановитьПривилегированныйРежим(Истина);
			Если СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению
				Или СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства Тогда
				ЗаполнитьТоварыПоТоварамКПоступлению("НоменклатураКоличество", ДатаПоступления);
			Иначе
				ЗаполнитьТоварыПоТоварамКПоступлению("Номенклатура", ДатаПоступления);
			КонецЕсли;

			#Вставка
			//++ СкребковЮМ 10.02.26 СКЛ.19
			Если ДополнительныеСвойства.Свойство("cbr_ЗаполнитьКоличествоПоРаспоряжению") Тогда
				ТоварыВыгрузка = Товары.Выгрузить();
			КонецЕсли;
			//-- СкребковЮМ 10.02.26 СКЛ.19
			#КонецВставки

			ПриходныйОрдерНаТоварыЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

			Документы.ПриходныйОрдерНаТовары.ЗаполнитьСерииПоРаспоряжению(ЭтотОбъект, Ложь);
			УстановитьПривилегированныйРежим(Ложь);
			
			#Вставка
			//++ СкребковЮМ 10.02.26 СКЛ.19
			Если ДополнительныеСвойства.Свойство("cbr_ЗаполнитьКоличествоПоРаспоряжению") Тогда
				
				КлючевыеПоля = Новый Массив;
				КлючевыеПоля.Добавить("Номенклатура");
				КлючевыеПоля.Добавить("Характеристика");
				КлючевыеПоля.Добавить("Назначение");
				КлючевыеПоля.Добавить("Упаковка");
				
				cbr_ЗаполнитьТаблицуИзИсточникаПоПолям(ТоварыВыгрузка, Товары, КлючевыеПоля);
				
			КонецЕсли;
			//-- СкребковЮМ 10.02.26 СКЛ.19
			#КонецВставки
			
		ИначеЕсли СкладскаяОперация <> Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваров Тогда
			ВызватьИсключение ТекстСообщенияОНекорректномСоздании;
		КонецЕсли;

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ СкребковЮМ 10.02.26 СКЛ.19
Процедура cbr_ЗаполнитьТаблицуИзИсточникаПоПолям(ТаблицаИсточник, ТаблицаНазначение, МассивКлючевыхПолей)
	
	Для Каждого СтрокаИсточника Из ТаблицаИсточник Цикл
		НайденнаяСтрока = Неопределено;
		
		Для Каждого СтрокаНазначения Из ТаблицаНазначение Цикл
			Совпадает = Истина;
			Для Каждого ИмяПоля Из МассивКлючевыхПолей Цикл
				Если СтрокаНазначения[ИмяПоля] <> СтрокаИсточника[ИмяПоля] Тогда
					Совпадает = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Совпадает Тогда
				НайденнаяСтрока = СтрокаНазначения;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденнаяСтрока <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтрокаИсточника);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//-- СкребковЮМ 10.02.26 СКЛ.19

#КонецОбласти
