#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ БаженоваЕО 13.02.2026 СКЛ.4
	Если Комментарий = "Создано автоматически: АРМ Поступление/Отгрузка" Тогда
		
		//создание ОтборРазмещениеТоваров	
		НовыйОтборРазмещениеТоваров = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
		НовыйОтборРазмещениеТоваров.Заполнить(Ссылка);
		НовыйОтборРазмещениеТоваров.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.Подготовлено;
		
		Попытка
			НовыйОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		//создание ПриобретениеТоваровУслуг
		НовыйПриобретениеТоваровУслуг = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
		НовыйПриобретениеТоваровУслуг.Заполнить(Распоряжение);
		НовыйПриобретениеТоваровУслуг.Дата = ТекущаяДата();
		
		НовыйПриобретениеТоваровУслуг.Товары.Очистить();
		Номенклатура = Распоряжение.Товары.ВыгрузитьКолонку("Номенклатура");
		Назначение = Распоряжение.Товары.ВыгрузитьКолонку("Назначение");
		Характеристика = Распоряжение.Товары.ВыгрузитьКолонку("Характеристика");

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
		|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток КАК Количество,
		|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
		|	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток КАК КоличествоКОформлению
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления = &Распоряжение
		|	И ТоварыКПоступлениюОстатки.Номенклатура В (&Номенклатура)
		|	И ТоварыКПоступлениюОстатки.Характеристика В (&Характеристика)
		|	И ТоварыКПоступлениюОстатки.Назначение В (&Назначение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Распоряжение";

		Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Назначение", Назначение);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);

		Результат = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из Результат Цикл
			НоваяСтрокаТЧ = НовыйПриобретениеТоваровУслуг.Товары.Добавить();
			НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
			НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
			НоваяСтрокаТЧ.Назначение = Стр.Назначение;
			НоваяСтрокаТЧ.Серия = Стр.Серия;
			НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
			НоваяСтрокаТЧ.Количество = Стр.Количество;
		КонецЦикла;

		Попытка
			НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		ТекстСообщения = "Документы ""Отбор (размещение) товаров"" и ""Приобретение товаров и услуг"" успешно созданы";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	//-- БаженоваЕО 13.02.2026
	
КонецПроцедуры

#КонецОбласти
