#Область СлужебныеПроцедурыИФункции

#Если Не ТолстыйКлиентУправляемоеПриложение И НЕ ТолстыйКлиентОбычноеПриложение  Тогда
Процедура ПолучениеДанныхКЗаполениюИзСКД(Параметры) Экспорт
	МакетСКД = ПолучитьМакет("СКДФормированиеДанныхДляЗаполненияТаблицы");
	СхемаКомпоновкиДанных = МакетСКД;
	КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	ВариантОтчета = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
	КомпоновщикНастроекТЗ.ЗагрузитьНастройки(ВариантОтчета.Настройки);
	НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
	ПараметрыНастройки = НастройкиКомпоновщика.ПараметрыДанных;
	
	ПараметрНачалоПериода = ПараметрыНастройки.Элементы.Найти("НачалоПериода");
	ПараметрНачалоПериода.Значение = Параметры.НачалоПериода;
	ПараметрНачалоПериода.Использование = Истина;
	
	ПараметрКонецПериода = ПараметрыНастройки.Элементы.Найти("КонецПериода");
	ПараметрКонецПериода.Значение = Параметры.КонецПериода;
	ПараметрКонецПериода.Использование = Истина;	
	
	Если Параметры.Свойство("НоменклатураОтборы") и ЗначениеЗаполнено(Параметры.НоменклатураОтборы) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.НоменклатураОтборы;
	КонецЕсли;
	Если Параметры.Свойство("ВидЦены") и ЗначениеЗаполнено(Параметры.ВидЦены) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЦены");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.ВидЦены;
	Иначе
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЦены");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");

	КонецЕсли;
	Если Параметры.Свойство("ТранспортнаяЧистаяЦена") и ЗначениеЗаполнено(Параметры.ТранспортнаяЧистаяЦена) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТранспортнаяЧистаяЦена");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.ТранспортнаяЧистаяЦена;
	КонецЕсли;
	Если Параметры.Свойство("Статус") и ЗначениеЗаполнено(Параметры.Статус) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.Статус;
	КонецЕсли;
	Если Параметры.Свойство("ПризнакВключенияВДействующиеТехКарты") и ЗначениеЗаполнено(Параметры.ПризнакВключенияВДействующиеТехКарты) Тогда
		НастройкиДляЗаполнения = НастройкиКомпоновщика.Отбор.Элементы;
		НовыйЭлементНастроек = НастройкиДляЗаполнения.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементНастроек.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПризнакВключенияВДействующиеТехКарты");
		НовыйЭлементНастроек.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементНастроек.ПравоеЗначение = Параметры.ПризнакВключенияВДействующиеТехКарты;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновкиДанных);
	
	ТаблицаКВыводу = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаКВыводу);
	ПроцессорВывода.Вывести(Процессор);
	
	Параметры.ТаблицаРасчетов = ТаблицаКВыводу;
КонецПроцедуры 

Процедура СоздатьДокумент(Параметры) Экспорт
	ДокументУстановкаЦенНоменклатуры = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокументУстановкаЦенНоменклатуры, Параметры);
	
	Для каждого ЭлементТЧ из Параметры.ТаблицаРасчетов Цикл
		НоваяСтрока = ДокументУстановкаЦенНоменклатуры.Товары2_5.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЧ);
		НоваяСтрока.Цена = ЭлементТЧ.ПлавноваяЦенаБудущегоКвартала;
	КонецЦикла;
	
	НоваяСтрока = ДокументУстановкаЦенНоменклатуры.ВидыЦен.Добавить();
	НоваяСтрока.ВидЦены = Параметры.ВидЦены;
	НоваяСтрока.НастройкиКомпоновкиДанных = Параметры.НастройкиКомпоновкиДанных;
	Попытка
		ДокументУстановкаЦенНоменклатуры.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КОнецПопытки;
КонецПроцедуры

#КонецЕсли
#КонецОбласти
 