//Функция ТекстЗапросаТаблицаРасчетов(ЕстьУсловияОтборов = Истина) Экспорт
//	ТекстЗапроса = 
//	//"ВЫБРАТЬ
//	//|	Номенклатура.Ссылка КАК Номенклатура,
//	//|	Номенклатура.Родитель КАК НоменклатурнаяГруппа
//	//|ИЗ
//	//|	Справочник.Номенклатура КАК Номенклатура
//	//|ГДЕ
//	//|	НЕ Номенклатура.ЭтоГруппа"; 
//	//
//	//Если ЕстьУсловияОтборов Тогда
//	//	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "И Номенклатура.Родитель в (&НоменклатураОтборы)";	
//	//КонецЕсли;
//	"ВЫБРАТЬ
//	|	Номенклатура.Ссылка КАК Номенклатура,
//	|	Номенклатура.Родитель КАК НоменклатураГруппа,
//	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, НЕОПРЕДЕЛЕНО) КАК Характеристика,
//	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования, НЕОПРЕДЕЛЕНО) КАК ХарактеристикаНоменклатурыДляЦенообразования
//	|ПОМЕСТИТЬ втОснова
//	|ИЗ
//	|	Справочник.Номенклатура КАК Номенклатура
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
//	|		ПО &УсловияОтбораНоменклатуры Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
//	|			И (НЕ Номенклатура.ЭтоГруппа)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Номенклатура.Ссылка,
//	|	Номенклатура.Родитель,
//	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, НЕОПРЕДЕЛЕНО),
//	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования, НЕОПРЕДЕЛЕНО)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втОснова.Номенклатура КАК Номенклатура,
//	|	втОснова.НоменклатураГруппа КАК НоменклатураГруппа,
//	|	втОснова.Характеристика КАК Характеристика,
//	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаНоменклатурыДляЦенообразования,
//	|	МАКСИМУМ(ЦеныНоменклатуры25.Цена) КАК Цена,
//	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ) КАК Период
//	|ИЗ
//	|	втОснова КАК втОснова
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры25
//	|		ПО (ЦеныНоменклатуры25.Номенклатура = втОснова.Номенклатура)
//	|			И (ЦеныНоменклатуры25.ХарактеристикаЦО = втОснова.ХарактеристикаНоменклатурыДляЦенообразования)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	втОснова.Номенклатура,
//	|	втОснова.НоменклатураГруппа,
//	|	втОснова.Характеристика,
//	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования,
//	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	втОснова.Номенклатура,
//	|	втОснова.НоменклатураГруппа,
//	|	втОснова.Характеристика,
//	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования,
//	|	МАКСИМУМ(ЦеныНоменклатуры25.Цена),
//	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ)
//	|ИЗ
//	|	втОснова КАК втОснова
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры25
//	|		ПО (ЦеныНоменклатуры25.Номенклатура = втОснова.Номенклатура)
//	|ГДЕ
//	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования = НЕОПРЕДЕЛЕНО
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	втОснова.Номенклатура,
//	|	втОснова.НоменклатураГруппа,
//	|	втОснова.Характеристика,
//	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования,
//	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ)";
//	
//	Если ЕстьУсловияОтборов Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловияОтбораНоменклатуры", Символы.ПС + "Номенклатура.Родитель в (&НоменклатураОтборы) И ");	
//	Иначе
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловияОтбораНоменклатуры", "");
//	КонецЕсли;
//	
//	Возврат ТекстЗапроса;
//КонецФункции  

Функция ТекстЗапросаТаблицаРасчетов(ЕстьУсловияОтборов = Истина) Экспорт
	ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	Номенклатура.Ссылка КАК Номенклатура,
	//|	Номенклатура.Родитель КАК НоменклатурнаяГруппа
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	НЕ Номенклатура.ЭтоГруппа"; 
	//
	//Если ЕстьУсловияОтборов Тогда
	//	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "И Номенклатура.Родитель в (&НоменклатураОтборы)";	
	//КонецЕсли;
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Родитель КАК НоменклатураГруппа,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, НЕОПРЕДЕЛЕНО) КАК Характеристика,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования, НЕОПРЕДЕЛЕНО) КАК ХарактеристикаНоменклатурыДляЦенообразования
	|ПОМЕСТИТЬ втОснова
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО  Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	|			И (НЕ Номенклатура.ЭтоГруппа)
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Ссылка,
	|	Номенклатура.Родитель,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования, НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОснова.Номенклатура КАК Номенклатура,
	|	втОснова.НоменклатураГруппа КАК НоменклатураГруппа,
	|	втОснова.Характеристика КАК Характеристика,
	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаНоменклатурыДляЦенообразования,
	|	МАКСИМУМ(ЦеныНоменклатуры25.Цена) КАК Цена,
	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ) КАК Период
	|ИЗ
	|	втОснова КАК втОснова
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры25
	|		ПО (ЦеныНоменклатуры25.Номенклатура = втОснова.Номенклатура)
	|			И (ЦеныНоменклатуры25.ХарактеристикаЦО = втОснова.ХарактеристикаНоменклатурыДляЦенообразования)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.Номенклатура,
	|	втОснова.НоменклатураГруппа,
	|	втОснова.Характеристика,
	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования,
	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОснова.Номенклатура,
	|	втОснова.НоменклатураГруппа,
	|	втОснова.Характеристика,
	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования,
	|	МАКСИМУМ(ЦеныНоменклатуры25.Цена),
	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ)
	|ИЗ
	|	втОснова КАК втОснова
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25 КАК ЦеныНоменклатуры25
	|		ПО (ЦеныНоменклатуры25.Номенклатура = втОснова.Номенклатура)
	|ГДЕ
	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	втОснова.Номенклатура,
	|	втОснова.НоменклатураГруппа,
	|	втОснова.Характеристика,
	|	втОснова.ХарактеристикаНоменклатурыДляЦенообразования,
	|	КОНЕЦПЕРИОДА(ЦеныНоменклатуры25.Период, МЕСЯЦ)";
	
	Если ЕстьУсловияОтборов Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловияОтбораНоменклатуры", Символы.ПС + "Номенклатура.Родитель в (&НоменклатураОтборы) И ");	
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловияОтбораНоменклатуры", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции 
 

 
 

 