
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура П3_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// НАЧАЛО Османов Н.М. 21.03.2025 
	ОрганизацияТПС = Константы.ОрганизацияТПС.ЗначениеЭтойКонстанты();

	Если Не Организация = ОрганизацияТПС Тогда
		ТекстСообщения = НСтр("ru='Организация для этого документа должна быть: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОрганизацияТПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 21.03.2025 
	
	// НАЧАЛО Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством
	ТаблицаПродукции = Продукция.Выгрузить(, "Номенклатура, Характеристика, Спецификация");
	ТаблицаПродукции.Свернуть("Номенклатура, Характеристика, Спецификация");
	Если ТаблицаПродукции.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru='В таблице ""Продукция"" присутствуют разные позиции Номенклатуры, Характеристики и Спецификации!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ); 
		
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПоЗаказуКлиента")
Процедура П3_ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения)

	ЗаказКлиента = ДанныеЗаполнения.Основание;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказКлиента.Приоритет          КАК Приоритет,
	|	ЗаказКлиента.Организация        КАК Организация,
	|	ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР 
	|		КОГДА ЗаказКлиента.НаправлениеДеятельности.УчетЗатрат
	|			ТОГДА ЗаказКлиента.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента");

	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();

	// Заполнение шапки
	Организация             = Реквизиты.Организация;
	ДокументОснование       = ЗаказКлиента;
	ЗаказПодДеятельность    = Реквизиты.НалогообложениеНДС;
	Приоритет               = Реквизиты.Приоритет;
	НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности;

	// Заполнение табличной части
	ЗаполнитьПоТаблицеТоварыИзХранилища(ДанныеЗаполнения.АдресТовары, "ДатаОтгрузки");
	
	#Вставка // НАЧАЛО Алейников М.Н. 24.03.2025 Б121
	Если Не Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству") Тогда
		СпецификацииЗаполнены = Истина;
		Для Каждого СтрокаПродукции Из Продукция Цикл
			Если Не ЗначениеЗаполнено(СтрокаПродукции.Спецификация) Тогда
				СпецификацииЗаполнены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СпецификацииЗаполнены Тогда
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству"); 
		Иначе
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.АктуализацияСпецификаций"); 
		КонецЕсли;
	КонецЕсли;
	#КонецВставки // КОНЕЦ Алейников М.Н. 24.03.2025 Б121
	
	#Вставка // НАЧАЛО Алейников М.Н. 24.03.2025 Б121
	СвойствоУпаковка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "УпаковкаРеквизитХарактеристики");
	МассивСвойств = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СвойствоУпаковка);
	
	Для Каждого СтрокаПродукции Из Продукция Цикл
		ТаблицаСвойствХарактеристик = УправлениеСвойствами.ЗначенияСвойств(СтрокаПродукции.Характеристика, Истина, , МассивСвойств);
		
		Если ТаблицаСвойствХарактеристик.Количество() Тогда
			ЗначениеСвойстваХарактеристика = ТаблицаСвойствХарактеристик[0].Значение;
			Если Не СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика Тогда
				КоэффициентУпаковки= Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки
				(ЗначениеСвойстваХарактеристика, СтрокаПродукции.Номенклатура);
				СтрокаПродукции.КоличествоУпаковок = СтрокаПродукции.КоличествоУпаковок / КоэффициентУпаковки;
				СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;
	#КонецВставки // КОНЕЦ Алейников М.Н. 24.03.2025 Б121

КонецПроцедуры

#КонецОбласти