#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

//++ ШмелевР
&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацияТПС = Константы.ОрганизацияТПС.ЗначениеЭтойКонстанты();

	Если Не Организация = ОрганизацияТПС Тогда
		ТекстСообщения = НСтр("ru='Организация для этого документа должна быть: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОрганизацияТПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;

	//++ Мохов ПРЗ.17 27.02.2026	
	Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
		ЕстьСпецификации = Ложь;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);		
		Запрос.Текст = "ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация КАК РесурснаяСпецификация
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.cbr_РесурсныеСпецификации КАК СоглашенияСКлиентамиcbr_РесурсныеСпецификации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО (ЗаказКлиента.Соглашение = СоглашенияСКлиентамиcbr_РесурсныеСпецификации.Ссылка)
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Ссылка";		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЕстьСпецификации = Истина;	
		КонецЕсли;			
		ТоварыЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Товары").Выгрузить();	
		Если ЕстьСпецификации Тогда
			Если НЕ ТоварыЗаказКлиента.Найти(Ложь,"cbr_ЭтоПФ") = Неопределено Тогда
				Отказ = Истина;
				СообщениеОбОшибке = Нстр("ru='Обнаружено несоответствие номенклатуры соглашения и номенклатуры в таблице Товары!
				|Запись Заказа на произовдство отменена!'");
				ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
				СобытиеЖурналаРегистрации = "ЗаказНаПроизводство2_2.ПередЗаписью";
				ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);										
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;		
	//-- Мохов ПРЗ.17 
	
КонецПроцедуры //-- ШмелевР

&ИзменениеИКонтроль("ЗаполнитьПоЗаказуКлиента")
Процедура cbr_ЗаполнитьПоЗаказуКлиента(ДанныеЗаполнения)

	ЗаказКлиента = ДанныеЗаполнения.Основание;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказКлиента.Приоритет          КАК Приоритет,
	|	ЗаказКлиента.Организация        КАК Организация,
	|	ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВЫБОР 
	|		КОГДА ЗаказКлиента.НаправлениеДеятельности.УчетЗатрат
	|			ТОГДА ЗаказКлиента.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ЗаказКлиента");

	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();

	// Заполнение шапки
	Организация             = Реквизиты.Организация;
	ДокументОснование       = ЗаказКлиента;
	ЗаказПодДеятельность    = Реквизиты.НалогообложениеНДС;
	Приоритет               = Реквизиты.Приоритет;
	НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности;

	// Заполнение табличной части
	ЗаполнитьПоТаблицеТоварыИзХранилища(ДанныеЗаполнения.АдресТовары, "ДатаОтгрузки");
	
	#Вставка 
	Если Не Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству") Тогда
		СпецификацииЗаполнены = Истина;
		Для Каждого СтрокаПродукции Из Продукция Цикл
			Если Не ЗначениеЗаполнено(СтрокаПродукции.Спецификация) Тогда
				СпецификацииЗаполнены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СпецификацииЗаполнены Тогда
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.КПроизводству"); 
		Иначе
			Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовНаПроизводство2_2.АктуализацияСпецификаций"); 
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
	
	#Вставка
	СвойствоУпаковка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "УпаковкаРеквизитХарактеристики");
	МассивСвойств = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СвойствоУпаковка);
	
	Для Каждого СтрокаПродукции Из Продукция Цикл
		ТаблицаСвойствХарактеристик = УправлениеСвойствами.ЗначенияСвойств(СтрокаПродукции.Характеристика, Истина, , МассивСвойств);
		
		Если ТаблицаСвойствХарактеристик.Количество() Тогда
			ЗначениеСвойстваХарактеристика = ТаблицаСвойствХарактеристик[0].Значение;
			Если Не СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика Тогда
				КоэффициентУпаковки= Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки
				(ЗначениеСвойстваХарактеристика, СтрокаПродукции.Номенклатура);
				СтрокаПродукции.КоличествоУпаковок = СтрокаПродукции.КоличествоУпаковок / КоэффициентУпаковки;
				СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;
	#КонецВставки

КонецПроцедуры


&ИзменениеИКонтроль("ЗаполнитьПоТаблицеТовары")
Процедура cbr_ЗаполнитьПоТаблицеТовары(ТаблицаТоваров)

	Если ТаблицаТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЕстьСпецификация = ТаблицаТоваров.Колонки.Найти("Спецификация") <> Неопределено;

	ЕстьНачатьНеРанее = ТаблицаТоваров.Колонки.Найти("НачатьНеРанее") <> Неопределено;
	Если ЕстьНачатьНеРанее Тогда
		НачатьНеРанее = ТаблицаТоваров[0].НачатьНеРанее;
	КонецЕсли;

	ДоступноНесколькоДатПотребности = ДинамическаяСтруктура;
	НесколькоДатПотребности = Ложь;

	ЕстьДатаПотребности = ТаблицаТоваров.Колонки.Найти("ДатаПотребности") <> Неопределено;
	Если ЕстьДатаПотребности Тогда
		ДатаПотребности = ТаблицаТоваров[0].ДатаПотребности;
	КонецЕсли;

	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураДействий = Новый Структура;

	Если ТаблицаТоваров.Колонки.Найти("КоличествоУпаковок") = Неопределено Тогда
		СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	конецЕсли;
	
	#Вставка
	//++ Мохов ПРЗ.17
	ВывестиСообщение = Ложь;
	Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
		РаботаПоСоглашению = Ложь;
		ВыгрузкаЗапросТоварыЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Товары").Выгрузить();	
		Если НЕ ВыгрузкаЗапросТоварыЗаказКлиента.Найти(Истина,"cbr_ЭтоПФ") = Неопределено Тогда
			РаботаПоСоглашению = Истина;	
		КонецЕсли;	
	КонецЕсли;
	//-- Мохов ПРЗ.17
	#КонецВставки
		
	ОбрабатываемыеСтроки = Новый Массив;
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл

		#Вставка
		//++ Мохов ПРЗ.17
		Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда 
			СтрокаПоискаИзОснования = ВыгрузкаЗапросТоварыЗаказКлиента.Найти(СтрокаТовара.Номенклатура,"Номенклатура");
			Если НЕ СтрокаПоискаИзОснования.cbr_Актуальность Тогда
				ВывестиСообщение = Истина;
				Продолжить;	
			КонецЕсли;
			Если РаботаПоСоглашению И НЕ СтрокаПоискаИзОснования.cbr_ЭтоПФ Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Заказ клиента собирается по соглашению!
				|Номенклатура %1 была исключена!'"),Строка(СтрокаПоискаИзОснования.Номенклатура)));		
				Продолжить;			
			КонецЕсли;	
		КонецЕсли;	
		//-- Мохов ПРЗ.17
		#КонецВставки

		СтрокаПродукция = Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПродукция, СтрокаТовара);

		Если ЕстьНачатьНеРанее Тогда
			НачатьНеРанее = Мин(НачатьНеРанее, СтрокаТовара.НачатьНеРанее);
		КонецЕсли;

		Если ЕстьДатаПотребности Тогда

			Если ДатаПотребности <> СтрокаТовара.ДатаПотребности И Не НесколькоДатПотребности Тогда
				НесколькоДатПотребности = Истина;
			КонецЕсли;

			ДатаПотребности = Мин(ДатаПотребности, СтрокаТовара.ДатаПотребности);

		КонецЕсли;

		ОбрабатываемыеСтроки.Добавить(СтрокаПродукция);

	КонецЦикла;

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Продукция,
		КэшированныеЗначения);

	Если ЗначениеЗаполнено(ДатаПотребности) Тогда
		РазмещениеВыпуска = Перечисления.СпособыПривязкиОперацийПроизводства.КОкончанию;
	КонецЕсли;
	Если НесколькоДатПотребности Тогда
		Если Не ДоступноНесколькоДатПотребности Тогда
			ПроизводствоСервер.ЗаполнитьРеквизитВКоллекции(Продукция, "ДатаПотребности", ДатаПотребности);
		Иначе
			ДатаПотребностиУказываетсяВСтроках = Истина;
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьДанныеСпецификацииВСтроках();

	// если вместе с товарами передается спецификация, нужно исключить возможные конфликты
	Если ЕстьСпецификация И ДинамическаяСтруктура Тогда
		ИсключитьДублированиеСпецификацийВТабличнойЧасти(Продукция);
	КонецЕсли;

	#Вставка
	//++ Мохов ПРЗ.17
	Если ВывестиСообщение Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Из заказа клиента были перенесены не все ресурсные спецификации!
		|Были созданы задачи по их актуализации!'"));		
	КонецЕсли;
	//-- Мохов ПРЗ.17
	#КонецВставки

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗаполнитьДанныеСпецификацииВСтроках")
Процедура cbr_ЗаполнитьДанныеСпецификацииВСтроках(ТолькоНезаполненные)

	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(ЭтотОбъект, Документы.ЗаказНаПроизводство2_2);

	// Заполнение спецификаций
	МассивДанных = Новый Массив;
	МассивСтрок = Новый Массив;
	
	#Вставка
	//++ Мохов 20.02.2026 ПРЗ.17
	Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
		ВыгрузкаЗапросТоварыЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Товары").Выгрузить();	
	КонецЕсли;	
	//-- Мохов 20.02.2026 ПРЗ.17
	#КонецВставки
	
	Для каждого Строка Из Продукция Цикл

		Если ТолькоНезаполненные И Не Строка.Спецификация.Пустая() Тогда
			Продолжить;
		КонецЕсли;

		ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СобратьДанныеОбИзделииДляВыбораСпецификации(
			ЭтотОбъект, Строка, ПараметрыВыбораСпецификаций);

		МассивДанных.Добавить(ДанныеОбИзделии);
		МассивСтрок.Добавить(Строка);
		
		#Вставка
		//++ Мохов 20.02.2026 ПРЗ.17
		Если Тип("ДокументСсылка.ЗаказКлиента") = ТипЗнч(ДокументОснование) Тогда
			СтрокаИзЗапроса = ВыгрузкаЗапросТоварыЗаказКлиента.Найти(Строка.Номенклатура,"Номенклатура");
			Если НЕ СтрокаИзЗапроса = Неопределено	Тогда
				Если СтрокаИзЗапроса.cbr_Актуальность Тогда
					Строка.Спецификация = СтрокаИзЗапроса.Спецификация;
				КонецЕсли;																
			КонецЕсли;	
		КонецЕсли;
		//-- Мохов 20.02.2026 ПРЗ.17
		#КонецВставки
		
	КонецЦикла;

	#Удаление
	// Заполним спецификации
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций);
	#КонецУдаления
	
	#Вставка
	//++ Мохов 20.02.2026 ПРЗ.17	
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций,, ИСТИНА);
	// -- Мохов 20.02.2026 ПРЗ.17
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли