#Область ОбработчикиСобытийФормы

&НаСервере
Процедура cbr_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ СкребковЮМ 11.03.26
	Если ЗначениеЗаполнено(КонтекстИспользования) Тогда
		cbr_ПодготовитьФорму();
	КонецЕсли;
	//-- СкребковЮМ 11.03.26
КонецПроцедуры

#КонецОбласти

#Область НастройкаСписков

&ИзменениеИКонтроль("ТекстЗапроса")
&НаСервере
Функция cbr_ТекстЗапроса(ИмяЭлемента, ПодменятьТекущийЗаказ)
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|					И СостояниеЗаказа.Зарезервировано > 0 ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		ИНАЧЕ СостояниеЗаказа.Состояние
		|	КОНЕЦ КАК Состояние,
		|	СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|		И СостояниеЗаказа.Зарезервировано > 0 И СостояниеЗаказа.Обеспечено > 0 КАК ЗарезервированоИОбеспеченоОдновременно,
		|	СостояниеЗаказа.Номенклатура                                КАК Номенклатура,
		|	СостояниеЗаказа.Номенклатура.ТипНоменклатуры                КАК ТипНоменклатуры,
		|	СостояниеЗаказа.Характеристика                              КАК Характеристика,
		|	СостояниеЗаказа.Склад                                       КАК Склад,
		|	СостояниеЗаказа.Назначение                                  КАК Назначение,
		|	СостояниеЗаказа.ЖелаемаяДатаОтгрузки                        КАК ЖелаемаяДатаОтгрузки,
		|	СостояниеЗаказа.ЗаказНаПоступление                          КАК ЗаказНаПоступление,
		#Вставка
		//++ СкребковЮМ 11.03.26
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку ССЫЛКА Документ.ЗаказКлиента
		|		ТОГДА ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).Автор
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	КОНЕЦ 														КАК Автор,
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаПоступление ССЫЛКА Документ.ЗаказНаПроизводство2_2
		|			ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаПоступление КАК Документ.ЗаказНаПроизводство2_2).Дата, ДЕНЬ)
		|		  КОГДА СостояниеЗаказа.ЗаказНаПоступление ССЫЛКА Документ.ЭтапПроизводства2_2 ТОГДА 
		|			НАЧАЛОПЕРИОДА(РаспоряжениеПоЭтапу.Дата, ДЕНЬ)
		|		  ИНАЧЕ
		|		    ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ 														КАК ДатаЗаказаНаПроизводство,
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку ССЫЛКА Документ.ЗаказКлиента
		|		ТОГДА ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента)
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	КОНЕЦ														КАК ЗаказКлиента,
		|	ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку ССЫЛКА Документ.ЗаказКлиента
		|		ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СостояниеЗаказа.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).cbr_ДатаПостановкиВПлан, ДЕНЬ)
		|	ИНАЧЕ
		|		 ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ														КАК ДатаПостановкиВПлан,
		//-- СкребковЮМ 11.03.26
		#КонецВставки
		|	СостояниеЗаказа.Зарезервировано + СостояниеЗаказа.Обеспечено + СостояниеЗаказа.НеОбеспечено КАК Количество,
		|	&ЗаказНаОтгрузкуПереопределяемый                            КАК ЗаказНаОтгрузку,
		|	РеестрДокументов.Партнер                                    КАК Клиент,
		|	РеестрДокументов.Ответственный                              КАК Менеджер,
		|
		// Производные поля.
		|	СостояниеЗаказа.Номенклатура.ЕдиницаИзмерения                              КАК ЕдиницаИзмерения,
		|	СостояниеЗаказа.Назначение.Заказ                                           КАК ЗаказНазначения,
		|	СостояниеЗаказа.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Обособленно,
		|
		// Поле Действие.
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.НеОбеспечивать)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
		|		КОГДА ОжидаемаяОтгрузка.КОбеспечениюБезРезерва > 0
		|				И ОжидаемаяОтгрузка.РезервироватьПоМереПоступления + ОжидаемаяОтгрузка.ОтложитьРезервирование > 0
		|			ТОГДА ВЫРАЗИТЬ(&ТекстКОбеспечениюИРезервироватьПоМереПоступления КАК СТРОКА(50))
		|		КОГДА ОжидаемаяОтгрузка.КОбеспечениюБезРезерва > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
		|	КОНЕЦ КАК Действие,
		|
		// Поле ДатаПоступления.
		|	ВЫБОР КОГДА СостояниеЗаказа.Состояние В(
		|					ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить),
		|					ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу)) ТОГДА
		|
		|				РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки
		|
		|			ИНАЧЕ
		|
		|				СостояниеЗаказа.ДатаПоступления
		|
		|		КОНЕЦ КАК ДатаПоступления,
		|
		// Поля Способа обеспечения.
		|	ЕСТЬNULL(ВЫРАЗИТЬ(&НадписьЗаказ КАК СТРОКА(5))
		|			+ "" / ""
		|			+ ВЫРАЗИТЬ(РасчетСпособаОбеспеченияПереопределяемый.Ссылка КАК Справочник.СпособыОбеспеченияПотребностей).Наименование,
		|		 """") КАК СпособОбеспеченияНаименование,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(РасчетСпособаОбеспеченияПереопределяемый.Ссылка КАК Справочник.СпособыОбеспеченияПотребностей),
		|		ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)) КАК СпособОбеспечения,
		|
		// Поле ДатаОтгрузкиИсполнима.
		|	СостояниеЗаказа.ЖелаемаяДатаОтгрузки = ДАТАВРЕМЯ(1,1,1)
		|		ИЛИ ВЫБОР
		|				КОГДА СостояниеЗаказа.ЖелаемаяДатаОтгрузки < &НачалоТекущегоДня
		|					ТОГДА &НачалоТекущегоДня
		|				ИНАЧЕ СостояниеЗаказа.ЖелаемаяДатаОтгрузки
		|			КОНЕЦ
		|				>= ВЫБОР
		|						КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате)
		|							ТОГДА
		|								ВЫБОР
		|									КОГДА СостояниеЗаказа.ДатаПоступления < &НачалоТекущегоДня
		|										ТОГДА &НачалоТекущегоДня
		|									ИНАЧЕ СостояниеЗаказа.ДатаПоступления
		|								КОНЕЦ
		|						КОГДА СостояниеЗаказа.Состояние В(
		|								ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу),
		|								ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить)) ТОГДА
		|							РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки
		|						ИНАЧЕ
		|							ДАТАВРЕМЯ(1,1,1)
		|					КОНЕЦ КАК ДатаОтгрузкиИсполнима,
		|
		|	СостояниеЗаказа.ДатаПоступления КАК ДатаПоступленияДляУпорядочивания,
		|	СостояниеЗаказа.Состояние КАК СостояниеДляУпорядочивания,
		|	ЛОЖЬ КАК МожноОтгрузитьИзДоступногоОстатка,
		|	ЛОЖЬ КАК МожноОтгрузитьИзНаличия
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК СостояниеЗаказа
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|		ПО РеестрДокументов.Ссылка = СостояниеЗаказа.ЗаказНаОтгрузку
		|		 И НЕ РеестрДокументов.ДополнительнаяЗапись
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ОжидаемаяОтгрузка
		|		ПО ОжидаемаяОтгрузка.ЗаказНаОтгрузку = СостояниеЗаказа.ЗаказНаОтгрузку
		|		 И ОжидаемаяОтгрузка.ЖелаемаяДатаОтгрузки = СостояниеЗаказа.ЖелаемаяДатаОтгрузки
		|		 И ОжидаемаяОтгрузка.Номенклатура = СостояниеЗаказа.Номенклатура
		|		 И ОжидаемаяОтгрузка.Характеристика = СостояниеЗаказа.Характеристика
		|		 И ОжидаемаяОтгрузка.Склад = СостояниеЗаказа.Склад
		|		 И ОжидаемаяОтгрузка.Назначение = СостояниеЗаказа.Назначение
		|		 И ОжидаемаяОтгрузка.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
		|
		#Вставка
		//++ СкребковЮМ 11.03.26
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК РаспоряжениеПоЭтапу
		|		ПО СостояниеЗаказа.ЗаказНаПоступление ССЫЛКА Документ.ЭтапПроизводства2_2
		|		 И СостояниеЗаказа.ЗаказНаПоступление.Распоряжение = РаспоряжениеПоЭтапу.Ссылка
		//-- СкребковЮМ 11.03.26
		#КонецВставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетСпособаОбеспеченияПереопределяемый ПО ИСТИНА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА
		|
		|ГДЕ
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|				И СостояниеЗаказа.Зарезервировано > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		ИНАЧЕ СостояниеЗаказа.Состояние
		|	КОНЕЦ В (&Состояния)
		|	И ТИПЗНАЧЕНИЯ(СостояниеЗаказа.ЗаказНаОтгрузку) В (&ДоступныеТипыЗаказов)
		|	И(СостояниеЗаказа.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате)
		|			И СостояниеЗаказа.Состояние <> ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу)
		|		ИЛИ &Ожидается
		|		ИЛИ &ОжидаетсяНеВСрок
		|			И СостояниеЗаказа.ЖелаемаяДатаОтгрузки <> ДАТАВРЕМЯ(1, 1, 1)
		|			И СостояниеЗаказа.ДатаПоступления <> ДАТАВРЕМЯ(1, 1, 1)
		|			И ВЫБОР КОГДА СостояниеЗаказа.ЖелаемаяДатаОтгрузки < &НачалоТекущегоДня ТОГДА
		|						&НачалоТекущегоДня
		|					ИНАЧЕ
		|						СостояниеЗаказа.ЖелаемаяДатаОтгрузки
		|				КОНЕЦ < СостояниеЗаказа.ДатаПоступления)
		|	И НЕ СостояниеЗаказа.ЗаказНаОтгрузку В(&ИсключаемыеЗаказы)
		|{ГДЕ
		|	ВЫБОР
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		КОГДА СостояниеЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе)
		|				И СостояниеЗаказа.Зарезервировано > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
		|		ИНАЧЕ СостояниеЗаказа.Состояние
		|	КОНЕЦ КАК Состояние}";
			
	ПодстановкаЗаказНаОтгрузку = "СостояниеЗаказа.ЗаказНаОтгрузку";
	Если ПодменятьТекущийЗаказ Тогда

		ПодстановкаЗаказНаОтгрузку =
			"ВЫБОР КОГДА СостояниеЗаказа.ЗаказНаОтгрузку = &ТекущийЗаказ ТОГДА
			|					ВЫРАЗИТЬ(&НадписьТекущийЗаказ КАК СТРОКА(20))
			|			ИНАЧЕ
			|				СостояниеЗаказа.ЗаказНаОтгрузку
			|		КОНЕЦ";

	КонецЕсли;

	Если ИмяЭлемента = Элементы.Список.Имя Тогда

		ТекстЗапроса = ТекстЗапроса + "
			|{ГДЕ
			|	СостояниеЗаказа.ЗаказНаОтгрузку = &ЗаказНаОтгрузку}
			|{ГДЕ
			|	СостояниеЗаказа.Номенклатура     = &Номенклатура
			|	И СостояниеЗаказа.Характеристика = &Характеристика
			|	И СостояниеЗаказа.Склад          = &Склад}";

	ИначеЕсли ИмяЭлемента = Элементы.СписокЗаказы.Имя Тогда

		ТекстЗапроса = ТекстЗапроса + "
			|{ГДЕ
			|	&Склад = СостояниеЗаказа.Склад}
			|{ГДЕ
			|	&Менеджер = ЕСТЬNULL(РеестрДокументов.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))}
			|{ГДЕ
			|	&Клиент = ЕСТЬNULL(РеестрДокументов.Партнер, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))}
			|{ГДЕ
			|	СостояниеЗаказа.ЗаказНаОтгрузку В(&ЗаказыНаОтгрузку)}";

	ИначеЕсли ИмяЭлемента = Элементы.Набор.Имя Тогда

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрСведений.РаспределениеЗапасов", "ИмитацияОтражения");
		ТекстЗапроса = ТекстЗапроса + "
			|	И СостояниеЗаказа.ЗаказНаОтгрузку В(
			|		ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			Движения.Заказ КАК ЗаказНаОтгрузку
			|		ИЗ
			|			ДвиженияПриЗаписи КАК Движения)
			|УПОРЯДОЧИТЬ ПО
			|	СостояниеДляУпорядочивания,
			|	Номенклатура,
			|	Характеристика,
			|	Склад,
			|	Назначение,
			|	ЗаказНаОтгрузку,
			|	ЖелаемаяДатаОтгрузки,
			|	ЗаказНаПоступление,
			|	ДатаПоступленияДляУпорядочивания";

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЗаказНаОтгрузкуПереопределяемый", ПодстановкаЗаказНаОтгрузку);

	Если АвторизованВнешнийПользователь Тогда

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетСпособаОбеспеченияПереопределяемый.Ссылка", "NULL");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетСпособаОбеспеченияПереопределяемый ПО ИСТИНА", "");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки", "ДАТАВРЕМЯ(1, 1, 1)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА", "");

	Иначе

		Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиОсновногоСпособаОбеспечения(
			"СостояниеЗаказа.Номенклатура",
			"СостояниеЗаказа.Характеристика",
			"СостояниеЗаказа.Склад",
			"СостояниеЗаказа.Состояние В(
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу),
			|	ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить))");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетСпособаОбеспеченияПереопределяемый.Ссылка", Подстановки.Поле);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетСпособаОбеспеченияПереопределяемый ПО ИСТИНА",
			Подстановки.Соединения);

		Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиПлановойДатыПоставки(
			Подстановки.Поле, "&НачалоЭтогоДня", Ложь, Истина);

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РасчетДатыПоставкиПереопределяемый.ПлановаяДатаПоставки", Подстановки.Поле);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПереопределяемый ПО ИСТИНА",
			Подстановки.Соединения);

		Тексты = Новый Массив();
		ТекстВременнойТаблицы = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГодыГрафикаПредприятия();
		Тексты.Добавить(ТекстВременнойТаблицы);
		Тексты.Добавить(ТекстЗапроса);
		ТекстЗапроса = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());

	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ СкребковЮМ 11.03.26
&НаСервере
Процедура cbr_ПодготовитьФорму()
	
	Если ФормыУХ.ЭлементыФормыУХУжеСозданы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписокЗаказов = Элементы.СписокЗаказы;
	ЭлементДоВставки = Элементы.СписокЗаказыЖелаемаяДатаОтгрузки;
	СтрокаСписка = "СписокЗаказы";
	Если КонтекстИспользования = "ЗАКАЗ" Тогда
		ЭлементСписокЗаказов = Элементы.Список;
		ЭлементДоВставки = Элементы.СписокЖелаемаяДатаОтгрузки;
		СтрокаСписка = "Список";
	КонецЕсли;
	
	СписокЗаказыКлиент = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыКлиент",
												"Клиент",
												СтрокаСписка + ".Клиент",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыДатаЗаказаНаПроизводство = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыДатаЗаказаНаПроизводство",
												"Дата Заказа на производство",
												СтрокаСписка + ".ДатаЗаказаНаПроизводство",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыДатаПостановкиВПлан = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыДатаПостановкиВПлан",
												"Дата постановки в план",
												СтрокаСписка + ".ДатаПостановкиВПлан",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыМенедежер = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыМенедежер",
												"Менеджер",
												СтрокаСписка + ".Менеджер",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыАвтор = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыАвтор",
												"Автор",
												СтрокаСписка + ".Автор",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	СписокЗаказыЗаказКлиента = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СписокЗаказыЗаказКлиента",
												"Заказ клиента",
												СтрокаСписка + ".ЗаказКлиента",
												,
												ЭлементСписокЗаказов,
												ЭлементДоВставки);
												
	ФормыУХ.ЭлементыФормыУХДобавлены(ЭтаФорма);
	
КонецПроцедуры //-- СкребковЮМ 11.03.26

#КонецОбласти
