#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&После("РассчитатьКоличество")
Процедура П3_РассчитатьКоличество(ПартияВыпуска, Коллекция, ЕстьУпаковки, ЕстьВероятность, Округлить, КонтрольОкругленияВверх, РассчитатьФормулы, ДанныеДляРасчета)
	
	// НАЧАЛО Османов Н.М. 14.12.2023 Задача ЕРП Учёт технологических потерь
	Если ЕстьВероятность Тогда // пока что эта переменная указывает, что в Коллекции находятся МатериалыУслуги
		
		НастройкаРассчета = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ДокументЭтап2_2", "ОбработкаФормированиеЭтапа", 0); 
		Если Не НастройкаРассчета = 1 Тогда
			Возврат;
		КонецЕсли;
		
		// 0 - установка признака, что не нужно рассчитывать нормы техпотерь
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ДокументЭтап2_2", "ОбработкаФормированиеЭтапа", 0);
		
		РодительИзделия = Неопределено;
		ВидНоменклатурыИзделия = Неопределено;
		Если Коллекция.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(Коллекция[0].Этап) Тогда
				Если ЗначениеЗаполнено(Коллекция[0].Этап.Владелец) Тогда
					ЗначенияРеквизитовИзделия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Коллекция[0].Этап,
																						   "Владелец.ОсновноеИзделиеНоменклатура,
																						   |Владелец.ОсновноеИзделиеНоменклатура.ВидНоменклатуры,
																						   |Владелец.ОсновноеИзделиеНоменклатура.Родитель,
																						   |Владелец.ОсновноеИзделиеВидНоменклатуры");
					
					РодительИзделия = ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеНоменклатураРодитель;
					ВидНоменклатурыИзделия = ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеВидНоменклатуры;
					Если Не ЗначениеЗаполнено(ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеВидНоменклатуры) Тогда
						ВидНоменклатурыИзделия = ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеНоменклатураВидНоменклатуры;
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЭтоПолуфабрикат = Ложь;
		Если ЗначениеЗаполнено(ВидНоменклатурыИзделия) Тогда
			ЭтоПолуфабрикат = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатурыИзделия, "ЭтоПолуфабрикатВидНоменклатуры");
		КонецЕсли;
		
		КоличествоИзделия = 0;		
		Если ПартияВыпуска.Свойство("Расшифровка") Тогда
			Если ТипЗнч(ПартияВыпуска.Расшифровка) = Тип("Массив") И ПартияВыпуска.Расшифровка.Количество() > 0 Тогда
				КоличествоИзделия = ПартияВыпуска.Расшифровка[0].Числитель;
			Иначе
				КоличествоИзделия = ПартияВыпуска.Числитель;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РодительИзделия) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.НормаТехнологическихПотерь КАК НормаТехнологическихПотерь
			|ИЗ
			|	РегистрСведений.НормыТехнологическихПотерьИВремениИзготовления.СрезПоследних(, ГруппаНоменклатуры = &РодительИзделия) КАК НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних
			|ГДЕ
			|	НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.МинимальныйОбъем <= &Количество
			|	И ВЫБОР
			|			КОГДА НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.МаксимальныйОбъем = 0
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.МаксимальныйОбъем > &Количество
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.Период УБЫВ";
			
			Запрос.УстановитьПараметр("Количество", КоличествоИзделия);
			Запрос.УстановитьПараметр("РодительИзделия", РодительИзделия);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				
				Если ЭтоПолуфабрикат = Истина Тогда
					Возврат;
				КонецЕсли;
					
				Для Каждого СтрокаКоллекции Из Коллекция Цикл
					
					ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ВидНоменклатуры");
					ЭтоПолуфабрикатОбеспечения = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
					Если ЭтоПолуфабрикатОбеспечения = Истина Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = Цел(СтрокаКоллекции.КоличествоУпаковок);
					Если ЦелоеКоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок Тогда
						Продолжить;
					КонецЕсли;
					
					Если Не СтрокаКоллекции.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ЕдиницаИзмерения") Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = ЦелоеКоличествоУпаковок + 1;
					СтрокаКоллекции.КоличествоУпаковок = ЦелоеКоличествоУпаковок;
					СтрокаКоллекции.Количество = ЦелоеКоличествоУпаковок;
					
				КонецЦикла;
				
				Возврат;
				
			КонецЕсли;
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НормаТехнологическихПотерь = Выборка.НормаТехнологическихПотерь;
			
			Если Не ЗначениеЗаполнено(НормаТехнологическихПотерь) Тогда
				
				Если ЭтоПолуфабрикат = Истина Тогда
					Возврат;
				КонецЕсли;
				
				Для Каждого СтрокаКоллекции Из Коллекция Цикл
					
					ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ВидНоменклатуры");
					ЭтоПолуфабрикатОбеспечения = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
					Если ЭтоПолуфабрикатОбеспечения = Истина Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = Цел(СтрокаКоллекции.КоличествоУпаковок);
					Если ЦелоеКоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок Тогда
						Продолжить;
					КонецЕсли;
					
					Если Не СтрокаКоллекции.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ЕдиницаИзмерения") Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = ЦелоеКоличествоУпаковок + 1;
					СтрокаКоллекции.КоличествоУпаковок = ЦелоеКоличествоУпаковок;
					СтрокаКоллекции.Количество = ЦелоеКоличествоУпаковок;
					
				КонецЦикла;
				
				Возврат;
				
			КонецЕсли;
			
			Для Каждого СтрокаКоллекции Из Коллекция Цикл
								
				СтрокаКоллекции.Количество = СтрокаКоллекции.Количество  * (1 + НормаТехнологическихПотерь / 100);
				СтрокаКоллекции.КоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок  * (1 + НормаТехнологическихПотерь / 100);
				
				Если ЭтоПолуфабрикат = Истина Тогда
					Продолжить;
				КонецЕсли;
				
				ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ВидНоменклатуры");
				ЭтоПолуфабрикатОбеспечения = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
				Если ЭтоПолуфабрикатОбеспечения = Истина Тогда
					Продолжить;
				КонецЕсли;
				
				ЦелоеКоличествоУпаковок = Цел(СтрокаКоллекции.КоличествоУпаковок);
				Если ЦелоеКоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не СтрокаКоллекции.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ЕдиницаИзмерения") Тогда
					Продолжить;
				КонецЕсли;
				
				ЦелоеКоличествоУпаковок = ЦелоеКоличествоУпаковок + 1;
				СтрокаКоллекции.КоличествоУпаковок = ЦелоеКоличествоУпаковок;
				СтрокаКоллекции.Количество = ЦелоеКоличествоУпаковок;
				
			КонецЦикла;
			
			ТекстСообщения = НСтр("ru = 'Применена норма технологических потерь, равная %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, НормаТехнологическихПотерь);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
			
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 14.12.2023 Задача ЕРП Учёт технологических потерь
	
КонецПроцедуры

&После("ОбработкаПолученияПредставления")
Процедура П3_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЕстьЗапрет = РаботаСПроизводствомСервер.УстановленЗапретОткрытияСпецификации(Данные.Ссылка);
	
	Если ЕстьЗапрет Тогда
		
		СтандартнаяОбработка = Ложь;
		Представление = "Запрещено к просмотру";
		
	КонецЕсли;
	
КонецПроцедуры

Функция АктивнаяСпецификация(Объект) Экспорт
	
	// НАЧАЛО Османов Н.М. 04.03.2025 
	РезультатФункции = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
		|	И РесурсныеСпецификации.ОсновноеИзделиеХарактеристика = &ОсновноеИзделиеХарактеристика
		|	И РесурсныеСпецификации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
		|	И РесурсныеСпецификации.П3_Активность
		|	И НЕ РесурсныеСпецификации.Ссылка = &Ссылка
		|	И НЕ РесурсныеСпецификации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", Объект.ОсновноеИзделиеНоменклатура);
	Запрос.УстановитьПараметр("ОсновноеИзделиеХарактеристика", Объект.ОсновноеИзделиеХарактеристика);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РезультатФункции = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат РезультатФункции;
	// КОНЕЦ Османов Н.М. 04.03.2025 
	
КонецФункции

#КонецОбласти

#КонецЕсли