
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура cbr_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	//Параметры.ТолькоРедактированиеКоличества = Истина;
	
КонецПроцедуры

&НаСервере
Процедура cbr_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// НАЧАЛО Османов Н.М. 13.02.2025 
	//ДопРеквизитНомерСерииПоставщика = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "НомерСерииПоставщика");
	//Если ЗначениеЗаполнено(ДопРеквизитНомерСерииПоставщика) Тогда
	//	ОтборПоиска = Новый Структура("Свойство",ДопРеквизитНомерСерииПоставщика);
	//	СтрокиДопРеквизита = ЭтаФорма.Объект_СерииСвойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(ОтборПоиска);
	//	Если СтрокиДопРеквизита.Количество() > 0 Тогда
	//		Элементы[СтрокиДопРеквизита[0].ИмяРеквизитаЗначение].ТолькоПросмотр = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	Элементы.СерииНомер.ТолькоПросмотр = Истина;
	//Элементы.СерииДатаПроизводства.ТолькоПросмотр = Истина;
	//Элементы.СерииГоденДо.ТолькоПросмотр = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерииДатаПроизводства.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Серии.Серия");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СерииГоденДо.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Серии.Серия");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	// КОНЕЦ Османов Н.М. 13.02.2025
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура cbr_СгенерироватьНомерПосле(Команда)
	
	ТекущиеДанные = Элементы.Серии.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Номер = НомерСтрокаПоШаблону();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НомерСтрокаПоШаблону()
	
	НомерПоШаблону = РегистрыСведений.НомераСерийПоВидам.СледущийНомерСерии(РеквизитыНоменклатуры.ВидНоменклатуры);
	
	МаксимальныйНомер = 0;
	МассивНомеров = Объект.Серии.Выгрузить(, "Номер").ВыгрузитьКолонку("Номер");
	Для Каждого СтрокаМассива Из МассивНомеров Цикл
		
		ЧислоНомера = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СтрокаМассива);
		Если Не ЧислоНомера = Неопределено Тогда
			МаксимальныйНомер = Макс(МаксимальныйНомер, ЧислоНомера);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧислоНомераПоШаблону = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НомерПоШаблону);
	МаксимальныйНомер = Макс(МаксимальныйНомер, ЧислоНомераПоШаблону);

	Возврат РегистрыСведений.НомераСерийПоВидам.ПривестиКШаблону(МаксимальныйНомер, РеквизитыНоменклатуры.ВидНоменклатуры);
	
КонецФункции

#КонецОбласти


