#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ПолучитьСтатистикуПотребленияВФоне")
Функция cbr_ПолучитьСтатистикуПотребленияВФоне()

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("КлючПотребности", Параметры.КлючПотребности);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Расчет статистики потребления';
	|en = 'Calculation of consumption statistics'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
    #Вставка     
	//++ ШмелевР 18.03.26 ЗКП.2           
	Если ЭтаФорма.Параметры.Свойство("МестоЗапуска") Тогда
		ПараметрыПроцедуры.КлючПотребности.Вставить("МестоЗапуска", ЭтаФорма.Параметры.МестоЗапуска);	
	КонецЕсли;
	//-- ШмелевР 18.03.26 ЗКП.2
	#КонецВставки
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.ОбеспечениеПотребностей.СтатистикаПотребления",
	ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции
#КонецОбласти