#Область ОбработчикиСобытий

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура cbr_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	//++ БаженоваЕО 03.02.2026 СКЛ.4
	КомандаСозданияНаОснованииЗадание = Документы.ЗаданиеНаПеревозку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если КомандаСозданияНаОснованииЗадание <> Неопределено Тогда
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаСозданияНаОснованииЗадание, 
															"СпособДоставки", 
															Перечисления.СпособыДоставки.Самовывоз,
															ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	//-- БаженоваЕО 03.02.2026 СКЛ.4
КонецПроцедуры

&После("ДобавитьКомандыОтчетов")
Процедура cbr_ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	//++ БаженоваЕО 26.01.2026 ПРД17
	Отчеты.cbr_ОценкаРентабельностиПродажСДополнением.ДобавитьКомандуОтчета(КомандыОтчетов);
	//-- БаженоваЕО 26.01.2026
КонецПроцедуры

#КонецОбласти