#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Перед("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	//++ Мохов ПРЗ.17
	МассивБезПроверки = Новый Массив;
	СтруктураСпецификаций = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация КАК РесурснаяСпецификация,
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация.Статус КАК Статус,
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация.ОсновноеИзделиеНоменклатура КАК Номенклатура
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.cbr_РесурсныеСпецификации КАК СоглашенияСКлиентамиcbr_РесурсныеСпецификации
	|ГДЕ
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", Соглашение);
	ЗапросВыборка = Запрос.Выполнить().Выбрать();
	Пока ЗапросВыборка.Следующий() Цикл
		Если Товары.Найти(ЗапросВыборка.Номенклатура,"Номенлатура") = Неопределено Тогда
			МассивБезПроверки = ЗапросВыборка.Номенклатура;
			СтруктураСпецификаций.Вставить("РесурснаяСпецификация",ЗапросВыборка.РесурснаяСпецификация);
			СтруктураСпецификаций.Вставить("Статус",ЗапросВыборка.Статус);
			СтруктураСпецификаций.Вставить("Номенклатура",ЗапросВыборка.Номенклатура);
		КонецЕсли;	
	КонецЦикла;	
	
	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	Для каждого Элемент из МассивБезПроверки Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(МассивНоменклатуры,Элемент);
	КонецЦикла;
	
	ПараметрыВыбораСпецификаций = cbr_ПолучитьПараметрыВыбораСпецификаций();
	МассивДанных = Новый Массив;
	МассивСтрок = Новый Массив;
	Для каждого Строка Из Товары Цикл
		ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СобратьДанныеОбИзделииДляВыбораСпецификации(
			ЭтотОбъект, Строка, ПараметрыВыбораСпецификаций);

		МассивДанных.Добавить(ДанныеОбИзделии);
		МассивСтрок.Добавить(Строка);		
	КонецЦикла;
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций,, ИСТИНА);	
	
	МассивСпецификации = новый Массив;
	Для каждого Строка Из Товары Цикл
		МассивСпецификации.Добавить(Строка.Спецификация);	
	КонецЦикла;
			
	ВыгрузкаОставшихся = cbr_РекурсивныйЗапросСпецификации(МассивСпецификации);
	Для каждого Строка Из ВыгрузкаОставшихся Цикл
		СтруктураСпецификаций.Вставить("РесурснаяСпецификация",Строка.РесурснаяСпецификация);
		СтруктураСпецификаций.Вставить("Статус",Строка.Статус);
		СтруктураСпецификаций.Вставить("Номенклатура",ЗапросВыборка.Номенклатура);		
	КонецЦикла;	
		
	СпецификацияДействуетСсылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.СпецификацияДействует;
	СпецификацияДействует = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпецификацияДействуетСсылка,"Значение");
	
	Для каждого Строка Из СтруктураСпецификаций Цикл
		Если Строка.Статус = СпецификацияДействует Тогда
			Товары.Спецификация = Строка.РесурснаяСпецификация;
			Товары.cbr_Актуальность = Истина;
		Иначе
			cbr_РаботаСОшибкойАктуальности(Строка.РесурснаяСпецификация, Дата, Строка.Номенклатура);
			Товары.cbr_Актуальность = Ложь;
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;				
	//-- Мохов ПРЗ.17	
	
КонецПроцедуры	

&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)

	//++AlopinAs 16.02.26 ПРД 20

	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записать();	
	МассивДат = Товары.ВыгрузитьКолонку("ДатаОтгрузки");
	
	Если МассивДат.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не заполнена табличная часть товары!'")));
		Отказ = Истина;
	КонецЕсли;
	
	МинимумМассива = СортировкаСпискомЗначений(МассивДат)[0];
	МаксимумМассива = СортировкаСпискомЗначений(МассивДат)[МассивДат.Количество()-1];

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика,
		|	ВТТЧ.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВТТЧ.Количество КАК Количество,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТНоменклатураИзСоглашения
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|		ПО ВТТЧ.Номенклатура = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура
		|		И ВТТЧ.Характеристика = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика
		|		И ВТТЧ.ДатаОтгрузки
		|			МЕЖДУ СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания
		|ГДЕ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Соглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Период, &НачалоПериода) КАК Период,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоНачальныйОстаток, 0) КАК НачальныйОстаток,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоКонечныйОстаток, 0) КАК КонечныйОстаток,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоОборот, 0) КАК Оборот,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоПриход, 0) КАК Приход,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоРасход, 0) КАК Расход
		|ПОМЕСТИТЬ ВТРегистр
		|ИЗ
		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.ОстаткиИОбороты(&НачалоПериода,
		|			&КонецПериода, День, ДвиженияИГраницыПериода, Соглашение = &Соглашение
		|		И (Номенклатура, Характеристика, ДатаНачала) В
		|			(ВЫБРАТЬ
		|				ВТНоменклатураИзСоглашения.Номенклатура,
		|				ВТНоменклатураИзСоглашения.Характеристика,
		|				ВТНоменклатураИзСоглашения.ДатаНачала
		|			ИЗ
		|				ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения)) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты
		|		ПО ВТНоменклатураИзСоглашения.Номенклатура = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Номенклатура
		|		И ВТНоменклатураИзСоглашения.Характеристика = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки КАК ДатаОтгрузки,
		|	МАКСИМУМ(ВТРегистр.Период) КАК Период,
		|	ВТНоменклатураИзСоглашения.Количество КАК Количество,
		|	ВТНоменклатураИзСоглашения.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТСоответсвиеДатыПериоду
		|ИЗ
		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
		|		ПО ВТРегистр.Период <= ВТНоменклатураИзСоглашения.ДатаОтгрузки
		|СГРУППИРОВАТЬ ПО
		|	ВТНоменклатураИзСоглашения.Номенклатура,
		|	ВТНоменклатураИзСоглашения.Характеристика,
		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки,
		|	ВТНоменклатураИзСоглашения.Количество,
		|	ВТНоменклатураИзСоглашения.ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСоответсвиеДатыПериоду.Номенклатура КАК Номенклатура,
		|	ВТСоответсвиеДатыПериоду.Характеристика КАК Характеристика,
		|	ВТСоответсвиеДатыПериоду.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВЫБОР
		|		КОГДА ВТСоответсвиеДатыПериоду.ДатаОтгрузки = ВТРегистр.Период
		|			ТОГДА ВТРегистр.НачальныйОстаток
		|		ИНАЧЕ ВТРегистр.КонечныйОстаток
		|	КОНЕЦ КАК КоличествоОстаток,
		|	ВТСоответсвиеДатыПериоду.Количество КАК Количество,
		|	ВТСоответсвиеДатыПериоду.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	ВТСоответсвиеДатыПериоду КАК ВТСоответсвиеДатыПериоду
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
		|		ПО ВТСоответсвиеДатыПериоду.Номенклатура = ВТРегистр.Номенклатура
		|		И ВТСоответсвиеДатыПериоду.Характеристика = ВТРегистр.Характеристика
		|		И ВТРегистр.Период = ВТСоответсвиеДатыПериоду.Период";
	
	
	
	Запрос.УстановитьПараметр("НачалоПериода", МинимумМассива);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КонецПериода", МаксимумМассива);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьРоли = Ложь;
	
	Если (РольДоступна("cbr_ЗаписьЗаказаКлиентаСОтрицательнымиОстатками") или РольДоступна("ПолныеПрава")) Тогда
		ЕстьРоли = Истина;
	КонецЕсли;
	
	СтатусКВыполнению = Ложь;
	
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
		СтатусКВыполнению = Истина;
	КонецЕсли; 

	Пока ВыборкаДетальныеЗаписи.Следующий() и СтатусКВыполнению Цикл
		
		Превышение = ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
		Если Превышение > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"" на количество ""%3""'"),
			ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика, Превышение));
			Если Не ЕстьРоли Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Отказ Тогда
			Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.ДобавитьРасход();
			Движение.Период = ВыборкаДетальныеЗаписи.ДатаОтгрузки;
			Движение.Соглашение = Соглашение;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			Движение.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;
	КонецЦикла;

	//--AlopinAs 16.02.26 ПРД 20
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//++AlopinAs 16.02.26 ПРД 20
Функция СортировкаСпискомЗначений(Знач Массив)
	
	мСписокЗнч = Новый СписокЗначений;
    мСписокЗнч.ЗагрузитьЗначения(Массив);
    мСписокЗнч.СортироватьПоЗначению(НаправлениеСортировки.Возр);  
      
    Возврат мСписокЗнч.ВыгрузитьЗначения();
    
КонецФункции
//--AlopinAs 16.02.26 ПРД 20

//++ Мохов ПРЗ.17
Функция cbr_ПолучитьПараметрыВыбораСпецификаций()
	ПараметрыВыбораСпецификаций = Новый Структура;
	ДоступныеСтатусы = Новый Массив;
	ДоступныеСтатусы.Добавить(Перечисления.СтатусыСпецификаций.Действует);
	ДоступныеТипы = Новый Массив;
	ДоступныеТипы.Добавить(Перечисления.ТипыПроизводственныхПроцессов.Сборка);
	СвязиПараметровВыбораСтруктура = Новый Структура;
	СвязиПараметровВыбораСтруктура.Вставить("Номенклатура","Объект.Товары.Номенклатура");
	СвязиПараметровВыбораСтруктура.Вставить("Характеристика","Объект.Товары.Характеристика");
	СвязиПараметровВыбора = Новый Соответствие;
	СвязиПараметровВыбора.Вставить("Объект.Товары.Спецификация",СвязиПараметровВыбораСтруктура);	
	
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеТипы",ДоступныеТипы);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСтатусы",ДоступныеСтатусы);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииНаПобочныйВыход",Истина);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииСПроизводствомНаСтороне",Истина);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииПоНоменклатуре",Истина);
	ПараметрыВыбораСпецификаций.Вставить("РеквизитыСпецификации","");
	ПараметрыВыбораСпецификаций.Вставить("СвязиПараметровВыбора",СвязиПараметровВыбора);	
	Возврат ПараметрыВыбораСпецификаций;
КонецФункции//-- Мохов ПРЗ.17

Функция cbr_РекурсивныйЗапросСпецификации(МассивСпецификаций)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСпецификаций", МассивСпецификаций);
	Запрос.Текст = "ВЫБРАТЬ
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Ссылка КАК РесурснаяСпецификация,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Статус КАК Статус,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура КАК Номенклатура
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги 
	|ГДЕ
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Ссылка В(&СписокСпецификаций)
	|	И РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе";
	РезультатЗапрос = Запрос.Выполнить().Выгрузить();		
	НовыйМассив = РезультатЗапрос.ВыгрузитьКолонку("РесурснаяСпецификация");
	Если МассивСпецификаций.Количетсво() <> РезультатЗапрос.Количетсво() Тогда
		cbr_РекурсивныйЗапросСпецификации(НовыйМассив);
	Иначе
		Возврат РезультатЗапрос;	
	КонецЕсли;
	
КонецФункции //-- Мохов ПРЗ.17		

//++ Мохов ПРЗ.17
Процедура cbr_РаботаСОшибкойАктуальности(Спецификация, Дата, Номенклатура)
	
	СообщениеОбОшибке = "По спецфикации " + Спецификация + " не пройдена проверка актуальности!";
	ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
	СобытиеЖурналаРегистрации = "ЗаказКлиента.ОбработкаПроведения";
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
	
	НоменклатураПредставлени = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Номенклатура,"Представление");
	СообщениеТема = "Актуализация спецификации";
	СообщениеТекст = "По номенклатуре " + НоменклатураПредставлени + " отсутствует актуальная специфика-ция";
	Автор = Пользователи.ТекущийПользователь();
		
	РолиИсполнителейСсылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.РольОтветственныйЗаСпецификации;
	РолиИсполнителей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РолиИсполнителейСсылка, "Значение");
	
	НовоеПоручение = БизнесПроцессы.Исполнение.СоздатьБизнесПроцесс();
    НовоеПоручение.Дата = Дата;
    НовоеПоручение.Автор = Автор;
    НовоеПоручение.Наименование = СообщениеТема;
    НовоеПоручение.Записать();
    НовоеПоручение.Старт();
    
    НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
    НоваяЗадача.ТочкаМаршрута = БизнесПроцессы.Исполнение.ТочкиМаршрута.Исполнить;
    НоваяЗадача.БизнесПроцесс = НовоеПоручение.Ссылка;
    НоваяЗадача.Автор = Автор;
    НоваяЗадача.Дата = Дата;
    НоваяЗадача.Исполнитель = РолиИсполнителей;
    НоваяЗадача.Наименование = СообщениеТема;
    НоваяЗадача.Описание = СообщениеТекст;
    НоваяЗадача.Записать();	
	НоваяЗадача.Старт();
	
КонецПроцедуры //-- Мохов ПРЗ.17	
	
#КонецОбласти
#КонецЕсли