#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Перед("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	//++ Мохов ПРЗ.17
	МассивБезПроверки = Новый Массив;
	СтруктураСпецификаций = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация КАК РесурснаяСпецификация,
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация.Статус КАК Статус,
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация.ОсновноеИзделиеНоменклатура КАК Номенклатура
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.cbr_РесурсныеСпецификации КАК СоглашенияСКлиентамиcbr_РесурсныеСпецификации
	|ГДЕ
	|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", Соглашение);
	ЗапросВыборка = Запрос.Выполнить().Выбрать();
	Пока ЗапросВыборка.Следующий() Цикл
		Если Товары.Найти(ЗапросВыборка.Номенклатура, "Номенклатура") = Неопределено Тогда
			МассивБезПроверки = ЗапросВыборка.Номенклатура;
			СтруктураСпецификаций.Вставить("РесурснаяСпецификация",ЗапросВыборка.РесурснаяСпецификация);
			СтруктураСпецификаций.Вставить("Статус",ЗапросВыборка.Статус);
			СтруктураСпецификаций.Вставить("Номенклатура",ЗапросВыборка.Номенклатура);
		КонецЕсли;	
	КонецЦикла;	
	
	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	Для каждого Элемент из МассивБезПроверки Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(МассивНоменклатуры,Элемент);
	КонецЦикла;
	
	ПараметрыВыбораСпецификаций = cbr_ПолучитьПараметрыВыбораСпецификаций();
	МассивДанных = Новый Массив;
	МассивСтрок = Новый Массив;
	Для каждого Строка Из Товары Цикл
		ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СобратьДанныеОбИзделииДляВыбораСпецификации(
			ЭтотОбъект, Строка, ПараметрыВыбораСпецификаций);

		МассивДанных.Добавить(ДанныеОбИзделии);
		МассивСтрок.Добавить(Строка);		
	КонецЦикла;
	УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций,, ИСТИНА);	
	
	МассивСпецификации = новый Массив;
	Для каждого Строка Из Товары Цикл
		МассивСпецификации.Добавить(Строка.Спецификация);	
	КонецЦикла;
			
	ВыгрузкаОставшихся = cbr_РекурсивныйЗапросСпецификации(МассивСпецификации,МассивСпецификации);
		
	СпецификацияДействуетСсылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.СпецификацияДействует;
	СпецификацияДействует = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпецификацияДействуетСсылка,"Значение");
	
	Для каждого Строка Из ВыгрузкаОставшихся Цикл
		СтрокаТовары = Товары.Найти(Строка.Номенклатура,"Номенклатура");
		Если СтрокаТовары = Неопределено Тогда
			Если НЕ Строка.Статус = СпецификацияДействует Тогда			
				cbr_РаботаСОшибкойАктуальности(Строка.РесурснаяСпецификация, Дата, Строка.Номенклатура);
				Отказ = Истина;
			КонецЕсли;	
		Иначе		
			Если Строка.Статус = СпецификацияДействует Тогда			
				СтрокаТовары.Спецификация = Строка.РесурснаяСпецификация;
				СтрокаТовары.cbr_Актуальность = Истина;
			Иначе
				cbr_РаботаСОшибкойАктуальности(Строка.РесурснаяСпецификация, Дата, Строка.Номенклатура);
				СтрокаТовары.cbr_Актуальность = Ложь;
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;				
	//-- Мохов ПРЗ.17	
	
КонецПроцедуры	
&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	//++AlopinAs 16.02.26 ПРД 20

	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записать();	
	МассивДат = Товары.ВыгрузитьКолонку("ДатаОтгрузки");
	
	Если МассивДат.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не заполнена табличная часть товары!'")));
		Отказ = Истина;
	КонецЕсли;
	
	МинимумМассива = СортировкаСпискомЗначений(МассивДат)[0];
	МаксимумМассива = СортировкаСпискомЗначений(МассивДат)[МассивДат.Количество()-1];

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика,
		|	ВТТЧ.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВТТЧ.Количество КАК Количество,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТНоменклатураИзСоглашения
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|		ПО ВТТЧ.Номенклатура = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура
		|		И ВТТЧ.Характеристика = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика
		|		И ВТТЧ.ДатаОтгрузки
		|			МЕЖДУ СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания
		|ГДЕ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Соглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Период, &НачалоПериода) КАК Период,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоНачальныйОстаток, 0) КАК НачальныйОстаток,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоКонечныйОстаток, 0) КАК КонечныйОстаток,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоОборот, 0) КАК Оборот,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоПриход, 0) КАК Приход,
		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоРасход, 0) КАК Расход
		|ПОМЕСТИТЬ ВТРегистр
		|ИЗ
		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.ОстаткиИОбороты(&НачалоПериода,
		|			&КонецПериода, День, ДвиженияИГраницыПериода, Соглашение = &Соглашение
		|		И (Номенклатура, Характеристика, ДатаНачала) В
		|			(ВЫБРАТЬ
		|				ВТНоменклатураИзСоглашения.Номенклатура,
		|				ВТНоменклатураИзСоглашения.Характеристика,
		|				ВТНоменклатураИзСоглашения.ДатаНачала
		|			ИЗ
		|				ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения)) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты
		|		ПО ВТНоменклатураИзСоглашения.Номенклатура = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Номенклатура
		|		И ВТНоменклатураИзСоглашения.Характеристика = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки КАК ДатаОтгрузки,
		|	МАКСИМУМ(ВТРегистр.Период) КАК Период,
		|	ВТНоменклатураИзСоглашения.Количество КАК Количество,
		|	ВТНоменклатураИзСоглашения.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТСоответсвиеДатыПериоду
		|ИЗ
		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
		|		ПО ВТРегистр.Период <= ВТНоменклатураИзСоглашения.ДатаОтгрузки
		|СГРУППИРОВАТЬ ПО
		|	ВТНоменклатураИзСоглашения.Номенклатура,
		|	ВТНоменклатураИзСоглашения.Характеристика,
		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки,
		|	ВТНоменклатураИзСоглашения.Количество,
		|	ВТНоменклатураИзСоглашения.ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСоответсвиеДатыПериоду.Номенклатура КАК Номенклатура,
		|	ВТСоответсвиеДатыПериоду.Характеристика КАК Характеристика,
		|	ВТСоответсвиеДатыПериоду.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВЫБОР
		|		КОГДА ВТСоответсвиеДатыПериоду.ДатаОтгрузки = ВТРегистр.Период
		|			ТОГДА ВТРегистр.НачальныйОстаток
		|		ИНАЧЕ ВТРегистр.КонечныйОстаток
		|	КОНЕЦ КАК КоличествоОстаток,
		|	ВТСоответсвиеДатыПериоду.Количество КАК Количество,
		|	ВТСоответсвиеДатыПериоду.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	ВТСоответсвиеДатыПериоду КАК ВТСоответсвиеДатыПериоду
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
		|		ПО ВТСоответсвиеДатыПериоду.Номенклатура = ВТРегистр.Номенклатура
		|		И ВТСоответсвиеДатыПериоду.Характеристика = ВТРегистр.Характеристика
		|		И ВТРегистр.Период = ВТСоответсвиеДатыПериоду.Период";
	
	
	
	Запрос.УстановитьПараметр("НачалоПериода", МинимумМассива);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КонецПериода", МаксимумМассива);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьРоли = Ложь;
	
	Если (РольДоступна("cbr_ЗаписьЗаказаКлиентаСОтрицательнымиОстатками") или РольДоступна("ПолныеПрава")) Тогда
		ЕстьРоли = Истина;
	КонецЕсли;
	
	СтатусКВыполнению = Ложь;
	
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
		СтатусКВыполнению = Истина;
	КонецЕсли; 

	Пока ВыборкаДетальныеЗаписи.Следующий() и СтатусКВыполнению Цикл
		
		Превышение = ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
		Если Превышение > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"" на количество ""%3""'"),
			ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика, Превышение));
			Если Не ЕстьРоли Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Отказ Тогда
			Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.ДобавитьРасход();
			Движение.Период = ВыборкаДетальныеЗаписи.ДатаОтгрузки;
			Движение.Соглашение = Соглашение;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			Движение.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;
	КонецЦикла;

	//--AlopinAs 16.02.26 ПРД 20
	
	//++ БаженоваЕО 27.02.2026 ПРД.21
	ЭтотОбъект.cbr_МаксимальнаяРучнаяСкидка = 0;
	Для Каждого СтрТЧ Из Товары Цикл
		ЭтотОбъект.cbr_МаксимальнаяРучнаяСкидка = Макс(ЭтотОбъект.cbr_МаксимальнаяРучнаяСкидка, СтрТЧ.ПроцентРучнойСкидки)	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка.cbr_СтоимостьДоставкиСНДС / ЗаказКлиентаТовары.Ссылка.СуммаДокумента * 100 КАК Поле1
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка.cbr_СтоимостьДоставкиСНДС,
		|	ЗаказКлиентаТовары.Ссылка.СуммаДокумента,
		|	ЗаказКлиентаТовары.Ссылка.cbr_СтоимостьДоставкиСНДС / ЗаказКлиентаТовары.Ссылка.СуммаДокумента * 100";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтотОбъект.cbr_ПроцентТУ = 0;
	КонецЦикла;
	 
	ЭтотОбъект.cbr_МаксимальнаяРучная = ЭтотОбъект.cbr_МаксимальнаяРучнаяСкидка + ЭтотОбъект.cbr_ПроцентТУ;
	
	ЭтотОбъект.cbr_ПроцентАВ = 0; 
	Для Каждого Стр Из cbr_АгентскиеВознаграждения Цикл
		ЭтотОбъект.cbr_ПроцентАВ = ЭтотОбъект.cbr_ПроцентАВ + Стр.СтавкаАВ;
	КонецЦикла;
	 
	//-- БаженоваЕО 27.02.2026
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//++AlopinAs 16.02.26 ПРД 20
Функция СортировкаСпискомЗначений(Знач Массив)
	
	мСписокЗнч = Новый СписокЗначений;
    мСписокЗнч.ЗагрузитьЗначения(Массив);
    мСписокЗнч.СортироватьПоЗначению(НаправлениеСортировки.Возр);  
      
    Возврат мСписокЗнч.ВыгрузитьЗначения();
    
КонецФункции
//--AlopinAs 16.02.26 ПРД 20

//++ Мохов ПРЗ.17
Функция cbr_ПолучитьПараметрыВыбораСпецификаций()
	ПараметрыВыбораСпецификаций = Новый Структура;
	ДоступныеСтатусы = Новый Массив;
	ДоступныеСтатусы.Добавить(Перечисления.СтатусыСпецификаций.Действует);
	ДоступныеТипы = Новый Массив;
	ДоступныеТипы.Добавить(Перечисления.ТипыПроизводственныхПроцессов.Сборка);
	СвязиПараметровВыбораСтруктура = Новый Структура;
	СвязиПараметровВыбораСтруктура.Вставить("Номенклатура","Объект.Товары.Номенклатура");
	СвязиПараметровВыбораСтруктура.Вставить("Характеристика","Объект.Товары.Характеристика");
	СвязиПараметровВыбора = Новый Соответствие;
	СвязиПараметровВыбора.Вставить("Объект.Товары.Спецификация",СвязиПараметровВыбораСтруктура);	
	
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеТипы",ДоступныеТипы);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСтатусы",ДоступныеСтатусы);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииНаПобочныйВыход",Истина);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииСПроизводствомНаСтороне",Истина);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииПоНоменклатуре",Истина);
	ПараметрыВыбораСпецификаций.Вставить("РеквизитыСпецификации","");
	ПараметрыВыбораСпецификаций.Вставить("СвязиПараметровВыбора",СвязиПараметровВыбора);	
	Возврат ПараметрыВыбораСпецификаций;
КонецФункции//-- Мохов ПРЗ.17

//++ Мохов ПРЗ.17
Функция cbr_РекурсивныйЗапросСпецификации(МассивСпецификаций, МассивВывода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСпецификаций", МассивСпецификаций);
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	РесурсныеСпецификации.Ссылка КАК РесурснаяСпецификация
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	|		ПО (РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = РесурсныеСпецификацииМатериалыИУслуги.Номенклатура)
	|			И (РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РесурсныеСпецификацииДата.Ссылка КАК Ссылка,
	|			МАКСИМУМ(РесурсныеСпецификацииДата.НачалоДействия) КАК НачалоДействия
	|		ИЗ
	|			Справочник.РесурсныеСпецификации КАК РесурсныеСпецификацииДата
	|		ГДЕ
	|			РесурсныеСпецификацииДата.НачалоДействия <= &НаДату		
	|		СГРУППИРОВАТЬ ПО
	|			РесурсныеСпецификацииДата.Ссылка) КАК РесурсныеСпецификацииДатаПоследнего
	|		ПО (РесурсныеСпецификацииДатаПоследнего.Ссылка = РесурсныеСпецификации.Ссылка)
	|			И (РесурсныеСпецификации.НачалоДействия = РесурсныеСпецификацииДатаПоследнего.НачалоДействия)
	|ГДЕ
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Ссылка В(&СписокСпецификаций)
	|	И РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе";
	РезультатЗапрос = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапрос.Количество() > 0 Тогда
		НовыйМассив = РезультатЗапрос.ВыгрузитьКолонку("РесурснаяСпецификация");
		Для каждого Элемент Из НовыйМассив Цикл
			МассивВывода.Добавить(Элемент);	
		КонецЦикла;
		Возврат cbr_РекурсивныйЗапросСпецификации(НовыйМассив,МассивВывода)
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СписокСпецификаций", МассивВывода);	
		Запрос.Текст = "ВЫБРАТЬ
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК РесурснаяСпецификация,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Статус КАК Статус,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура КАК Номенклатура
		|ИЗ
		|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		|ГДЕ
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка В(&СписокСпецификаций)
		|
		|СГРУППИРОВАТЬ ПО
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Статус,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура";		
		Возврат Запрос.Выполнить().Выгрузить()
	КонецЕсли;	
	
КонецФункции //-- Мохов ПРЗ.17		
	
//++ Мохов ПРЗ.17
Процедура cbr_РаботаСОшибкойАктуальности(Спецификация, Дата, Номенклатура)
	
	СообщениеОбОшибке = "По спецфикации " + Спецификация + " не пройдена проверка актуальности!";
	ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
	СобытиеЖурналаРегистрации = "ЗаказКлиента.ОбработкаПроведения";
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
	
	СообщениеТема = "Актуализация спецификации";
	СообщениеТекст = "По номенклатуре " + Строка(Номенклатура) + " отсутствует актуальная спецификация";
	Автор = Пользователи.ТекущийПользователь();
		
	РолиИсполнителейСсылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.РольОтветственныйЗаСпецификации;
	РолиИсполнителей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РолиИсполнителейСсылка, "Значение");
	
	НовоеПоручение = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
    НовоеПоручение.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен;
    НовоеПоручение.Дата = Дата;
    НовоеПоручение.Автор = Автор;
    НовоеПоручение.Наименование = СообщениеТема;
    НовоеПоручение.Содержание = СообщениеТекст;
    НовоеПоручение.Исполнитель = РолиИсполнителей;
    НовоеПоручение.Проверяющий = Автор;
    НовоеПоручение.Предмет = Ссылка; 
    НовоеПоручение.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;   
    НовоеПоручение.Записать();
    НовоеПоручение.Старт();
	
КонецПроцедуры //-- Мохов ПРЗ.17	
	
#КонецОбласти
#КонецЕсли
