#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	//++AlopinAs 16.02.26 ПРД 20

	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записать();	
//++AlopinAs 170326 ПРД20
//	МассивДат = Товары.ВыгрузитьКолонку("ДатаОтгрузки");
//	Если МассивДат.Количество() = 0 Тогда
//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не заполнена табличная часть товары!'")));
//		Отказ = Истина;
//	КонецЕсли;

	
//	МинимумМассива = СортировкаСпискомЗначений(МассивДат)[0];
//	МаксимумМассива = СортировкаСпискомЗначений(МассивДат)[МассивДат.Количество()-1];

//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
//		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
//		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	ЗаказКлиентаТовары.Количество КАК Количество
//		|ПОМЕСТИТЬ ВТТЧ
//		|ИЗ
//		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		|ГДЕ
//		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТТЧ.Номенклатура КАК Номенклатура,
//		|	ВТТЧ.Характеристика КАК Характеристика,
//		|	ВТТЧ.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	ВТТЧ.Количество КАК Количество,
//		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
//		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
//		|ПОМЕСТИТЬ ВТНоменклатураИзСоглашения
//		|ИЗ
//		|	ВТТЧ КАК ВТТЧ
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
//		|		ПО ВТТЧ.Номенклатура = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура
//		|		И ВТТЧ.Характеристика = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика
//		|		И ВТТЧ.ДатаОтгрузки
//		|			МЕЖДУ СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания
//		|ГДЕ
//		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Соглашение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
//		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Период, &НачалоПериода) КАК Период,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоНачальныйОстаток, 0) КАК НачальныйОстаток,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоКонечныйОстаток, 0) КАК КонечныйОстаток,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоОборот, 0) КАК Оборот,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоПриход, 0) КАК Приход,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоРасход, 0) КАК Расход
//		|ПОМЕСТИТЬ ВТРегистр
//		|ИЗ
//		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.ОстаткиИОбороты(&НачалоПериода,
//		|			&КонецПериода, День, ДвиженияИГраницыПериода, Соглашение = &Соглашение
//		|		И (Номенклатура, Характеристика, ДатаНачала) В
//		|			(ВЫБРАТЬ
//		|				ВТНоменклатураИзСоглашения.Номенклатура,
//		|				ВТНоменклатураИзСоглашения.Характеристика,
//		|				ВТНоменклатураИзСоглашения.ДатаНачала
//		|			ИЗ
//		|				ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения)) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты
//		|		ПО ВТНоменклатураИзСоглашения.Номенклатура = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Номенклатура
//		|		И ВТНоменклатураИзСоглашения.Характеристика = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Характеристика
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
//		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
//		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	МАКСИМУМ(ВТРегистр.Период) КАК Период,
//		|	ВТНоменклатураИзСоглашения.Количество КАК Количество,
//		|	ВТНоменклатураИзСоглашения.ДатаНачала КАК ДатаНачала
//		|ПОМЕСТИТЬ ВТСоответсвиеДатыПериоду
//		|ИЗ
//		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
//		|		ПО ВТРегистр.Период <= ВТНоменклатураИзСоглашения.ДатаОтгрузки
//		|СГРУППИРОВАТЬ ПО
//		|	ВТНоменклатураИзСоглашения.Номенклатура,
//		|	ВТНоменклатураИзСоглашения.Характеристика,
//		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки,
//		|	ВТНоменклатураИзСоглашения.Количество,
//		|	ВТНоменклатураИзСоглашения.ДатаНачала
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТСоответсвиеДатыПериоду.Номенклатура КАК Номенклатура,
//		|	ВТСоответсвиеДатыПериоду.Характеристика КАК Характеристика,
//		|	ВТСоответсвиеДатыПериоду.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	ВЫБОР
//		|		КОГДА ВТСоответсвиеДатыПериоду.ДатаОтгрузки = ВТРегистр.Период
//		|			ТОГДА ВТРегистр.НачальныйОстаток
//		|		ИНАЧЕ ВТРегистр.КонечныйОстаток
//		|	КОНЕЦ КАК КоличествоОстаток,
//		|	ВТСоответсвиеДатыПериоду.Количество КАК Количество,
//		|	ВТСоответсвиеДатыПериоду.ДатаНачала КАК ДатаНачала
//		|ИЗ
//		|	ВТСоответсвиеДатыПериоду КАК ВТСоответсвиеДатыПериоду
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
//		|		ПО ВТСоответсвиеДатыПериоду.Номенклатура = ВТРегистр.Номенклатура
//		|		И ВТСоответсвиеДатыПериоду.Характеристика = ВТРегистр.Характеристика
//		|		И ВТРегистр.Период = ВТСоответсвиеДатыПериоду.Период";
//	
//	
//	
//	Запрос.УстановитьПараметр("НачалоПериода", МинимумМассива);
//	Запрос.УстановитьПараметр("Соглашение", Соглашение);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.УстановитьПараметр("КонецПериода", МаксимумМассива);
//	
//	РезультатЗапроса = Запрос.Выполнить();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	ЗаказКлиентаТовары.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика,
		|	ВТТЧ.Количество КАК Количество,
		|	ВТТЧ.Дата КАК Дата,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания,
		|	ВТТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТНоменклатураИзСоглашения
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|		ПО ВТТЧ.Номенклатура = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура
		|		И ВТТЧ.Характеристика = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика
		|		И ВТТЧ.ЕдиницаИзмерения = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения
		|		И ВТТЧ.Дата
		|			МЕЖДУ СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания
		|ГДЕ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка.Ссылка = &Соглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
		|	ВТНоменклатураИзСоглашения.Количество КАК Количество,
		|	ВТНоменклатураИзСоглашения.Дата КАК Дата,
		|	ВТНоменклатураИзСоглашения.ДатаНачала КАК ДатаНачала,
		|	ВТНоменклатураИзСоглашения.ДатаОкончания КАК ДатаОкончания,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТНоменклатураИзСоглашения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.Остатки(&МоментВремени,
		|			Соглашение = &Соглашение
		|		И (Номенклатура, Характеристика, ДатаНачала, ЕдиницаИзмерения) В
		|			(ВЫБРАТЬ
		|				ВТНоменклатураИзСоглашения.Номенклатура,
		|				ВТНоменклатураИзСоглашения.Характеристика,
		|				ВТНоменклатураИзСоглашения.ДатаНачала,
		|				ВТНоменклатураИзСоглашения.ЕдиницаИзмерения
		|			ИЗ
		|				ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения)) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстатки
		|		ПО ВТНоменклатураИзСоглашения.Номенклатура = cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Номенклатура
		|		И ВТНоменклатураИзСоглашения.Характеристика = cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Характеристика
		|		И ВТНоменклатураИзСоглашения.ЕдиницаИзмерения = cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.ЕдиницаИзмерения
		|		И ВТНоменклатураИзСоглашения.ДатаНачала = cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.ДатаНачала";
	
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
//--AlopinAs 170326 ПРД20
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьРоли = Ложь;
	
	Если (РольДоступна("cbr_ЗаписьЗаказаКлиентаСОтрицательнымиОстатками") или РольДоступна("ПолныеПрава")) Тогда
		ЕстьРоли = Истина;
	КонецЕсли;
	
	СтатусКВыполнению = Ложь;
	
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
		СтатусКВыполнению = Истина;
	КонецЕсли; 

	Пока ВыборкаДетальныеЗаписи.Следующий() и СтатусКВыполнению Цикл
		
		Превышение = ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
		Если Превышение > 0 Тогда
			//++AlopinAs 170326 ПРД20
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"" на количество ""%3""'"),
//			ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика, Превышение));
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"", единице измерения ""%3"" на количество ""%4""'"),
			ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика,ВыборкаДетальныеЗаписи.ЕдиницаИзмерения, Превышение));
			//--AlopinAs 170326 ПРД20
			Если Не ЕстьРоли Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Отказ Тогда
			Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.ДобавитьРасход();
			Движение.Период = ВыборкаДетальныеЗаписи.Дата;
			Движение.Соглашение = Соглашение;
			//++AlopinAs 170326 ПРД20
			Движение.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
			//--AlopinAs 170326 ПРД20
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			Движение.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
			Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;
	КонецЦикла;

	//--AlopinAs 16.02.26 ПРД 20
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;	
	
	//++ Мохов ПРЗ.17
	Если cbr_ПроверитьСхемыНомеклатуры() Тогда			
		МассивБезПроверки = Новый Массив;
		СтруктураСпецификаций = Новый Структура;
	
		Для каждого СтрокаТовары Из Товары Цикл
			СтрокаТовары.cbr_ЭтоПФ = Ложь;
			СтрокаТовары.cbr_Актуальность = Ложь;
			СтрокаТовары.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();			
		КонецЦикла;
		
		РаботаемПоСоглашению = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация КАК РесурснаяСпецификация,
		|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация.Статус КАК Статус,
		|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.РесурснаяСпецификация.ОсновноеИзделиеНоменклатура КАК Номенклатура
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.cbr_РесурсныеСпецификации КАК СоглашенияСКлиентамиcbr_РесурсныеСпецификации
		|ГДЕ
		|	СоглашенияСКлиентамиcbr_РесурсныеСпецификации.Ссылка = &Ссылка";	
		Запрос.УстановитьПараметр("Ссылка", Соглашение);
		ЗапросВыборка = Запрос.Выполнить().Выбрать();
		Пока ЗапросВыборка.Следующий() Цикл
			РаботаемПоСоглашению = Истина;
			СтрокаТовары = Товары.Найти(ЗапросВыборка.Номенклатура,"Номенклатура");
			Если СтрокаТовары = Неопределено Тогда
				МассивБезПроверки.Добавить(ЗапросВыборка.Номенклатура);
				СтруктураСпецификаций.Вставить("РесурснаяСпецификация",ЗапросВыборка.РесурснаяСпецификация);
				СтруктураСпецификаций.Вставить("Статус",ЗапросВыборка.Статус);
				СтруктураСпецификаций.Вставить("Номенклатура",ЗапросВыборка.Номенклатура);
			Иначе
				СтрокаТовары.cbr_ЭтоПФ = Истина;		
			КонецЕсли;	
		КонецЦикла;	
			
		МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
		Для каждого Элемент из МассивБезПроверки Цикл
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(МассивНоменклатуры,Элемент);
		КонецЦикла;
		
		ПараметрыВыбораСпецификаций = cbr_ПолучитьПараметрыВыбораСпецификаций();
		МассивДанных = Новый Массив;
		МассивСтрок = Новый Массив;
		Для каждого Строка Из Товары Цикл
			ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СобратьДанныеОбИзделииДляВыбораСпецификации(
				ЭтотОбъект, Строка, ПараметрыВыбораСпецификаций);
			МассивДанных.Добавить(ДанныеОбИзделии);
			МассивСтрок.Добавить(Строка);		
		КонецЦикла;
		УправлениеДаннымиОбИзделиях.ЗаполнитьСпецификациюВСтроках(МассивСтрок, МассивДанных, ПараметрыВыбораСпецификаций,, ИСТИНА);	
		
		МассивСпецификации = новый Массив;
		Для каждого Строка Из Товары Цикл
			МассивСпецификации.Добавить(Строка.Спецификация);	
		КонецЦикла;
				
		ВыгрузкаОставшихся = cbr_РекурсивныйЗапросСпецификации(МассивСпецификации,МассивСпецификации);
		
		СоответствиеНаАктуализацию = Новый Соответствие ();
				
		Для каждого Строка Из ВыгрузкаОставшихся Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура",Строка.Номенклатура);
			СтрокиТоваров = Товары.НайтиСтроки(ПараметрыОтбора);
			Если СтрокиТоваров.Количество() > 0 Тогда
				Для каждого СтрокаТовары из СтрокиТоваров Цикл				
					Если СтрокаТовары = Неопределено Тогда
						Если НЕ Строка.Статус = Перечисления.СтатусыСпецификаций.Действует Тогда			
							СоответствиеНаАктуализацию.Вставить(Строка.Номенклатура, СтрокаТовары.РесурснаяСпецификация);
						КонецЕсли;	
					Иначе							
						Если Строка.Статус = Перечисления.СтатусыСпецификаций.Действует Тогда			
							СтрокаТовары.Спецификация = Строка.РесурснаяСпецификация;
							СтрокаТовары.cbr_Актуальность = Истина;
							Если РаботаемПоСоглашению И НЕ СтрокаТовары.cbr_ЭтоПФ Тогда
								СтрокаТовары.cbr_Актуальность = Ложь;
								ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Заказ клиента собирается по соглашению!
								|Номенклатура %1 в него не входит!'"),Строка(СтрокаТовары.Номенклатура)));												
							КонецЕсли;						
						Иначе
							СтрокаТовары.cbr_Актуальность = Ложь;							
							СтрокаТовары.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();																											
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;	
					
		Для каждого СтрокаТовары Из Товары Цикл
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "ТипНоменклатуры") =
				Перечисления.ТипыНоменклатуры.Товар Тогда		
				Если НЕ ЗначениеЗаполнено(СтрокаТовары.Спецификация) Тогда 
					Если РаботаемПоСоглашению И НЕ СтрокаТовары.cbr_ЭтоПФ Тогда
						ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Заказ клиента собирается по соглашению!
						|Номенклатура %1 в него не входит!'"),Строка(СтрокаТовары.Номенклатура)));
						Продолжить;												
					КонецЕсли;				
					СоответствиеНаАктуализацию.Вставить(Строка.Номенклатура, Неопределено);		
				КонецЕсли;
			Иначе
				СтрокаТовары.cbr_Актуальность = Истина;
			КонецЕсли;					
		КонецЦикла;	
		
		Если СоответствиеНаАктуализацию.Количество() > 0 Тогда							
			cbr_РаботаСОшибкойАктуальности(СоответствиеНаАктуализацию);	
		КонецЕсли;	
	КонецЕсли;						
	//-- Мохов ПРЗ.17
	
	//++ БаженоваЕО 10.03.2026 ПРД.21
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению И ЗначениеЗаполнено(Соглашение) Тогда

			СостояниеОбъекта = ПолучитьСостояниеДокумента(Ссылка);

			Если НЕ СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена Тогда
				ОбщегоНазначения.СообщитьПользователю(
					"Нельзя провести документ в статусе ""К выполнению"", если статус по согласованию не в статусе ""Утвержден""");
				Отказ = Истина;
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	//-- БаженоваЕО 10.03.2026

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//++AlopinAs 16.02.26 ПРД 20
Функция СортировкаСпискомЗначений(Знач Массив)
	
	мСписокЗнч = Новый СписокЗначений;
    мСписокЗнч.ЗагрузитьЗначения(Массив);
    мСписокЗнч.СортироватьПоЗначению(НаправлениеСортировки.Возр);  
      
    Возврат мСписокЗнч.ВыгрузитьЗначения();
    
КонецФункции
//--AlopinAs 16.02.26 ПРД 20

//++ Мохов ПРЗ.17
Функция cbr_ПолучитьПараметрыВыбораСпецификаций()
	ПараметрыВыбораСпецификаций = Новый Структура;
	ДоступныеСтатусы = Новый Массив;
	ДоступныеСтатусы.Добавить(Перечисления.СтатусыСпецификаций.Действует);
	ДоступныеТипы = Новый Массив;
	ДоступныеТипы.Добавить(Перечисления.ТипыПроизводственныхПроцессов.Сборка);
	СвязиПараметровВыбораСтруктура = Новый Структура;
	СвязиПараметровВыбораСтруктура.Вставить("Номенклатура","Объект.Товары.Номенклатура");
	СвязиПараметровВыбораСтруктура.Вставить("Характеристика","Объект.Товары.Характеристика");
	СвязиПараметровВыбора = Новый Соответствие;
	СвязиПараметровВыбора.Вставить("Объект.Товары.Спецификация",СвязиПараметровВыбораСтруктура);	
	
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеТипы",ДоступныеТипы);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСтатусы",ДоступныеСтатусы);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииНаПобочныйВыход",Истина);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииСПроизводствомНаСтороне",Истина);
	ПараметрыВыбораСпецификаций.Вставить("ДоступныеСпецификацииПоНоменклатуре",Истина);
	ПараметрыВыбораСпецификаций.Вставить("РеквизитыСпецификации","");
	ПараметрыВыбораСпецификаций.Вставить("СвязиПараметровВыбора",СвязиПараметровВыбора);	
	Возврат ПараметрыВыбораСпецификаций;
КонецФункции//-- Мохов ПРЗ.17

//++ Мохов ПРЗ.17
Функция cbr_РекурсивныйЗапросСпецификации(МассивСпецификаций, МассивВывода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСпецификаций", МассивСпецификаций);
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	РесурсныеСпецификации.Ссылка КАК РесурснаяСпецификация
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	|		ПО (РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = РесурсныеСпецификацииМатериалыИУслуги.Номенклатура)
	|			И (РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РесурсныеСпецификацииДата.Ссылка КАК Ссылка,
	|			МАКСИМУМ(РесурсныеСпецификацииДата.НачалоДействия) КАК НачалоДействия
	|		ИЗ
	|			Справочник.РесурсныеСпецификации КАК РесурсныеСпецификацииДата
	|		ГДЕ
	|			РесурсныеСпецификацииДата.НачалоДействия <= &НаДату		
	|		СГРУППИРОВАТЬ ПО
	|			РесурсныеСпецификацииДата.Ссылка) КАК РесурсныеСпецификацииДатаПоследнего
	|		ПО (РесурсныеСпецификацииДатаПоследнего.Ссылка = РесурсныеСпецификации.Ссылка)
	|			И (РесурсныеСпецификации.НачалоДействия = РесурсныеСпецификацииДатаПоследнего.НачалоДействия)
	|ГДЕ
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Ссылка В(&СписокСпецификаций)
	|	И РесурсныеСпецификацииМатериалыИУслуги.ПроизводитсяВПроцессе";
	РезультатЗапрос = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапрос.Количество() > 0 Тогда
		НовыйМассив = РезультатЗапрос.ВыгрузитьКолонку("РесурснаяСпецификация");
		Для каждого Элемент Из НовыйМассив Цикл
			МассивВывода.Добавить(Элемент);	
		КонецЦикла;
		Возврат cbr_РекурсивныйЗапросСпецификации(НовыйМассив,МассивВывода)
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СписокСпецификаций", МассивВывода);	
		Запрос.Текст = "ВЫБРАТЬ
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК РесурснаяСпецификация,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Статус КАК Статус,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура КАК Номенклатура
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификацииМатериалыИУслуги
		|ГДЕ
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка В(&СписокСпецификаций)
		|
		|СГРУППИРОВАТЬ ПО
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.Статус,
		|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура";		
		Возврат Запрос.Выполнить().Выгрузить()
	КонецЕсли;	
	
КонецФункции //-- Мохов ПРЗ.17		
	
//++ Мохов ПРЗ.17
Процедура cbr_РаботаСОшибкойАктуальности(СоответствиеНаАктуализацию)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	Задание.Представление КАК Представление,
	|	Задание.Завершен КАК Завершен	
	|ИЗ
	|	БизнесПроцесс.Задание КАК Задание
	|ГДЕ
	|	Задание.Предмет = &Предмет";
	Запрос.УстановитьПараметр("Предмет",Ссылка );
	РезультатЗапрос = Запрос.Выполнить();
	Если НЕ РезультатЗапрос.Пустой() Тогда
		Выборка = РезультатЗапрос.выбрать();
		Выборка.Следующий();
		ОбщегоНазначения.СообщитьПользователю(?(Выборка.Завершен,
		"По данному заказу сформирована закрытая задача на актуализацию:" + Символы.ПС + Выборка.Представление,
		"По данному заказу сформирована активная задача на актуализацию:" + Символы.ПС + Выборка.Представление));		
		Возврат;
	КонецЕсли;	
	
	СообщениеОбОшибке = "Необходимо актуализировать:" + Символы.ПС;
	
	Для каждого Элемент Из СоответствиеНаАктуализацию Цикл
		Если Элемент.Значение = Неопределено Тогда
			СообщениеОбОшибке = СообщениеОбОшибке + "Спефицикацию по номенклатуре " + Строка(Элемент.Ключ) + Символы.ПС;	
		Иначе
			СообщениеОбОшибке = СообщениеОбОшибке + "Спефицикацию " + Строка(Элемент.Значение) + Символы.ПС;			
		КонецЕсли;			
	КонецЦикла;	
	
	ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
	СобытиеЖурналаРегистрации = "ЗаказКлиента.ПередЗаписью";
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Предупреждение, , , СообщениеОбОшибке);	
		
	СообщениеТема = "Актуализация спецификации";
	СообщениеТекст = СообщениеОбОшибке;
	Автор = Пользователи.ТекущийПользователь();
		
	РолиИсполнителейСсылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.РольОтветственныйЗаСпецификации;
	РолиИсполнителей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РолиИсполнителейСсылка, "Значение");
	
	НовоеПоручение = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
    НовоеПоручение.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен;
    НовоеПоручение.Дата = Дата;
    НовоеПоручение.Автор = Автор;
    НовоеПоручение.Наименование = СообщениеТема;
    НовоеПоручение.Содержание = СообщениеТекст;
    НовоеПоручение.Исполнитель = РолиИсполнителей;
    НовоеПоручение.Проверяющий = Автор;
    НовоеПоручение.Предмет = Ссылка; 
    НовоеПоручение.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
    Попытка   
	    НовоеПоручение.Записать();
	    НовоеПоручение.Старт();
    Исключение
    	ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		СобытиеЖурналаРегистрации = "ЗаказКлиента.ПередЗаписью";
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());    
    КонецПопытки;
    
КонецПроцедуры //-- Мохов ПРЗ.17	

//++ Мохов ПРЗ.17
Функция cbr_ПроверитьСхемыНомеклатуры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВЫБОР
	|		КОГДА cbr_АтуальныеСхемыОбеспеченияНоменклатуры.СхемаОбеспечения = ЗаказКлиентаТовары.Номенклатура.СхемаОбеспечения
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СхемаАкутальна
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_АтуальныеСхемыОбеспеченияНоменклатуры КАК cbr_АтуальныеСхемыОбеспеченияНоменклатуры
	|		ПО (ЗаказКлиентаТовары.Номенклатура.СхемаОбеспечения = cbr_АтуальныеСхемыОбеспеченияНоменклатуры.СхемаОбеспечения)
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	АктуальныеСхемы = Запрос.Выполнить().Выбрать();
	ПродолжитьВыполнение = Истина;
	СтрокаСообщения = "";
	
	Пока АктуальныеСхемы.Следующий() Цикл			
		Если НЕ АктуальныеСхемы.СхемаАкутальна Тогда
			ПродолжитьВыполнение = Ложь;
			СтрокаСообщения = СтрокаСообщения + СтрШаблон("По номенклатуре %1 нету соответствия схемы обеспечения",
				АктуальныеСхемы.НоменклатураПредставление) + Символы.ПС;		
		КонецЕсли;						
	КонецЦикла;
	
	Если НЕ ПродолжитьВыполнение Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
		СобытиеЖурналаРегистрации = "ЗаказКлиента.ПередЗаписью";
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Предупреждение, , , СтрокаСообщения);
	КонецЕсли;		
	Возврат ПродолжитьВыполнение	
	
КонецФункции //-- Мохов ПРЗ.17	

//++ БаженоваЕО 12.03.2026 ПРД.21
Функция ПолучитьСостояниеДокумента(Ссылка)
			
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
	|ИЗ
	|	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	|ГДЕ
	|	РегистрСостоянийОбъектовСрезПоследних.Объект = &Объект";

	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СостояниеОбъекта = Выборка.СостояниеОбъекта;
	КонецЦикла;
	
	Возврат СостояниеОбъекта;
			
КонецФункции //-- БаженоваЕО 12.03.2026
	
#КонецОбласти
#КонецЕсли
