#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Очистить();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСоглашение
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|ГДЕ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &СсылкаСоглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика,
		|	ВТТЧ.Количество КАК Количество,
		|	ВТТЧ.Упаковка КАК Упаковка,
		|	ВТСоглашение.ДатаНачала КАК ДатаНачала,
		|	ВТТЧ.ДатаОтгрузки КАК ДатаОтгрузки
		|ПОМЕСТИТЬ ВТДвижения
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСоглашение КАК ВТСоглашение
		|		ПО ВТТЧ.Номенклатура = ВТСоглашение.Номенклатура
		|		И ВТТЧ.Характеристика = ВТСоглашение.Характеристика
		|		И ВТТЧ.ДатаОтгрузки МЕЖДУ ВТСоглашение.ДатаНачала И ВТСоглашение.ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДвижения.Номенклатура КАК Номенклатура,
		|	ВТДвижения.Характеристика КАК Характеристика,
		|	ВТДвижения.Количество КАК Количество,
		|	ВТДвижения.Упаковка КАК Упаковка,
		|	ВТДвижения.ДатаНачала КАК ДатаНачала,
		|	ВТДвижения.ДатаОтгрузки КАК ДатаОтгрузки
		|ИЗ
		|	ВТДвижения КАК ВТДвижения";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СсылкаСоглашение", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	МаксимальнаяДата = Дата(1,1,1);
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ДатаОтгрузки > МаксимальнаяДата Тогда
				МаксимальнаяДата = ВыборкаДетальныеЗаписи.ДатаОтгрузки;
			КонецЕсли;
			
			
			Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.ДобавитьРасход();
			Движение.Период = ВыборкаДетальныеЗаписи.ДатаОтгрузки;
			Движение.Соглашение = Соглашение;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			Коэффициент = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ВыборкаДетальныеЗаписи.Упаковка, ВыборкаДетальныеЗаписи.Номенклатура);
			КоличествоВЭлементарныхЕдиницах = ВыборкаДетальныеЗаписи.Количество * Коэффициент;
			Движение.Количество = КоличествоВЭлементарныхЕдиницах;
			Движение.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записать();
	
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	-cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.Остатки(&МоментВремени, Соглашение = &Соглашение
	|	И (Номенклатура, Характеристика, ДатаНачала) В
	|		(ВЫБРАТЬ
	|			ВТТЧ.Номенклатура,
	|			ВТТЧ.Характеристика,
	|			ВТТЧ.ДатаНачала
	|		ИЗ
	|			ВТДвижения КАК ВТТЧ)) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстатки
	|ГДЕ
	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("МоментВремени", МаксимальнаяДата + 1);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()  Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"" на количество ""%3""'"),
			Выборка.НоменклатураПредставление, Выборка.ХарактеристикаПредставление, Выборка.КоличествоОстаток));
			
			Если Не (РольДоступна("cbr_ЗаписьЗаказаКлиентаСОтрицательнымиОстатками") или РольДоступна("ПолныеПрава")) Тогда
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	

	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	///////////////////////////////////////////////////////////////////////////////////
//	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
//	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записать();
//	
//	МассивДат = Товары.ВыгрузитьКолонку("ДатаОтгрузки");
//	
//	МинимумМассива = Минимум(МассивДат);
//	МаксимумМассива = Максимум(МассивДат);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
//		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
//		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	ЗаказКлиентаТовары.Количество КАК Количество
//		|ПОМЕСТИТЬ ВТТЧ
//		|ИЗ
//		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		|ГДЕ
//		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТТЧ.Номенклатура КАК Номенклатура,
//		|	ВТТЧ.Характеристика КАК Характеристика,
//		|	ВТТЧ.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	ВТТЧ.Количество КАК Количество,
//		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
//		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
//		|ПОМЕСТИТЬ ВТНоменклатураИзСоглашения
//		|ИЗ
//		|	ВТТЧ КАК ВТТЧ
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
//		|		ПО ВТТЧ.Номенклатура = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура
//		|		И ВТТЧ.Характеристика = СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика
//		|		И ВТТЧ.ДатаОтгрузки
//		|			МЕЖДУ СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания
//		|ГДЕ
//		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Соглашение
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
//		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Период, &НачалоПериода) КАК Период,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоНачальныйОстаток, 0) КАК НачальныйОстаток,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоКонечныйОстаток, 0) КАК КонечныйОстаток,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоОборот, 0) КАК Оборот,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоПриход, 0) КАК Приход,
//		|	ЕСТЬNULL(cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.КоличествоРасход, 0) КАК Расход
//		|ПОМЕСТИТЬ ВТРегистр
//		|ИЗ
//		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.ОстаткиИОбороты(&НачалоПериода,
//		|			&КонецПериода, День, ДвиженияИГраницыПериода, Соглашение = &Соглашение
//		|		И (Номенклатура, Характеристика, ДатаНачала) В
//		|			(ВЫБРАТЬ
//		|				ВТНоменклатураИзСоглашения.Номенклатура,
//		|				ВТНоменклатураИзСоглашения.Характеристика,
//		|				ВТНоменклатураИзСоглашения.ДатаНачала
//		|			ИЗ
//		|				ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения)) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты
//		|		ПО ВТНоменклатураИзСоглашения.Номенклатура = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Номенклатура
//		|		И ВТНоменклатураИзСоглашения.Характеристика = cbr_ОстаткиНоменклатурыПоСоглашениюОстаткиИОбороты.Характеристика
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТНоменклатураИзСоглашения.Номенклатура КАК Номенклатура,
//		|	ВТНоменклатураИзСоглашения.Характеристика КАК Характеристика,
//		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	МАКСИМУМ(ВТРегистр.Период) КАК Период,
//		|	ВТНоменклатураИзСоглашения.Количество КАК Количество,
//		|	ВТНоменклатураИзСоглашения.ДатаНачала КАК ДатаНачала
//		|ПОМЕСТИТЬ ВТСоответсвиеДатыПериоду
//		|ИЗ
//		|	ВТНоменклатураИзСоглашения КАК ВТНоменклатураИзСоглашения
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
//		|		ПО ВТРегистр.Период <= ВТНоменклатураИзСоглашения.ДатаОтгрузки
//		|СГРУППИРОВАТЬ ПО
//		|	ВТНоменклатураИзСоглашения.Номенклатура,
//		|	ВТНоменклатураИзСоглашения.Характеристика,
//		|	ВТНоменклатураИзСоглашения.ДатаОтгрузки,
//		|	ВТНоменклатураИзСоглашения.Количество,
//		|	ВТНоменклатураИзСоглашения.ДатаНачала
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТСоответсвиеДатыПериоду.Номенклатура КАК Номенклатура,
//		|	ВТСоответсвиеДатыПериоду.Характеристика КАК Характеристика,
//		|	ВТСоответсвиеДатыПериоду.ДатаОтгрузки КАК ДатаОтгрузки,
//		|	ВЫБОР
//		|		КОГДА ВТСоответсвиеДатыПериоду.ДатаОтгрузки = ВТРегистр.Период
//		|			ТОГДА ВТРегистр.НачальныйОстаток
//		|		ИНАЧЕ ВТРегистр.КонечныйОстаток
//		|	КОНЕЦ КАК КоличествоОстаток,
//		|	ВТСоответсвиеДатыПериоду.Количество КАК Количество,
//		|	ВТСоответсвиеДатыПериоду.ДатаНачала КАК ДатаНачала
//		|ИЗ
//		|	ВТСоответсвиеДатыПериоду КАК ВТСоответсвиеДатыПериоду
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
//		|		ПО ВТСоответсвиеДатыПериоду.Номенклатура = ВТРегистр.Номенклатура
//		|		И ВТСоответсвиеДатыПериоду.Характеристика = ВТРегистр.Характеристика
//		|		И ВТРегистр.Период = ВТСоответсвиеДатыПериоду.Период";
//	
//	
//	
//	Запрос.УстановитьПараметр("НачалоПериода", МинимумМассива);
//	Запрос.УстановитьПараметр("Соглашение", Соглашение);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Запрос.УстановитьПараметр("КонецПериода", МаксимумМассива);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	ЕстьРоли = Ложь;
//	
//	Если (РольДоступна("cbr_ЗаписьЗаказаКлиентаСОтрицательнымиОстатками") или РольДоступна("ПолныеПрава")) Тогда
//		ЕстьРоли = Истина;
//	КонецЕсли;
//	
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		Превышение = ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток;
//		
//		Если Превышение > 0 Тогда
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"" на количество ""%3""'"),
//			ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Характеристика, Превышение));
//			Если Не ЕстьРоли Тогда
//				Отказ = Истина;
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.ДобавитьРасход();
//		Движение.Период = ВыборкаДетальныеЗаписи.ДатаОтгрузки;
//		Движение.Соглашение = Соглашение;
//		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
//		Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
//		Движение.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
//		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
//	КонецЦикла;
//	

	
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
#КонецЕсли