#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСоглашение
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|ГДЕ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &СсылкаСоглашение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика,
		|	ВТТЧ.Количество КАК Количество,
		|	ВТТЧ.Упаковка КАК Упаковка
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСоглашение КАК ВТСоглашение
		|		ПО ВТТЧ.Номенклатура = ВТСоглашение.Номенклатура
		|		И ВТТЧ.Характеристика = ВТСоглашение.Характеристика
		|		И ВТТЧ.ДатаОтгрузки МЕЖДУ ВТСоглашение.ДатаНачала И ВТСоглашение.ДатаОкончания";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Соглашение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Соглашение");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.ДобавитьРасход();
			Движение.Период = ТекущаяДатаСеанса();
			Движение.Соглашение = Соглашение;
			Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			Коэффициент = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ВыборкаДетальныеЗаписи.Упаковка, ВыборкаДетальныеЗаписи.Номенклатура);
			КоличествоВЭлементарныхЕдиницах = ВыборкаДетальныеЗаписи.Количество * Коэффициент;
			Движение.Количество = КоличествоВЭлементарныхЕдиницах;
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	-cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.Остатки(&МоментВремени, Соглашение = &Соглашение
	|	И (Номенклатура, Характеристика) В
	|		(ВЫБРАТЬ
	|			ВТТЧ.Номенклатура,
	|			ВТТЧ.Характеристика
	|		ИЗ
	|			ВТТЧ КАК ВТТЧ)) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстатки
	|ГДЕ
	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток < 0";
	
//	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Дата, ));
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
#КонецОбласти
#КонецЕсли