#Область ОбработчикиСобытий
&ИзменениеИКонтроль("ДанныеТаблицыТоварыДокумента")
Функция cbr_ДанныеТаблицыТоварыДокумента(Накладная) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки                    КАК НомерСтроки,
	|	Таблица.Номенклатура                   КАК Номенклатура,
	|	Таблица.Характеристика                 КАК Характеристика,
	|	Таблица.НоменклатураНабора             КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора           КАК ХарактеристикаНабора,
	|	Таблица.Упаковка                       КАК Упаковка,
	|	Таблица.КоличествоУпаковок             КАК КоличествоУпаковок,
	|	Таблица.Количество                     КАК Количество,
	|	Таблица.КодСтроки                      КАК КодСтроки,
	|	Таблица.СтатусУказанияСерий            КАК СтатусУказанияСерий,
	|	Таблица.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	|	Таблица.СтатусУказанияСерийПолучатель  КАК СтатусУказанияСерийПолучатель,
	|	ВЫБОР КОГДА Таблица.Ссылка.ПеремещениеПоЗаказам
	|		ТОГДА Таблица.ЗаказНаПеремещение
	|		ИНАЧЕ Таблица.Ссылка
	|	КОНЕЦ                                  КАК ЗаказНаПеремещение,
	|	Таблица.Сделка                         КАК Сделка,
	|	Таблица.Назначение                     КАК Назначение,
	|	Таблица.НазначениеОтправителя          КАК НазначениеОтправителя,
	|	Таблица.Серия                          КАК Серия,
	|	Таблица.АналитикаУчетаНоменклатуры     КАК АналитикаУчетаНоменклатуры,
	#Вставка
	//++АшаеваАН 13.02.26 СКЛ.3
	|	Таблица.cbr_ЗаказПоставщику КАК cbr_ЗаказПоставщику,
	|	Таблица.cbr_ПТУ КАК cbr_ПТУ,
	//--АшаеваАН 13.02.26 СКЛ.3
	#КонецВставки
	|	Таблица.ИдентификаторСтроки            КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Накладная";

	Запрос.УстановитьПараметр("Накладная", Накладная);

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции
#КонецОбласти
