#Область СлужебныйПрограммныйИнтерфейс

&ИзменениеИКонтроль("ТаблицаПотребностейПоЗаказамИОстатков")
Процедура cbr_ТаблицаПотребностейПоЗаказамИОстатков(Параметры, АдресРезультата) Экспорт

	ОптимизироватьЗапасыРаспределительногоЦентра = Константы.ОптимизироватьЗапасыРаспределительногоЦентра.Получить();

	Если Параметры.ТипОтбора = "ОтборПоЗначениям" Тогда

		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.Текст =
			"ВЫБРАТЬ
			|	&Номенклатура   КАК Номенклатура,
			|	&Характеристика КАК Характеристика,
			|	&Склад          КАК Склад,
			|	&ДатаОтгрузкиЗаказа      КАК ДатаОтгрузкиЗаказа,
			|	&СкладОтгрузкиЗаказа     КАК СкладОтгрузкиЗаказа,
			|	&ПодразделениеПолучатель КАК ПодразделениеПолучатель,
			|	ВЫРАЗИТЬ(&СпособОбеспечения КАК Справочник.СпособыОбеспеченияПотребностей) КАК СпособОбеспечения,
			|
			|	&Назначение     КАК Назначение,
			|	&Заказ          КАК Заказ,
			|	&ДатаОтгрузки   КАК ДатаОтгрузки,
			|	0 КАК НеОбеспечено,
			|	0 КАК РаспределеноНаСкладе,
			|	0 КАК РаспределеноИзЗаказов
			|ПОМЕСТИТЬ ВтТовары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Способы.СпособОбеспечения КАК СпособОбеспечения
			|ПОМЕСТИТЬ СпособыОбеспечения
			|ИЗ
			|	ВтТовары КАК Способы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                     КАК Склад,
			|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                     КАК Центр
			|ПОМЕСТИТЬ ТопологияСкладов
			|ГДЕ
			|	ЛОЖЬ
			|;
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)               КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)                     КАК Склад,
			|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)                 КАК Назначение
			|ПОМЕСТИТЬ ТоварыИСкладыПопавшиеВОбработку
			|ГДЕ
			|	ЛОЖЬ";

		Для Каждого Свойство Из Параметры.Отбор Цикл
			Запрос.УстановитьПараметр(Свойство.Ключ, Свойство.Значение);
		КонецЦикла;
		Запрос.Выполнить();

		ОбеспечениеВДокументахСервер.ВременнаяТаблицаБлижайшийЦиклПоСпособамОбеспечения(Запрос.МенеджерВременныхТаблиц);

	Иначе

		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();

		СхемаКомпоновкиДанных = Обработки.ОбеспечениеПотребностей.ПолучитьМакет("МакетКомпоновкиДляСерверныхОтборов");
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);

		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
		КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.Отбор);

		// Основной запрос
		Тексты = Новый Массив();
		Тексты.Добавить(ВременнаяТаблицаОтборПоСегментам());
		Тексты.Добавить(ВременнаяТаблицаОтборПоЗаказам());
		Тексты.Добавить(ВременнаяТаблицаПотребностиВсехСкладовПоЗаказам());
		Тексты.Добавить(
			"ВЫБРАТЬ
			|	Таблица.СпособОбеспечения КАК СпособОбеспечения
			|ПОМЕСТИТЬ СпособыОбеспеченияДляОтборов
			|ИЗ
			|	&ТаблицаСпособовОбеспечения КАК Таблица");
		Тексты.Добавить(ВременнаяТаблицаПотребностиВыбранныхСкладов());
		Тексты.Добавить(ВыборкаПервойЗаписиПотребностейПоЗаказамДляКомпоновкиЗапроса());
		Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());

		СхемаКомпоновкиДанных.НаборыДанных.Набор.Запрос = Текст;
		Запрос = ПолучитьЗапросСОтборамиКомпоновкиДанных(АдресСхемыКомпоновкиДанных, КомпоновщикНастроек, "Набор");
		УдалитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

		// Отделим часть запроса, которую необходимо выполнить привилегированно.
		ПозицияУдаления = СтрНайти(Запрос.Текст, "УНИЧТОЖИТЬ ВтФорматыСкладов");
		Позиция = СтрНайти(Запрос.Текст, ";", НаправлениеПоиска.СНачала, ПозицияУдаления) + 1;
		ТекстЗапросаПривилегированно = Сред(Запрос.Текст, Позиция);
		Запрос.Текст = Лев(Запрос.Текст, ПозицияУдаления - 1);
		Запрос.УстановитьПараметр("ОптимизироватьЗапасыРаспределительногоЦентра", ОптимизироватьЗапасыРаспределительногоЦентра);
		Запрос.УстановитьПараметр("ФОЗаказыНаПеремещенияВключена",
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение"));
		Запрос.УстановитьПараметр("ФОПроизводство2_2Включена",
			ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2"));
		Запрос.УстановитьПараметр("ТаблицаСпособовОбеспечения", Параметры.ТаблицаСпособовОбеспечения);
		//++ НЕ УТКА
		Запрос.УстановитьПараметр("ИспользуетсяГрафикПроизводства",
			УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства());
		//-- НЕ УТКА
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();

		// Для части запроса выполняемой в привилегированном режиме нужна временная таблица топологии складов.
		Запрос.Текст = ВременнаяТаблицаРазличнаяНоменклатура("ПотребностиВсехСкладовПоЗаказам");
		Запрос.Выполнить();
		РегистрыСведений.СхемыОбеспечения.ВременнаяТаблицаТопологияСкладов(Запрос, "РазличнаяНоменклатура");

		УстановитьПривилегированныйРежим(Истина);

		Запрос.Текст = ТекстЗапросаПривилегированно;
		Запрос.Выполнить();
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Таблица.СпособОбеспечения КАК Ссылка,
			|	Таблица.ДатаПоставки КАК ДатаПоставки,
			|	Таблица.ГраницаПериодаОбеспечения КАК ГраницаПериодаОбеспечения,
			|	Таблица.ФормироватьЗаказыПоРасписанию КАК ФормироватьЗаказыПоРасписанию,
			|	Таблица.ДатаПоставкиПоГрафику КАК ДатаПоставкиПоГрафику,
			|	Таблица.ГраницаПериодаОбеспеченияПоГрафику КАК ГраницаПериодаОбеспеченияПоГрафику,
			|	Таблица.ПлановаяДатаЗаказа КАК ПлановаяДатаЗаказа,
			|	Таблица.ДнейДоПлановогоЗаказа КАК ДнейДоПлановогоЗаказа,
			|	Таблица.ФормироватьЗаказыПоТочкеЗаказа КАК ФормироватьЗаказыПоТочкеЗаказа,
			|	Таблица.ДатаПоставкиПоТочкеЗаказа КАК ДатаПоставкиПоТочкеЗаказа,
			|	Таблица.ГраницаПериодаОбеспеченияПоТочкеЗаказа КАК ГраницаПериодаОбеспеченияПоТочкеЗаказа,
			|	Таблица.ГрафикПоставок КАК ГрафикПоставок,
			|	Таблица.ВариантОбеспечиваемогоПериода КАК ВариантОбеспечиваемогоПериода,
			|	Таблица.КЗаказуТовары КАК КЗаказуТовары
			|ПОМЕСТИТЬ БлижайшийЦиклПоСпособамОбеспечения
			|ИЗ
			|	&ТаблицаСпособовОбеспечения КАК Таблица
			|;
			|
			|///////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Товары.Номенклатура            КАК Номенклатура,
			|	Товары.Характеристика          КАК Характеристика,
			|	Товары.Склад                   КАК Склад,
			|	Товары.Назначение              КАК Назначение,
			|	Товары.ПодразделениеПолучатель КАК Подразделение
			|ПОМЕСТИТЬ ТоварыИСкладыПопавшиеВОбработку
			|ИЗ
			|	ВтТовары КАК Товары
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
		Запрос.Выполнить();

	КонецЕсли;

	НачалоДня = НачалоДня(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня);
	Тексты = Новый Массив();

	Текст =
		// Календари, где нужно искать дату заказа.
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.СпособОбеспечения,
		|	Товары.ДатаОтгрузки КАК ДатаОтгрузки
		|ПОМЕСТИТЬ СпособыИДатыОтгрузки
		|ИЗ
		|	ВтТовары КАК Товары
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БлижайшийЦиклПоСпособамОбеспечения КАК ТаблицаСпособовОбеспечения
		|		ПО ТаблицаСпособовОбеспечения.Ссылка = Товары.СпособОбеспечения
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВариантУпорядочиванияПотребностейПоЗаказамДляОбеспечения КАК УпорядочиваниеПоДатеДокумента
		|		ПО УпорядочиваниеПоДатеДокумента.Значение = ЗНАЧЕНИЕ(Перечисление.ВариантыУпорядочиванияПотребностейПоЗаказамДляОбеспечения.ПриоритетИДатаОтгрузки)
		|ГДЕ
		|	Товары.ДатаОтгрузки > ТаблицаСпособовОбеспечения.ДатаПоставки
		|		ИЛИ ТаблицаСпособовОбеспечения.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)";

	Тексты.Добавить(Текст);

	Текст =
		"ВЫБРАТЬ
		|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
		|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
		|	РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый.ПлановаяДатаПоставки КАК ДатаПоставки
		|ПОМЕСТИТЬ ДатыПоставок
		|ИЗ
		|	СпособыИДатыОтгрузки КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый ПО ИСТИНА
		|ИНДЕКСИРОВАТЬ ПО
		|	СпособОбеспечения";

	Подстановки = ОбеспечениеВДокументахСервер.ПодстановкиДатыПоставкиБлижайшейКДате(
		"Таблица.СпособОбеспечения",
		"Таблица.ДатаОтгрузки");

	Текст = СтрЗаменить(Текст, "РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый.ПлановаяДатаПоставки", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДатыПоставкиПоДатеОтгрузкиПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	Текст = ОбеспечениеВДокументахСервер.ВременнаяТаблицаГодыГрафикаПредприятия();
	Тексты.Добавить(Текст);

	// Если заказы формируются только по точке заказа, то дата поставки любой день,
	// значит дата поставки = дата отгрузки, но если отгрузка в выходной, то дата поставки первый рабочий день до даты отгрузки.
	Текст =
		"ВЫБРАТЬ
		|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
		|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВЫБОР
		|		КОГДА НЕ ВЫРАЗИТЬ(Таблица.СпособОбеспечения КАК Справочник.СпособыОбеспеченияПотребностей).ФормироватьЗаказыПоРасписанию
		|				И КалендарьПредприятияВременный.Значение <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
		|				И РасчетДобавленияДатыПереопределяемый.НайденнаяДата >= &НачалоТекущегоДня
		|			ТОГДА РасчетДобавленияДатыПереопределяемый.НайденнаяДата
		|		ИНАЧЕ Таблица.ДатаПоставки
		|	КОНЕЦ КАК ДатаПоставки,
		|	НЕ ВЫРАЗИТЬ(Таблица.СпособОбеспечения КАК Справочник.СпособыОбеспеченияПотребностей).ФормироватьЗаказыПоРасписанию
		|		И КалендарьПредприятияВременный.Значение <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
		|		И РасчетДобавленияДатыПереопределяемый.НайденнаяДата < &НачалоТекущегоДня
		|		И РасчетДобавленияДатыПереопределяемый.НайденнаяДата > ДАТАВРЕМЯ(1, 1, 1) КАК ПрибавитьОдинРабочийДень
		|ПОМЕСТИТЬ ДатыПоставокСУчетомРабочихДнейПервая
		|ИЗ
		|	ДатыПоставок КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ОсновнойКалендарьПредприятия КАК КалендарьПредприятияВременный
		|		ПО ИСТИНА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА
		|ИНДЕКСИРОВАТЬ ПО
		|	СпособОбеспечения";

	Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
		"Таблица.ДатаПоставки", "0", Истина);

	Текст = СтрЗаменить(Текст, "РасчетДобавленияДатыПереопределяемый.НайденнаяДата", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	Текст =
		"ВЫБРАТЬ
		|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
		|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВЫБОР
		|		КОГДА Таблица.ПрибавитьОдинРабочийДень
		|				И РасчетДобавленияДатыПереопределяемый.НайденнаяДата > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА РасчетДобавленияДатыПереопределяемый.НайденнаяДата
		|		ИНАЧЕ Таблица.ДатаПоставки
		|	КОНЕЦ КАК ДатаПоставки
		|ПОМЕСТИТЬ ДатыПоставокСУчетомРабочихДней
		|ИЗ
		|	ДатыПоставокСУчетомРабочихДнейПервая КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА
		|ИНДЕКСИРОВАТЬ ПО
		|	СпособОбеспечения";

	Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
		"Таблица.ДатаПоставки", "1", Истина);

	Текст = СтрЗаменить(Текст, "РасчетДобавленияДатыПереопределяемый.НайденнаяДата", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	Текст =
		"ВЫБРАТЬ
		|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
		|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
		|	Таблица.ДатаПоставки КАК ДатаПоставки,
		|	РасчетДобавленияДатыПереопределяемый.НайденнаяДата КАК ДатаЗаказа
		|ПОМЕСТИТЬ ДатыПоставокИДатыЗаказов
		|ИЗ
		|	ДатыПоставокСУчетомРабочихДней КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА
		|ИНДЕКСИРОВАТЬ ПО
		|	СпособОбеспечения, ДатаОтгрузки";

	Подстановки = ОбеспечениеВДокументахСервер.ДобавитьКДатеПоКалендарюПредприятия(
		"Таблица.ДатаПоставки", "-Таблица.СпособОбеспечения.СрокИсполненияЗаказа");

	Текст = СтрЗаменить(Текст, "РасчетДобавленияДатыПереопределяемый.НайденнаяДата", Подстановки.Поле);
	Текст = СтрЗаменить(Текст, "ЛЕВОЕ СОЕДИНЕНИЕ РасчетДобавленияДатыПереопределяемый ПО ИСТИНА", Подстановки.Соединения);
	Тексты.Добавить(Текст);

	Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Запрос.Выполнить();

	ТекстыЗапросов = Новый Массив();

	ТекстыЗапросов.Добавить(ВременнаяТаблицаДанныеЗаполненияЗаказаПоставщику());
	ТекстыЗапросов.Добавить(ВременнаяТаблицаЗапретЗакупкиПоАссортименту(
		ПолучитьФункциональнуюОпцию("ИспользоватьАссортимент")));
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад
		|ПОМЕСТИТЬ СкладыВходящиеВРаспределительныеСети
		|ИЗ
		|	ТопологияСкладов КАК Таблица
		|ГДЕ
		|	Таблица.Склад <> Таблица.Центр
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,Характеристика,Склад";

	ТекстыЗапросов.Добавить(Текст);

	Текст =
		"ВЫБРАТЬ
		|	Т.Номенклатура                                   КАК Номенклатура,
		|	Т.Характеристика                                 КАК Характеристика,
		|	Т.Склад                                          КАК Склад,
		|	НЕ СкладыВходящиеВРаспределительныеСети.Склад ЕСТЬ NULL КАК ОбеспечиваетсяИзРаспределительногоЦентра,
		|	Т.СкладОтгрузкиЗаказа                            КАК СкладОтгрузкиЗаказа,
		|	Т.ДатаОтгрузкиЗаказа                             КАК ДатаОтгрузкиЗаказа,
		|	Т.Номенклатура.Наименование                      КАК НоменклатураНаименование,
		|	Т.Характеристика.Наименование                    КАК ХарактеристикаНаименование,
		|	Т.Склад.Наименование                             КАК СкладНаименование,
		|	Т.Назначение.Наименование                        КАК НазначениеНаименование,
		|
		|	Т.ПодразделениеПолучатель                        КАК ПодразделениеПолучатель,
		|	Т.Назначение                                     КАК Назначение,
		|	Т.Заказ                                          КАК Заказ,
		|	ЗаказыРеестра.Приоритет                          КАК Приоритет,
		|	ЕСТЬNULL(ЗаказыРеестра.Приоритет.РеквизитДопУпорядочивания,
		|		0)                                           КАК ПриоритетРеквизитДопУпорядочивания,
		|	Т.ДатаОтгрузки                                   КАК ДатаОтгрузки,
		|	Т.НеОбеспечено + Т.РаспределеноНаСкладе + Т.РаспределеноИзЗаказов КАК Требуется,
		|	ВЫБОР
		|		КОГДА ТопологияСкладовЭтоЦентр.Склад ЕСТЬ NULL
		|			ТОГДА Т.РаспределеноНаСкладе + Т.РаспределеноИзЗаказов
		|		ИНАЧЕ Т.РаспределеноНаСкладе
		|	КОНЕЦ КАК КРезервированию,
		|
		|	ВЫБОР
		|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА Т.ДатаОтгрузки > &КонецТекущегоДня
		|			ТОГДА Т.ДатаОтгрузки
		//++ НЕ УТКА
		|		КОГДА &ПроверкаЭтапаСУчетомПравПереопределяемый
		|			ТОГДА &ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый
		//-- НЕ УТКА
		|		КОГДА ИСТИНА
		|			ТОГДА ЗаказыРеестра.ДатаДокументаИБ
		|	КОНЕЦ ПорядокСортировки,
		|	ВЫБОР
		|		КОГДА &ПроверкаЭтапаСУчетомПравПереопределяемый
		|			ТОГДА &ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый
		|		КОГДА ИСТИНА
		|			ТОГДА ЗаказыРеестра.ДатаДокументаИБ
		|	КОНЕЦ КАК ДатаДокументаИБ,
		|	ВЫБОР
		|		КОГДА Т.ДатаОтгрузки > &КонецТекущегоДня
		|			ТОГДА Т.ДатаОтгрузки
		//++ НЕ УТКА
		|		КОГДА &ПроверкаЭтапаСУчетомПравПереопределяемый
		|			ТОГДА &ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый
		//-- НЕ УТКА
		|		КОГДА ИСТИНА
		|			ТОГДА ЗаказыРеестра.ДатаДокументаИБ
		|	КОНЕЦ КАК ПорядокПоДатеОтгрузкиПослеДатыДокумента,
		|	ВЫБОР КОГДА Т.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		 И ТоварныеОграничения.МетодОбеспеченияПотребностей <> ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)
		|		 И ТоварныеОграничения.ОбеспечениеЗаказовПриПоддержанииЗапаса = ЗНАЧЕНИЕ(Перечисление.ОбеспечениеЗаказовПриПоддержанииЗапаса.НезависимоОтЗапасов) ТОГДА
		|				ИСТИНА
		|			ИНАЧЕ
		|				ЛОЖЬ
		|		КОНЕЦ КАК ОбеспечиватьНезависимоОтЗапасов,
		|
		// Параметры номенклатуры
		|	&ТекстЗапросаВесНоменклатуры                        КАК Вес,
		|	Т.Номенклатура.ЕдиницаИзмерения                     КАК ЕдиницаИзмерения,
		|	Т.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины КАК ТипЕдиницыИзмерения,
		|	Т.Номенклатура.Код                                  КАК Код,
		|	Т.Номенклатура.Артикул                              КАК Артикул,
		|	Т.Номенклатура.ИспользоватьУпаковки                 КАК ИспользоватьУпаковки,
		|
		|	ВЫБОР КОГДА Т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
		|				ИСТИНА
		|			ИНАЧЕ
		|				ЛОЖЬ
		|		КОНЕЦ КАК ЭтоРабота,
		|
		// Способ обеспечения
		|	ЕСТЬNULL(Т.СпособОбеспечения, ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)) КАК СпособОбеспечения,
		|	ЕСТЬNULL(Т.СпособОбеспечения.ТипОбеспечения,
		|		ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Покупка)) КАК ТипОбеспечения,
		|	ТаблицаСпособовОбеспечения.КЗаказуТовары КАК КЗаказуТовары,
		|	ВЫБОР
		|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
		|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
		|		КОГДА Т.ДатаОтгрузки <= ТаблицаСпособовОбеспечения.ДатаПоставки
		|				И ТаблицаСпособовОбеспечения.ДатаПоставки > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
		|		КОГДА НЕ ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
		|			И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
		|			И Т.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &НачалоТекущегоДня
		|		КОГДА ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < &НачалоТекущегоДня
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
		|				И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < ТаблицаСпособовОбеспечения.ДатаПоставки
		|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
		|		ИНАЧЕ ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки
		|	КОНЕЦ КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
		|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
		|		КОГДА Т.ДатаОтгрузки <= ТаблицаСпособовОбеспечения.ДатаПоставки
		|				И ТаблицаСпособовОбеспечения.ДатаПоставки > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
		|		КОГДА НЕ ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
		|			И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки = ДАТАВРЕМЯ(1, 1, 1)
		|			И Т.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &НачалоТекущегоДня
		|		КОГДА ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < &НачалоТекущегоДня
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА ТаблицаСпособовОбеспечения.ФормироватьЗаказыПоРасписанию
		|				И ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < ТаблицаСпособовОбеспечения.ДатаПоставки
		|			ТОГДА ТаблицаСпособовОбеспечения.ДатаПоставки
		|		ИНАЧЕ ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки
		|	КОНЕЦ КАК ДатаПоставкиРасчетная,
		|	ТаблицаСпособовОбеспечения.ДатаПоставки КАК ДатаПоставкиПоСпособуОбеспечения,
		|	ВЫБОР
		|		КОГДА НЕ УпорядочиваниеПоДатеДокумента.Значение ЕСТЬ NULL
		|				ИЛИ Т.ДатаОтгрузки <= ТаблицаСпособовОбеспечения.ДатаПоставки
		|					И ТаблицаСпособовОбеспечения.ДатаПоставки > ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ТаблицаДатПоставкиИДатыЗаказа.ДатаПоставки < &НачалоТекущегоДня
		|				ИЛИ ТаблицаДатПоставкиИДатыЗаказа.ДатаЗаказа < &НачалоТекущегоДня
		|			ТОГДА &НачалоТекущегоДня
		|		ИНАЧЕ ТаблицаДатПоставкиИДатыЗаказа.ДатаЗаказа
		|	КОНЕЦ КАК ДатаЗаказаНеПозднее,
		|
		|	ЕСТЬNULL(&ФОЗаказыНаПеремещенияВключена И НЕ Т.Склад.ЦеховаяКладовая
		|		ИЛИ &ФОПроизводство2_2Включена И Т.Склад.ЦеховаяКладовая, ЛОЖЬ) КАК ПеремещениеРазрешено,
		|
		// Условия закупок
		|	ЕСТЬNULL(ДанныеЗаполнения.ВидЦеныПоставщика,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(Т.СпособОбеспечения.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
		|					<> ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка)
		|				ТОГДА Т.СпособОбеспечения.ВидЦеныПоставщика
		|			ИНАЧЕ ЕСТЬNULL(Т.СпособОбеспечения.Соглашение.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
		|		КОНЕЦ) КАК ВидЦены,
		|	ЕСТЬNULL(ДанныеЗаполнения.Валюта, Т.СпособОбеспечения.Соглашение.Валюта)            КАК ВалютаСоглашения,
		|
		|	ВЫБОР КОГДА НЕ ЕСТЬNULL(ДанныеЗаполнения.Соглашение.ЦенаВключаетНДС, Т.СпособОбеспечения.Соглашение.ЦенаВключаетНДС) ТОГДА
		|		(ВЫБОР
		|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
		|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
		|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
		|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
		|			ИНАЧЕ 0
		|		КОНЕЦ + 100) / 100
		|			ИНАЧЕ
		|				1
		|		КОНЕЦ
		|	* ЦеныПоставщиков.Цена
		|		* ВЫБОР
		|			КОГДА КурсВалютаСоглашения.Коэффициент =0
		|				ТОГДА 0
		|			ИНАЧЕ КурсыВалют.Коэффициент / КурсВалютаСоглашения.Коэффициент
		|		КОНЕЦ
		|	/ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)                                          КАК ЦенаВВалютеСоглашения,
		|
		|	ВЫБОР КОГДА НЕ ЕСТЬNULL(ДанныеЗаполнения.Соглашение.ЦенаВключаетНДС, Т.СпособОбеспечения.Соглашение.ЦенаВключаетНДС) ТОГДА
		|		(ВЫБОР
		|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
		|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатурыСтраныРегистрации.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДССтраныРегистрации.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
		|			КОГДА НЕ (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка ЕСТЬ NULL
		|				ТОГДА (ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС, ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)))).Ставка
		|			ИНАЧЕ 0
		|		КОНЕЦ + 100) / 100
		|			ИНАЧЕ
		|				1
		|		КОНЕЦ
		|	* ЦеныПоставщиков.Цена * КурсыВалют.Коэффициент / &КоэффициентВалютыУпрУчета
		|	/ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)                                КАК ЦенаВВалютеУправленческогоУчета,
		|
		|	ВЫБОР КОГДА Т.СпособОбеспечения.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.СборкаРазборка) ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ВЫБОР ЕСТЬNULL(Т.СпособОбеспечения.ИсточникОбеспеченияПотребностей, НЕОПРЕДЕЛЕНО)
		|					КОГДА НЕОПРЕДЕЛЕНО ТОГДА
		|						ЛОЖЬ
		|					КОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ТОГДА
		|						ЛОЖЬ
		|					КОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) ТОГДА
		|						ЛОЖЬ
		|					КОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) ТОГДА
		|						ЛОЖЬ
		|					ИНАЧЕ
		|						ИСТИНА //источник обеспечения устанавливается в способе обеспечения потребностей
		|				КОНЕЦ
		|		КОНЕЦ                                                                      КАК ИсточникОбеспеченияТолькоПросмотр,
		|	ЕСТЬNULL(ДанныеЗаполнения.Партнер,
		|		Т.СпособОбеспечения.ИсточникОбеспеченияПотребностей)        КАК ИсточникОбеспечения,
		|	ВЫБОР КОГДА Т.СпособОбеспечения.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка) ТОГДА
		|				Т.СпособОбеспечения.Соглашение
		|			ИНАЧЕ
		|				ДанныеЗаполнения.Соглашение
		|		КОНЕЦ                                                       КАК Соглашение,
		|	СпрУпаковки.Ссылка                                              КАК УпаковкаЗаказа,
		|	ЕСТЬNULL(СпрУпаковки.Числитель, 1)                              КАК ЧислительУпаковки,
		|	ЕСТЬNULL(СпрУпаковки.Знаменатель, 1)                            КАК ЗнаменательУпаковки,
		|	ЦеныПоставщиков.УпаковкаЗаказаПоставщика КАК УпаковкаЗаказаПоставщика,
		|	ЦеныПоставщиков.МинимальнаяПартияПоставки КАК МинимальнаяПартияПоставки,
		|	ВЫБОР КОГДА Т.СпособОбеспечения.Соглашение <> ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка) ТОГДА
		|				ЕСТЬNULL(Т.СпособОбеспечения.Соглашение.МинимальнаяСуммаЗаказа,0)
		|			ИНАЧЕ
		|				ЕСТЬNULL(ДанныеЗаполнения.Соглашение.МинимальнаяСуммаЗаказа,0)
		|		КОНЕЦ                                                       КАК МинимальнаяСуммаЗаказа
		|ИЗ
		|	ВтТовары КАК Т
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БлижайшийЦиклПоСпособамОбеспечения КАК ТаблицаСпособовОбеспечения
		|		ПО Т.СпособОбеспечения = ТаблицаСпособовОбеспечения.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоставокИДатыЗаказов КАК ТаблицаДатПоставкиИДатыЗаказа
		|		ПО ТаблицаДатПоставкиИДатыЗаказа.СпособОбеспечения = Т.СпособОбеспечения
		|		 И ТаблицаДатПоставкиИДатыЗаказа.ДатаОтгрузки = Т.ДатаОтгрузки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыВходящиеВРаспределительныеСети КАК СкладыВходящиеВРаспределительныеСети
		|		ПО СкладыВходящиеВРаспределительныеСети.Номенклатура = Т.Номенклатура
		|		 И СкладыВходящиеВРаспределительныеСети.Характеристика = Т.Характеристика
		|		 И СкладыВходящиеВРаспределительныеСети.Склад = Т.Склад
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТопологияСкладов КАК ТопологияСкладовЭтоЦентр
		|		ПО ТопологияСкладовЭтоЦентр.Номенклатура   = Т.Номенклатура
		|		 И ТопологияСкладовЭтоЦентр.Характеристика = Т.Характеристика
		|		 И ТопологияСкладовЭтоЦентр.Склад = Т.Склад
		|		 И ТопологияСкладовЭтоЦентр.Центр = Т.Склад
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтДанныеЗаполненияЗаказаПоставщику КАК ДанныеЗаполнения
		|		ПО Т.Номенклатура    = ДанныеЗаполнения.Номенклатура
		|		 И Т.Характеристика  = ДанныеЗаполнения.Характеристика
		|		 И Т.Склад           = ДанныеЗаполнения.Склад
		|		 И ЕСТЬNULL(Т.СпособОбеспечения.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Покупка), ИСТИНА)
		|		 И Т.СпособОбеспечения.ИсточникОбеспеченияПотребностей.Ссылка ЕСТЬ NULL
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныПоставщиков КАК ЦеныПоставщиков
		|		ПО Т.Номенклатура       = ЦеныПоставщиков.Номенклатура
		|			И Т.Характеристика  = ЦеныПоставщиков.Характеристика
		|			И ЕСТЬNULL(ДанныеЗаполнения.ВидЦеныПоставщика,
		|				ВЫБОР
		|					КОГДА ЕСТЬNULL(Т.СпособОбеспечения.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
		|							<> ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка)
		|						ТОГДА Т.СпособОбеспечения.ВидЦеныПоставщика
		|					ИНАЧЕ ЕСТЬNULL(Т.СпособОбеспечения.Соглашение.ВидЦеныПоставщика, ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка))
		|				КОНЕЦ) = ЦеныПоставщиков.ВидЦеныПоставщика
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
		|		ПО ЦеныПоставщиков.Валюта = КурсыВалют.Валюта
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсВалютаСоглашения
		|		ПО ЕСТЬNULL(ДанныеЗаполнения.Валюта, Т.СпособОбеспечения.Соглашение.Валюта) = КурсВалютаСоглашения.Валюта
		|
		//++ НЕ УТКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ДокументЭтап
		|		ПО ДокументЭтап.Ссылка = Т.Заказ
		//-- НЕ УТКА
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|		ПО &ПодстановкаТоварногоОграничения
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК УпаковкиЗаказа
		|		ПО &ПодстановкаУпаковкиЗаказа
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
		|		ПО УпаковкиЗаказа.УпаковкаЗаказа = СпрУпаковки.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК ЗаказыРеестра
		|		ПО ЗаказыРеестра.Ссылка = Т.Заказ
		|		 И НЕ ЗаказыРеестра.ДополнительнаяЗапись
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ВариантУпорядочиванияПотребностейПоЗаказамДляОбеспечения КАК УпорядочиваниеПоДатеДокумента
		|		ПО УпорядочиваниеПоДатеДокумента.Значение = ЗНАЧЕНИЕ(Перечисление.ВариантыУпорядочиванияПотребностейПоЗаказамДляОбеспечения.ПриоритетИДатаДокумента)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапретЗакупкиПоАссортименту КАК ЗапретЗакупкиПоАссортименту
		|		ПО ЗапретЗакупкиПоАссортименту.Склад = Т.Склад
		|		 И ЗапретЗакупкиПоАссортименту.Номенклатура = Т.Номенклатура
		|		 И ЗапретЗакупкиПоАссортименту.ДатаВозможнойПоставки = ЕСТЬNULL(ТаблицаСпособовОбеспечения.ДатаПоставки, &НачалоТекущегоДня)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&НачалоТекущегоДня) КАК СтавкиНДСНоменклатурыСтраныРегистрации
		|		ПО Т.Номенклатура = СтавкиНДСНоменклатурыСтраныРегистрации.Номенклатура
		|		 И Т.СпособОбеспечения.Организация.СтранаРегистрации = СтавкиНДСНоменклатурыСтраныРегистрации.Страна
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&НачалоТекущегоДня) КАК ОсновныеСтавкиНДССтраныРегистрации
		|		ПО Т.СпособОбеспечения.Организация.СтранаРегистрации = ОсновныеСтавкиНДССтраныРегистрации.Страна
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&НачалоТекущегоДня, Страна = &ОсновнаяСтрана ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
		|		ПО Т.Номенклатура = СтавкиНДСНоменклатуры.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&НачалоТекущегоДня, Страна = &ОсновнаяСтрана) КАК ОсновныеСтавкиНДС
		|		ПО (ИСТИНА)
		//++ НЕ УТКА
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводствоДляСортировки
		|		ПО ЗаказНаПроизводствоДляСортировки.Ссылка = Т.Заказ
		//-- НЕ УТКА
		|
		|ГДЕ
		|	ВЫБОР
		|		КОГДА Т.СпособОбеспечения.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
		|			ТОГДА
		|				ЕСТЬNULL(&ФОЗаказыНаПеремещенияВключена И НЕ Т.Склад.ЦеховаяКладовая
		|							ИЛИ &ФОПроизводство2_2Включена И Т.Склад.ЦеховаяКладовая, ЛОЖЬ)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|		И ЗапретЗакупкиПоАссортименту.Склад ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураНаименование,
		|	ХарактеристикаНаименование,
		|	СкладНаименование,
		|	НазначениеНаименование,
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Назначение,
		|	ПриоритетРеквизитДопУпорядочивания,
		//++ НЕ УТКА
		|	ВЫБОР КОГДА НЕ ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЗаказНаПроизводство2_2) ТОГДА
		|		0
		|	ИНАЧЕ
		|		1
		|	КОНЕЦ,
		|	ВЫБОР КОГДА НЕ ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЗаказНаПроизводство2_2) ТОГДА
		|		0
		|	ИНАЧЕ
		|		ЗаказНаПроизводствоДляСортировки.Подразделение.РеквизитДопУпорядочивания
		|	КОНЕЦ,
		|	ВЫБОР КОГДА НЕ ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЗаказНаПроизводство2_2) ТОГДА
		|		0
		|	ИНАЧЕ
		|		ЗаказНаПроизводствоДляСортировки.Очередь
		|	КОНЕЦ,
		//-- НЕ УТКА
		|	ПорядокСортировки,
		|	ДатаДокументаИБ,
		|	ПорядокПоДатеОтгрузкиПослеДатыДокумента,
		|	Заказ";

	Текст = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединение(Текст,
		"ПодстановкаТоварногоОграничения");
	Текст = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединениеДляУпаковкиЗаказа(Текст,
		"ПодстановкаУпаковкиЗаказа");
	Текст = СтрЗаменить(Текст, "&ТекстЗапросаВесНоменклатуры",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
			"Т.Номенклатура.ЕдиницаИзмерения",
			"Т.Номенклатура"));

	Текст = СтрЗаменить(Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныПоставщиков.Упаковка",
			"ЦеныПоставщиков.Номенклатура"));

	ПроверкаЭтапаТекст = "ЛОЖЬ";
	ДатаЗаказаНаПроизводствоТекст = "ДАТАВРЕМЯ(1, 1, 1)";
	//++ НЕ УТКА
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЭтапПроизводства2_2)
			И ПравоДоступа("Чтение", Метаданные.Документы.ЗаказНаПроизводство2_2)
			И Не Параметры.ТипОтбора = "ОтборПоЗначениям" Тогда

				ПроверкаЭтапаТекст = "ТИПЗНАЧЕНИЯ(Т.Заказ) = ТИП(Документ.ЭтапПроизводства2_2)";
				ДатаЗаказаНаПроизводствоТекст = "ВЫРАЗИТЬ(Т.Заказ КАК Документ.ЭтапПроизводства2_2).Распоряжение.Дата";

	КонецЕсли;
	//-- НЕ УТКА
	Текст = СтрЗаменить(Текст, "&ПроверкаЭтапаСУчетомПравПереопределяемый", ПроверкаЭтапаТекст);
	Текст = СтрЗаменить(Текст, "&ДатаЗаказаНаПроизводствоСУчетомПравПереопределяемый", ДатаЗаказаНаПроизводствоТекст);

	ТекстыЗапросов.Добавить(Текст);
	#Вставка
	//++ШмелевР 22.01.2026 ЗКП.19
	ТекстыЗапросов[ТекстыЗапросов.Количество() - 1] = СтрЗаменить(ТекстыЗапросов[ТекстыЗапросов.Количество() - 1], 
		"Т.Номенклатура                                   КАК Номенклатура,",
		"Т.Номенклатура                                   КАК Номенклатура, 
		|ЕСТЬNULL(ПоддерживаемостьОстатков.НеПоддерживаютсяОстатки, ЛОЖЬ) КАК cbr_НеПоддерживаетсяОстаток,");
		
	ТекстыЗапросов[ТекстыЗапросов.Количество() - 1] = СтрЗаменить(ТекстыЗапросов[ТекстыЗапросов.Количество() - 1], 
		"ПО ЗаказНаПроизводствоДляСортировки.Ссылка = Т.Заказ",
		"ПО (ЗаказНаПроизводствоДляСортировки.Ссылка = Т.Заказ)
		|ЛЕВОЕ СОЕДИНЕНИЕ ПоддерживаемостьОстатков КАК ПоддерживаемостьОстатков
		|	ПО (Т.Номенклатура = ПоддерживаемостьОстатков.Номенклатура)");
		
	ДопТекстЗапросаПоддержаниеОстатка = "ВЫБРАТЬ
	|	ТоварныеОграничения.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(НЕ ТоварныеОграничения.МетодОбеспеченияПотребностей = ЗНАЧЕНИЕ(Перечисление.МетодыОбеспеченияПотребностей.ЗаказПодЗаказ)) КАК НеПоддерживаютсяОстатки
	|ПОМЕСТИТЬ ПоддерживаемостьОстатков
	|ИЗ
	|	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТовары КАК Т
	|		ПО (ТоварныеОграничения.Номенклатура = Т.Номенклатура)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Т.СпособОбеспечения.ТипОбеспечения = ЗНАЧЕНИЕ(Перечисление.ТипыОбеспечения.Перемещение)
	|				ТОГДА ЕСТЬNULL(&ФОЗаказыНаПеремещенияВключена
	|								И НЕ Т.Склад.ЦеховаяКладовая
	|							ИЛИ &ФОПроизводство2_2Включена
	|								И Т.Склад.ЦеховаяКладовая, ЛОЖЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварныеОграничения.Номенклатура";

	ТекстыЗапросов.Вставить(ТекстыЗапросов.Количество() - 1, ДопТекстЗапросаПоддержаниеОстатка);
	
	//--ШмелевР 22.01.2026 ЗКП.19
	#КонецВставки
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня);
	Запрос.УстановитьПараметр("ОсновнаяСтрана", ЗначениеНастроекКлиентСерверПовтИсп.ОсновнаяСтрана());
	Запрос.УстановитьПараметр("КонецТекущегоДня", КонецДня(ТекущаяДатаСеанса()));

	КурсВалютыУпрУчета = РаботаСКурсамиВалютУТ.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), НачалоДня);
	КоэффициентВалютыУпрУчета = КурсВалютыУпрУчета.КурсЧислитель / КурсВалютыУпрУчета.КурсЗнаменатель;
	Запрос.УстановитьПараметр("КоэффициентВалютыУпрУчета", КоэффициентВалютыУпрУчета);
	Запрос.УстановитьПараметр("ФОЗаказыНаПеремещенияВключена",
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение"));
	Запрос.УстановитьПараметр("ФОПроизводство2_2Включена",
		ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2"));

	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();

	Если Параметры.ТипОтбора = "ОтборПоЗначениям" Тогда
		Таблица.Колонки.Удалить("ОбеспечиваетсяИзРаспределительногоЦентра");
	КонецЕсли;

	Если Параметры.ТипОтбора <> "ОтборПоЗначениям" Тогда

		Поля = "Номенклатура,Характеристика,Склад,КЗаказу";
		#Область УХ_Внедрение
		Поля = Поля + ", АналитикаИсточника, АналитикаПланирования";
		#КонецОбласти
		ТаблицаЗапасы = Параметры.ТаблицаЗапасы.Скопировать(Новый Структура("Отметка", Истина), Поля);
		Запрос.УстановитьПараметр("ТаблицаЗапасы", ТаблицаЗапасы);

		ТекстыЗапросов = Новый Массив();

		Текст =
			"ВЫБРАТЬ
			|	Запасы.Номенклатура   КАК Номенклатура,
			|	Запасы.Характеристика КАК Характеристика,
			|	Запасы.Склад          КАК Склад,
			|	Запасы.КЗаказу        КАК КЗаказу
			|ПОМЕСТИТЬ ВтЗапасы
			|ИЗ
			|	&ТаблицаЗапасы КАК Запасы
			|ГДЕ
			|	Запасы.КЗаказу > 0";

		#Область УХ_Внедрение
		Текст =
			"ВЫБРАТЬ
			|	Запасы.Номенклатура   КАК Номенклатура,
			|	Запасы.Характеристика КАК Характеристика,
			|	Запасы.Склад          КАК Склад,
			|	Запасы.КЗаказу        КАК КЗаказу,
			|	Запасы.АналитикаИсточника		КАК АналитикаИсточника,
			|	Запасы.АналитикаПланирования	КАК АналитикаПланирования
			|ПОМЕСТИТЬ ВтЗапасы
			|ИЗ
			|	&ТаблицаЗапасы КАК Запасы
			|ГДЕ
			|	Запасы.КЗаказу > 0";
		#КонецОбласти

		ТекстыЗапросов.Добавить(Текст);

		ТекстыЗапросов.Добавить(РегистрыСведений.СхемыОбеспечения.ВременнаяТаблицаРазличныеТоварыИСклады("ТоварыИСкладыПопавшиеВОбработку", Истина));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаКОбеспечениюВсехСкладов(Истина));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаСвободныеОстатки(Истина));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаЗаказыКПоступлениюИОтгрузке(Истина));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаЗаказыНаПеремещениеВнутриСети(Истина));

//++ НЕ УТКА
		ТекстыЗапросов.Добавить(ВременнаяТаблицаГрафикПроизводства("ТоварыИСкладыПопавшиеВОбработку"));
		ТекстыЗапросов.Добавить(ВременнаяТаблицаПолуфабрикатыКЗапускуВПроизводство("ТоварыИСкладыПопавшиеВОбработку"));
//-- НЕ УТКА

		ТекстЗапроса =
			"ВЫБРАТЬ
			|	Остатки.Номенклатура КАК Номенклатура,
			|	Остатки.Характеристика КАК Характеристика,
			|	Остатки.Склад КАК Склад,
			|	Остатки.Назначение КАК Назначение,
			|	ВЫБОР
			|		КОГДА Остатки.ВНаличииОстаток
			|				+ Остатки.ЗаказаноОстаток
			|				- Остатки.РезервироватьНаСкладеОстаток
			|				- Остатки.РезервироватьПоМереПоступленияОстаток > 0
			|			ТОГДА
			|				Остатки.ВНаличииОстаток
			|				+ Остатки.ЗаказаноОстаток
			|				- Остатки.РезервироватьНаСкладеОстаток
			|				- Остатки.РезервироватьПоМереПоступленияОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Свободно
			|ПОМЕСТИТЬ ТаблицаОстатковРабот
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
			|		(Номенклатура, Характеристика, Склад, Назначение) В(
			|			ВЫБРАТЬ
			|				Работы.Номенклатура КАК Номенклатура,
			|				Работы.Характеристика КАК Характеристика,
			|				Работы.Склад КАК Склад,
			|				Работы.Назначение КАК Назначение
			|		ИЗ
			|			ВтТовары КАК Работы
			|		ГДЕ
			|			Работы.Склад ССЫЛКА Справочник.СтруктураПредприятия)) КАК Остатки
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура, Характеристика, Склад, Назначение";
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		Текст =
			"ВЫБРАТЬ
			|	Товары.Номенклатура                                    КАК Номенклатура,
			|	Товары.Характеристика                                  КАК Характеристика,
			|	Товары.Склад                                           КАК Склад,
			|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеПолучатель,
			|	Товары.Назначение                                      КАК Назначение,
			|
			|	ВЫБОР
			|		КОГДА Товары.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|				ИЛИ НастройкаПоддержанияЗапаса.ОбеспечениеЗаказовПриПоддержанииЗапаса ЕСТЬ NULL
			|				ИЛИ НастройкаПоддержанияЗапаса.ОбеспечениеЗаказовПриПоддержанииЗапаса
			|					= ЗНАЧЕНИЕ(Перечисление.ОбеспечениеЗаказовПриПоддержанииЗапаса.ЗаСчетЗапасов)
			|			ТОГДА ЕСТЬNULL(Запасы.КЗаказу, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ
			|		+ ЕСТЬNULL(Остатки.ВНаличии, 0)
			|			+ ЕСТЬNULL(Заказы.Поступит, 0)
			|			- ЕСТЬNULL(Остатки.ВРезерве, 0)
//++ НЕ УТКА
			|					+ ЕСТЬNULL(ГрафикПроизводства.Количество, 0)
			|			+ ЕСТЬNULL(ОборотыПолуфабрикатов.Количество, 0)
//-- НЕ УТКА
			|			+ ЕСТЬNULL(ЗаказыНаПеремещениеВнутриСети.РезервМинусЗапас, 0) КАК КРезервированию
			|ИЗ
			|	ТоварыИСкладыПопавшиеВОбработку КАК Товары
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстатки КАК Остатки
			|		ПО Остатки.Номенклатура   = Товары.Номенклатура
			|		 И Остатки.Характеристика = Товары.Характеристика
			|		 И Остатки.Склад          = Товары.Склад
			|		 И Остатки.Назначение     = Товары.Назначение
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗаказы КАК Заказы
			|		ПО Заказы.Номенклатура   = Товары.Номенклатура
			|		 И Заказы.Характеристика = Товары.Характеристика
			|		 И Заказы.Склад          = Товары.Склад
			|		 И Заказы.Назначение     = Товары.Назначение
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыНаПеремещениеВнутриСети КАК ЗаказыНаПеремещениеВнутриСети
			|		ПО ЗаказыНаПеремещениеВнутриСети.Номенклатура = Товары.Номенклатура
			|		 И ЗаказыНаПеремещениеВнутриСети.Характеристика = Товары.Характеристика
			|		 И ЗаказыНаПеремещениеВнутриСети.Склад = Товары.Склад
			|		 И ЗаказыНаПеремещениеВнутриСети.Назначение = Товары.Назначение
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗапасы КАК Запасы
			|		ПО Запасы.Номенклатура = Товары.Номенклатура
			|		 И Запасы.Характеристика = Товары.Характеристика
			|		 И Запасы.Склад          = Товары.Склад
			|		 И Товары.Назначение     = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|
//++ НЕ УТКА
			|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикПроизводства КАК ГрафикПроизводства
			|		ПО ГрафикПроизводства.Номенклатура   = Товары.Номенклатура
			|		 И ГрафикПроизводства.Характеристика = Товары.Характеристика
			|		 И ГрафикПроизводства.Склад          = Товары.Склад
			|		 И ГрафикПроизводства.Назначение     = Товары.Назначение
			|		 И ГрафикПроизводства.ЭтоТовар
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПолуфабрикатов КАК ОборотыПолуфабрикатов
			|		ПО ОборотыПолуфабрикатов.Номенклатура   = Товары.Номенклатура
			|		 И ОборотыПолуфабрикатов.Характеристика = Товары.Характеристика
			|		 И ОборотыПолуфабрикатов.Склад          = Товары.Склад
			|		 И ОборотыПолуфабрикатов.Назначение     = Товары.Назначение
			|		 И ОборотыПолуфабрикатов.ЭтоТовар
//-- НЕ УТКА
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаПоддержанияЗапаса
			|		ПО &ПодстановкаТоварногоОграничения
			|ГДЕ
			|	Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Работы.Номенклатура                      КАК Номенклатура,
			|	Работы.Характеристика                    КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Склад,
			|	Работы.ПодразделениеПолучатель           КАК ПодразделениеПолучатель,
			|	Работы.Назначение                        КАК Назначение,
//++ НЕ УТКА
			|	ЕСТЬNULL(ГрафикПроизводства.Количество, 0)
			|	+ ЕСТЬNULL(ОборотыПолуфабрикатов.Количество, 0) +
//-- НЕ УТКА
			|	ЕСТЬNULL(Остатки.Свободно, 0) КАК КРезервированию
			|ИЗ
			|	ВтТовары КАК Работы
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковРабот КАК Остатки
			|		ПО Остатки.Номенклатура   = Работы.Номенклатура
			|		 И Остатки.Характеристика = Работы.Характеристика
			|		 И Остатки.Склад          = Работы.ПодразделениеПолучатель
			|		 И Остатки.Назначение     = Работы.Назначение
//++ НЕ УТКА
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикПроизводства КАК ГрафикПроизводства
			|		ПО ГрафикПроизводства.Номенклатура   = Работы.Номенклатура
			|		 И ГрафикПроизводства.Характеристика = Работы.Характеристика
			|		 И ГрафикПроизводства.Подразделение  = Работы.ПодразделениеПолучатель
			|		 И ГрафикПроизводства.Назначение     = Работы.Назначение
			|		 И НЕ ГрафикПроизводства.ЭтоТовар
			|
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПолуфабрикатов КАК ОборотыПолуфабрикатов
			|		ПО ОборотыПолуфабрикатов.Номенклатура   = Работы.Номенклатура
			|		 И ОборотыПолуфабрикатов.Характеристика = Работы.Характеристика
			|		 И ОборотыПолуфабрикатов.Подразделение  = Работы.ПодразделениеПолучатель
			|		 И ОборотыПолуфабрикатов.Назначение     = Работы.Назначение
			|		 И НЕ ОборотыПолуфабрикатов.ЭтоТовар
//-- НЕ УТКА
			|ГДЕ
			|	Работы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)";
		#Область УХ_Внедрение
		Текст = СтрЗаменить(Текст,
							"Товары.Назначение                                      КАК Назначение,",
							"Товары.Назначение                                      КАК Назначение,
							|	ISNULL(Запасы.АналитикаИсточника, ЗНАЧЕНИЕ(Справочник.КлючиАналитикПланирования.ПустаяСсылка)) КАК АналитикаИсточника,
							|	ISNULL(Запасы.АналитикаПланирования, ЗНАЧЕНИЕ(Справочник.КлючиАналитикПланирования.ПустаяСсылка)) КАК АналитикаПланирования,");
		Текст = СтрЗаменить(Текст,
							"Работы.Назначение                        КАК Назначение,",
							"Работы.Назначение                        КАК Назначение,
							|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикПланирования.ПустаяСсылка),
							|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикПланирования.ПустаяСсылка),");
		#КонецОбласти
		ТекстыЗапросов.Добавить(Текст);

		Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.Текст = РегистрыСведений.ТоварныеОграничения.ПодставитьСоединение(Запрос.Текст, "ПодстановкаТоварногоОграничения",
			"Товары.Номенклатура,Товары.Характеристика,Товары.Склад", "НастройкаПоддержанияЗапаса");

		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаОстатки = РезультатЗапроса.Выгрузить();
		ТаблицаОстатки.Индексы.Добавить("Номенклатура, Характеристика, Склад, ПодразделениеПолучатель, Назначение");

		ТаблицаОстатковНаВсехСкладах = Новый ТаблицаЗначений();
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("Номенклатура");
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("Характеристика");
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("Назначение");
		ТаблицаОстатковНаВсехСкладах.Колонки.Добавить("КРезервированию");

		Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПеремещениемОбособленныхТоваров")
				И Параметры.РасчетОбособленныхПотребностейСУчетомОстатковНаВсехСкладах Тогда

			УстановитьПривилегированныйРежим(Истина);

			Тексты = Новый Массив();

			// Излишки обособленного обеспечения.
			ТекстЗапроса =
				"ВЫБРАТЬ
				|	Запасы.Номенклатура КАК Номенклатура,
				|	Запасы.Характеристика КАК Характеристика,
				|	Запасы.Назначение КАК Назначение,
				|	Запасы.ВНаличииОстаток + Запасы.ЗаказаноОстаток КАК Запас
				|ПОМЕСТИТЬ ЗапасыИПотребности
				|ИЗ
				|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
				|		Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|			И (Номенклатура, Характеристика, Назначение) В(
				|				ВЫБРАТЬ
				|					Фильтр.Номенклатура КАК Номенклатура,
				|					Фильтр.Характеристика КАК Характеристика,
				|					Фильтр.Назначение КАК Назначение
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр)) КАК Запасы";
			Тексты.Добавить(ТекстЗапроса);

			//++ НЕ УТКА
			ТекстЗапроса =
				"ВЫБРАТЬ
				|	Набор.Номенклатура КАК Номенклатура,
				|	Набор.Характеристика КАК Характеристика,
				|	Набор.Склад КАК Склад,
				|	Набор.Назначение КАК Назначение,
				|	СУММА(Набор.Запас) КАК Запас,
				|	СУММА(Набор.КОбеспечению) КАК КОбеспечению
				|ПОМЕСТИТЬ ЗапасыИПотребностиДинамические
				|ИЗ(
				|	ВЫБРАТЬ
				|		Движения.Номенклатура КАК Номенклатура,
				|		Движения.Характеристика КАК Характеристика,
				|		Движения.Склад КАК Склад,
				|		Движения.Назначение КАК Назначение,
				|		Движения.Запланировано КАК Запас,
				|		0 КАК КОбеспечению
				|	ИЗ
				|		РегистрСведений.СтруктураЗаказа КАК Движения
				|	ГДЕ
				|		Движения.ВидСтроки <> ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции)
				|			И ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Движения.Номенклатура
				|					И Фильтр.Характеристика = Движения.Характеристика
				|					И Фильтр.Назначение = Движения.Назначение)
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|
				|	ВЫБРАТЬ
				|		Движения.Номенклатура КАК Номенклатура,
				|		Движения.Характеристика КАК Характеристика,
				|		Движения.Склад КАК Склад,
				|		Движения.Назначение КАК Назначение,
				|		0 КАК Запас,
				|		Движения.Требуется - Движения.РаспределеноИзЗапасовОбособленно - Движения.РаспределеноИзПартийОбособленно КАК КОбеспечению
				|	ИЗ
				|		РегистрСведений.СтруктураЗаказа КАК Движения
				|	ГДЕ
				|		Движения.ВидСтроки НЕ В(
				|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
				|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции))
				|			И ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Движения.Номенклатура
				|					И Фильтр.Характеристика = Движения.Характеристика
				|					И Фильтр.Назначение = Движения.Назначение)
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|
				|	ВЫБРАТЬ
				|		Движения.Номенклатура КАК Номенклатура,
				|		Движения.Характеристика КАК Характеристика,
				|		Движения.Склад КАК Склад,
				|		Движения.НазначениеСтруктуры КАК Назначение,
				|		0 КАК Запас,
				|		Движения.РаспределеноИзЗапасовОбособленно + Движения.РаспределеноИзПартийОбособленно КАК КОбеспечению
				|	ИЗ
				|		РегистрСведений.СтруктураЗаказа КАК Движения
				|	ГДЕ
				|		Движения.ВидСтроки НЕ В(
				|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.Продукция),
				|				ЗНАЧЕНИЕ(Перечисление.ВидыСтрокСтруктурыЗаказаНаПроизводство.ПроизводствоПродукции))
				|			И ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Движения.Номенклатура
				|					И Фильтр.Характеристика = Движения.Характеристика
				|					И Фильтр.Назначение = Движения.Назначение)) КАК Набор
				|СГРУППИРОВАТЬ ПО
				|	Набор.Номенклатура,
				|	Набор.Характеристика,
				|	Набор.Склад,
				|	Набор.Назначение
				|ИМЕЮЩИЕ
				|	СУММА(Набор.Запас) > 0 ИЛИ СУММА(Набор.КОбеспечению) > 0
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура, Характеристика, Склад, Назначение";
			Тексты.Добавить(ТекстЗапроса);
			//-- НЕ УТКА

			ТекстЗапроса =
				// Запасы на всех складах.
				"ВЫБРАТЬ
				|	Набор.Номенклатура КАК Номенклатура,
				|	Набор.Характеристика КАК Характеристика,
				|	Набор.Назначение КАК Назначение,
				|	СУММА(Набор.Запас) КАК КРезервированию
				|ИЗ(
				|	ВЫБРАТЬ
				|		Запасы.Номенклатура КАК Номенклатура,
				|		Запасы.Характеристика КАК Характеристика,
				|		Запасы.Назначение КАК Назначение,
				|		Запасы.Запас КАК Запас
				|	ИЗ
				|		ЗапасыИПотребности КАК Запасы
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|

				//++ НЕ УТКА

				|	ВЫБРАТЬ
				|		Запасы.Номенклатура КАК Номенклатура,
				|		Запасы.Характеристика КАК Характеристика,
				|		Запасы.Назначение КАК Назначение,
				|		Запасы.Запас КАК Запас
				|	ИЗ
				|		ЗапасыИПотребностиДинамические КАК Запасы
				|	ГДЕ
				|		Запасы.Запас > 0
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|

				//-- НЕ УТКА

				// Вычет ожидаемых поступлений по неотгруженным заказам на перемещение внутри сети, так как они не обеспечечиваются в обработке на складе РЦ.
				|	ВЫБРАТЬ
				|		Таблица.Номенклатура КАК Номенклатура,
				|		Таблица.Характеристика КАК Характеристика,
				|		Таблица.Назначение КАК Назначение,
				|		Таблица.РезервМинусЗапас КАК Запас
				|	ИЗ
				|		ЗаказыНаПеремещениеВнутриСети КАК Таблица
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|
				// Потребности на непопавших в обработку складах, кроме потребностей удаленных складов, так как они не обеспечиваются излишками.
				|	ВЫБРАТЬ
				|		Потребности.Номенклатура КАК Номенклатура,
				|		Потребности.Характеристика КАК Характеристика,
				|		Потребности.Назначение КАК Назначение,
				|		-Потребности.Зарезервировано - Потребности.Обеспечено - Потребности.НеОбеспечено КАК Запас
				|	ИЗ
				|		РегистрСведений.РаспределениеЗапасов КАК Потребности
				|	ГДЕ
				|		Потребности.Состояние В(
				|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить),
				|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе),
				|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении),
				|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве),
				|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаетсяПоНеподтвержденномуЗаказу),
				|				ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате))
				|			И Потребности.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|			И НЕ ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Потребности.Номенклатура
				|						И Фильтр.Характеристика = Потребности.Характеристика
				|						И Фильтр.Склад = Потребности.Склад
				|						И Фильтр.Назначение = Потребности.Назначение)
				|			И ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Потребности.Номенклатура
				|						И Фильтр.Характеристика = Потребности.Характеристика
				|						И Фильтр.Назначение = Потребности.Назначение)
				|			И НЕ ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					ТопологияСкладов КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Потребности.Номенклатура
				|						И Фильтр.Характеристика = Потребности.Характеристика
				|						И Фильтр.Склад = Потребности.Склад
				|						И Фильтр.Склад <> Фильтр.Центр)
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|

				//++ НЕ УТКА

				|	ВЫБРАТЬ
				|		Потребности.Номенклатура КАК Номенклатура,
				|		Потребности.Характеристика КАК Характеристика,
				|		Потребности.Назначение КАК Назначение,
				|		-Потребности.КОбеспечению КАК Запас
				|	ИЗ
				|		ЗапасыИПотребностиДинамические КАК Потребности
				|	ГДЕ
				|		Потребности.КОбеспечению > 0
				|			И НЕ ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Потребности.Номенклатура
				|						И Фильтр.Характеристика = Потребности.Характеристика
				|						И Фильтр.Склад = Потребности.Склад
				|						И Фильтр.Назначение = Потребности.Назначение)
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|

				//-- НЕ УТКА

				// Потребности, склад которых попал в обработку и обеспечивается в том числе за счет излишка, но считается обеспеченным автоматически, так как сама потребность в обработке не отображается.
				|	ВЫБРАТЬ
				|		Потребности.Номенклатура КАК Номенклатура,
				|		Потребности.Характеристика КАК Характеристика,
				|		Потребности.Назначение КАК Назначение,
				|		-Потребности.Зарезервировано КАК Запас
				|	ИЗ
				|		РегистрСведений.РаспределениеЗапасов КАК Потребности
				|	ГДЕ
				|		Потребности.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве)
				|			И Потребности.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|			И ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					РазличныеТоварыИСклады КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Потребности.Номенклатура
				|						И Фильтр.Характеристика = Потребности.Характеристика
				|						И Фильтр.Склад = Потребности.Склад
				|						И Фильтр.Назначение = Потребности.Назначение)
				|			И НЕ ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					ЗаказыНаПеремещениеВнутриСетиГруппировкаПоЗаказам КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Потребности.Номенклатура
				|						И Фильтр.Характеристика = Потребности.Характеристика
				|						И Фильтр.СкладОтправитель = Потребности.Склад
				|						И Фильтр.Назначение = Потребности.Назначение
				|						И Фильтр.Заказ = Потребности.ЗаказНаОтгрузку)
				|			И НЕ ИСТИНА В(
				|				ВЫБРАТЬ ПЕРВЫЕ 1
				|					ИСТИНА КАК ЕстьЗаписи
				|				ИЗ
				|					ТопологияСкладов КАК Фильтр
				|				ГДЕ
				|					Фильтр.Номенклатура = Потребности.Номенклатура
				|						И Фильтр.Характеристика = Потребности.Характеристика
				|						И Фильтр.Склад = Потребности.Склад
				|						И Фильтр.Склад <> Фильтр.Центр)) КАК Набор
				|СГРУППИРОВАТЬ ПО
				|	Набор.Номенклатура,
				|	Набор.Характеристика,
				|	Набор.Назначение
				|ИМЕЮЩИЕ
				|	СУММА(Набор.Запас) > 0";
			Тексты.Добавить(ТекстЗапроса);
			Запрос.Текст = СтрСоединить(Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
			ТаблицаОстатковНаВсехСкладах = Запрос.Выполнить().Выгрузить();
			ТаблицаОстатковНаВсехСкладах.Индексы.Добавить("Номенклатура, Характеристика, Назначение");

		КонецЕсли;

		// Расчет количества к резервированию с текущего склада.
		Отбор = Новый Структура("Номенклатура, Характеристика, Склад, Назначение, ПодразделениеПолучатель");
		ОтборОстатковВсехСкладов = Новый Структура("Номенклатура, Характеристика, Назначение");

		Для Каждого СтрокаЗаказы Из Таблица Цикл

			ЗаполнитьЗначенияСвойств(Отбор, СтрокаЗаказы);
			ЗаполнитьЗначенияСвойств(ОтборОстатковВсехСкладов, СтрокаЗаказы);
			СтрокиОстатков = ТаблицаОстатки.НайтиСтроки(Отбор);

			Если СтрокиОстатков.Количество() > 0 Тогда
				НайденнаяСтрока = СтрокиОстатков[0];
				НайденнаяСтрока.КРезервированию = Макс(0, НайденнаяСтрока.КРезервированию - СтрокаЗаказы.КРезервированию);
			КонецЕсли;

			Если ЗначениеЗаполнено(СтрокаЗаказы.Назначение)
				И Не СтрокаЗаказы.ЭтоРабота
				И Не СтрокаЗаказы.ОбеспечиваетсяИзРаспределительногоЦентра Тогда // истина, только для удаленного склада

				НайденныеСтроки = ТаблицаОстатковНаВсехСкладах.НайтиСтроки(ОтборОстатковВсехСкладов);
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденныеСтроки[0].КРезервированию = Макс(0, НайденныеСтроки[0].КРезервированию - СтрокаЗаказы.КРезервированию);
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		Для Каждого СтрокаЗаказы Из Таблица Цикл

			ЗаполнитьЗначенияСвойств(Отбор, СтрокаЗаказы);
			ЗаполнитьЗначенияСвойств(ОтборОстатковВсехСкладов, СтрокаЗаказы);
			СтрокиОстатков = ТаблицаОстатки.НайтиСтроки(Отбор);

			КРезервированию = 0;
			Если СтрокиОстатков.Количество() > 0 Тогда

				НайденнаяСтрока = СтрокиОстатков[0];
				КРезервированию = Макс(0, Мин(НайденнаяСтрока.КРезервированию, СтрокаЗаказы.Требуется - СтрокаЗаказы.КРезервированию));
				СтрокаЗаказы.КРезервированию = СтрокаЗаказы.КРезервированию + КРезервированию;
				НайденнаяСтрока.КРезервированию = НайденнаяСтрока.КРезервированию - КРезервированию;

			КонецЕсли;

			Если ЗначениеЗаполнено(СтрокаЗаказы.Назначение)
				И Не СтрокаЗаказы.ЭтоРабота
				И Не СтрокаЗаказы.ОбеспечиваетсяИзРаспределительногоЦентра Тогда

				НайденныеСтроки = ТаблицаОстатковНаВсехСкладах.НайтиСтроки(ОтборОстатковВсехСкладов);
				Если НайденныеСтроки.Количество() > 0 Тогда
					КРезервированиюПоТовару = Мин(НайденныеСтроки[0].КРезервированию, КРезервированию);
					НайденныеСтроки[0].КРезервированию = НайденныеСтроки[0].КРезервированию - КРезервированиюПоТовару;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		// Дообеспечение товарами с других складов.
		Для Каждого СтрокаЗаказы Из Таблица Цикл

			Если ЗначениеЗаполнено(СтрокаЗаказы.Назначение)

				И Не СтрокаЗаказы.ЭтоРабота
				И Не СтрокаЗаказы.ОбеспечиваетсяИзРаспределительногоЦентра Тогда

				ЗаполнитьЗначенияСвойств(ОтборОстатковВсехСкладов, СтрокаЗаказы);
				НайденныеСтроки = ТаблицаОстатковНаВсехСкладах.НайтиСтроки(ОтборОстатковВсехСкладов);
				Если НайденныеСтроки.Количество() > 0 Тогда
					КРезервированию = Макс(0, Мин(НайденныеСтроки[0].КРезервированию, СтрокаЗаказы.Требуется - СтрокаЗаказы.КРезервированию));
					НайденныеСтроки[0].КРезервированию = НайденныеСтроки[0].КРезервированию - КРезервированию;
					СтрокаЗаказы.КРезервированию = СтрокаЗаказы.КРезервированию + КРезервированию;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	#Область УХ_Внедрение
	//
	Таблица.Колонки.Добавить("СогласноПланамПоставокПоДоговорам", Новый ОписаниеТипов("Булево"));

	Отбор = Новый Структура("ТипОбеспечения", Перечисления.ТипыОбеспечения.Покупка);
	ТаблицаСпособов = Таблица.Скопировать(Отбор, "СпособОбеспечения").ВыгрузитьКолонку("СпособОбеспечения");
	МассивСпособов = Новый Массив;
	Для Каждого СтрокаСпособов Из Таблица Цикл
		Если СтрокаСпособов.СпособОбеспечения <> Null И ЗначениеЗаполнено(СтрокаСпособов.СпособОбеспечения) Тогда
			МассивСпособов.Добавить(СтрокаСпособов.СпособОбеспечения);
		КонецЕсли;
	КонецЦикла;

	СоответствиеРеквизитов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСпособов, "СогласноПланамПоставокПоДоговорам");

	Для Каждого КлючЗначение ИЗ СоответствиеРеквизитов Цикл
		Отбор = Новый Структура("СпособОбеспечения", КлючЗначение.Ключ);
		Для Каждого Строка Из Таблица.НайтиСтроки(Отбор) Цикл
			Строка.СогласноПланамПоставокПоДоговорам = КлючЗначение.Значение;
		КонецЦикла;
	КонецЦикла;

	#КонецОбласти
	ПоместитьВоВременноеХранилище(Таблица, АдресРезультата);

КонецПроцедуры
#КонецОбласти
