#Область СлужебныеПроцедурыИФункции
&После("СкладОтправительПриИзменении")
&НаКлиенте
Процедура cbr_СкладОтправительПриИзменении(Элемент)
	
	//++АшаеваАН 13.02.26 СКЛ.3
	Если ЗначениеЗаполнено(Объект.СкладОтправитель) 
		 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "cbr_СкладРаспределения") Тогда
			ЭтаФорма.cbr_СкладРаспределения = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.СкладОтправитель, "cbr_СкладРаспределения");
	КонецЕсли;
	//--АшаеваАН 13.02.26 СКЛ.3
	
КонецПроцедуры


&ИзменениеИКонтроль("УстановитьДоступностьКомандОбеспечения")
&НаСервере
Процедура cbr_УстановитьДоступностьКомандОбеспечения()
	
	#Удаление
	Элементы.ТоварыОтгрузить.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыРезервировать.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыРезервироватьПоМереПоступления.Доступность = ЕстьДоступКСкладуОтправителю;
	#КонецУдаления
	Элементы.ТоварыКОбеспечению.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыНеОбеспечивать.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыКонтекстноеМенюОтгрузить.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыКонтекстноеМенюРезервировать.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыКонтекстноеМенюРезервироватьПоМереПоступления.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыКонтекстноеМенюКОбеспечению.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыКонтекстноеМенюНеОбеспечивать.Доступность = ЕстьДоступКСкладуОтправителю;
	Элементы.ТоварыДоступно.Видимость = ЕстьДоступКСкладуОтправителю;
	#Вставка
	Элементы.ТоварыОтгрузить.Видимость = Ложь;
	Элементы.ТоварыРезервировать.Видимость = Ложь;
	Элементы.ТоварыРезервироватьПоМереПоступления.Видимость = Ложь;
	Элементы.ТоварыСоздатьКорректировкуНазначенияСнятиеРезерва.Видимость = Ложь;
	Элементы.ТоварыСоздатьКорректировкуНазначенияРезервирование.Видимость = Ложь;
	#КонецВставки

КонецПроцедуры

#КонецОбласти
