#Область СлужебныеПроцедурыИФункции

//&После("ОбработкаПроведения")
//Процедура cbr_ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
//	
//	//++ СкребковЮМ 10.02.26 СКЛ.19		
//	Если Объект.ДополнительныеСвойства.БылПроведен Тогда
//		Возврат;
//	КонецЕсли;
//
//	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства Тогда
//
//		Если Объект.Получатель <> Неопределено И ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Склады") Тогда
//			СкладГотовойПродукции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Получатель,
//				"cbr_СкладГотовойПродукции");
//
//			Если СкладГотовойПродукции Тогда
//
//				ДанныеПродукции = cbr_ПолучитьДанныеПродукции(Объект.Ссылка);
//				Для Каждого СтрПродукция Из ДанныеПродукции Цикл
//
//					ПриходныйОрдер = cbr_СоздатьПриходныйОрдерНаТовары(Объект, СтрПродукция.Распоряжение,
//						СтрПродукция.Помещение);
//
//					Если ПриходныйОрдер = Неопределено Тогда
//						Возврат;
//					КонецЕсли;
//
//					Если cbr_СоздатьОтборРазмещениеТоваров(ПриходныйОрдер, РежимЗаписиДокумента.Запись) Тогда
//						cbr_СоздатьОтборРазмещениеТоваров(ПриходныйОрдер, РежимЗаписиДокумента.Проведение);
//					Иначе
//						Возврат;
//					КонецЕсли;
//				КонецЦикла;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	//-- СкребковЮМ 10.02.26 СКЛ.19
//
//КонецПроцедуры
//
////++ СкребковЮМ 10.02.26 СКЛ.19
//Функция cbr_ПолучитьДанныеПродукции(Документ)
//
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	ДвижениеПродукцииИМатериаловТовары.Распоряжение КАК Распоряжение,
//	|	Номенклатура.СкладскаяГруппа КАК СкладскаяГруппа,
//	|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель КАК Склад
//	|ПОМЕСТИТЬ втДанныеПродукции
//	|ИЗ
//	|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|		ПО ДвижениеПродукцииИМатериаловТовары.Номенклатура = СпрНоменклатура.Ссылка
//	|ГДЕ
//	|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втДанныеПродукции.Распоряжение КАК Распоряжение,
//	|	ЕСТЬNULL(ПравилаРазмещенияТоваровВЯчейках.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) КАК
//	|		Помещение,
//	|	МАКСИМУМ(ЕСТЬNULL(ПравилаРазмещенияТоваровВЯчейках.Приоритет, -1)) КАК Приоритет
//	|ИЗ
//	|	втДанныеПродукции КАК втДанныеПродукции
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаРазмещенияТоваровВЯчейках КАК ПравилаРазмещенияТоваровВЯчейках
//	|		ПО втДанныеПродукции.СкладскаяГруппа = ПравилаРазмещенияТоваровВЯчейках.СкладскаяГруппаНоменклатуры
//	|		И втДанныеПродукции.Склад = ПравилаРазмещенияТоваровВЯчейках.Склад
//	|СГРУППИРОВАТЬ ПО
//	|	втДанныеПродукции.Распоряжение,
//	|	ЕСТЬNULL(ПравилаРазмещенияТоваровВЯчейках.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка))";
//
//	Запрос.УстановитьПараметр("Ссылка", Документ);
//
//	РезультатЗапроса = Запрос.Выполнить();
//
//	Возврат РезультатЗапроса.Выгрузить();
//
//КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19
//
////++ СкребковЮМ 10.02.26 СКЛ.19
//Функция cbr_СоздатьПриходныйОрдерНаТовары(Объект, Распоряжение, Помещение)
//
//	Основание = Новый Структура;
//	Основание.Вставить("Распоряжение", Распоряжение);
//	Основание.Вставить("Отправитель", Объект.Отправитель);
//	Основание.Вставить("Склад", Объект.Получатель);
//	Основание.Вставить("Помещение", Помещение);
//	Основание.Вставить("ДатаВходящегоДокумента", Объект.Дата);
//	Основание.Вставить("НомерВходящегоДокумента", Объект.Номер);
//	Основание.Вставить("ДатаПоступления", ТекущаяДатаСеанса());
//	Основание.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);
//
//	ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
//
//	НачатьТранзакцию();
//	Попытка
//		ПриходныйОрдер.Заполнить(Основание);
//		ПриходныйОрдер.Дата = ТекущаяДатаСеанса();
//		ПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
//
//		Заполнены = Документы.ПриходныйОрдерНаТовары.ЗаполнитьСерииПоРаспоряжению(ПриходныйОрдер, Ложь);
//		Если Заполнены Тогда
//			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(
//				ПриходныйОрдер, Документы.ПриходныйОрдерНаТовары));
//			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ПриходныйОрдер, ПараметрыУказанияСерий);
//		КонецЕсли;
//
//		ПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
//		ЗафиксироватьТранзакцию();
//	Исключение
//		ОтменитьТранзакцию();
//		СообщениеОбОшибке = НСтр("ru = 'Ошибка проведения документа ""Приходный ордер на товары"".'");
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
//
//		ЗаписьЖурналаРегистрации("ОшибкаВыполнения", УровеньЖурналаРегистрации.Ошибка,
//			Метаданные.Документы.ПриходныйОрдерНаТовары, , ОбработкаОшибок.ПодробноеПредставлениеОшибки(
//			ИнформацияОбОшибке()));
//
//		Возврат Неопределено;
//	КонецПопытки;
//
//	Возврат ПриходныйОрдер.Ссылка;
//
//КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19
//
////++ СкребковЮМ 10.02.26 СКЛ.19
//Функция cbr_СоздатьОтборРазмещениеТоваров(ПриходныйОрдер, РежимЗаписи)
//
//	ОтборРазмещение = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
//
//	НачатьТранзакцию();
//	Попытка
//		ОтборРазмещение.Заполнить(ПриходныйОрдер);
//		ОтборРазмещение.Записать(РежимЗаписи);
//		ЗафиксироватьТранзакцию();
//	Исключение
//		ОтменитьТранзакцию();
//		СообщениеОбОшибке = НСтр("ru = 'Ошибка проведения документа ""Отбор (размещение) товаров"".'");
//		СообщениеОбОшибке = ?(РежимЗаписи = РежимЗаписиДокумента.Запись, СтрЗаменить(СообщениеОбОшибке, "проведения",
//			"записи"), СообщениеОбОшибке);
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
//
//		ЗаписьЖурналаРегистрации("ОшибкаВыполнения", УровеньЖурналаРегистрации.Ошибка,
//			Метаданные.Документы.ОтборРазмещениеТоваров, , ОбработкаОшибок.ПодробноеПредставлениеОшибки(
//		ИнформацияОбОшибке()));
//
//		Возврат Ложь;
//	КонецПопытки;
//
//	Возврат Истина;
//
//КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

#КонецОбласти