Функция cbr_ПолучениеУпаковокСЗаполненнымСвойством() Экспорт
	//++ cbr-larkovgeorg 10.02.26 СКЛ.12
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.cbr_СвойствоУпаковки > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить()
		
	Иначе
		
		Возврат Неопределено
		
	КонецЕсли;

КонецФункции//-- cbr-larkovgeorg 10.02.26 СКЛ.12