#Область СлужебныеПроцедурыИФункции
&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	//++АшаеваАН 13.02.26 СКЛ.3
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "cbr_СкладРаспределения") Тогда
		cbr_РаспределитьПоЗаказам(Объект);
	КонецЕсли;
	//--АшаеваАН 13.02.26 СКЛ.3
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область РаспределениеПоЗаказам

//++АшаеваАН 13.02.26 СКЛ.3
Процедура cbr_РаспределитьПоЗаказам(Приобритение) Экспорт
	
	cbr_ПересчитатьЗаказы(Приобритение); 
	
КонецПроцедуры //--АшаеваАН 13.02.26 СКЛ.3

//++АшаеваАН 13.02.26 СКЛ.3
Процедура cbr_ПересчитатьЗаказы(Приобритение)
				
	ПриобритениеТовары = Приобритение.Товары.Выгрузить();
	ДатаОтгрузки = Приобритение.Дата;
	ЗаказПоставщику = Приобритение.ЗаказПоставщику;
	ПТУ = Приобритение.Ссылка;
	
	ЗаказыСОстатками = cbr_Заказы(Приобритение.Склад, ПриобритениеТовары); 
	ЗаказыНаПеремещение = ЗаказыСОстатками.ВыгрузитьКолонку("ЗаказНаПеремещение");
	ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(ЗаказыНаПеремещение);
	
	Для каждого Заказ из ЗаказыНаПеремещение Цикл
		
		ЗаказОбъект = Заказ.ПолучитьОбъект(); 
		Строки = ЗаказыСОстатками.НайтиСтроки(Новый Структура("ЗаказНаПеремещение",Заказ));
		ОбрабатываемыеСтроки = Новый Массив();
		
		Для каждого Строка Из Строки Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", Строка.Номенклатура);
			ПараметрыОтбора.Вставить("Характеристика", Строка.Характеристика);
			ПараметрыОтбора.Вставить("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.КОбеспечению);
			НайденныеСтроки = ЗаказОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
			
			Для каждого СтрокаЗаказа Из НайденныеСтроки Цикл
			 	
			 	СтрокаРасчитана = Ложь;
			 	КоличествоДо = СтрокаЗаказа.КоличествоУпаковок;
			 	СтрокиПриобритения = ПриобритениеТовары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрокаЗаказа.Номенклатура, СтрокаЗаказа.Характеристика));
			 	
			 	Для Каждого СтрокаПриоб Из СтрокиПриобритения Цикл
					Если СтрокаПриоб.КоличествоУпаковок > 0 Тогда
							Если СтрокаПриоб.КоличествоУпаковок >= СтрокаЗаказа.КоличествоУпаковок Тогда
								СтрокаПриоб.КоличествоУпаковок = СтрокаПриоб.КоличествоУпаковок - СтрокаЗаказа.КоличествоУпаковок;
								КоличествоДо = 0;
								СтрокаРасчитана = Истина;
							Иначе
								СтрокаЗаказа.КоличествоУпаковок = СтрокаПриоб.КоличествоУпаковок;
								КоличествоДо = КоличествоДо - СтрокаЗаказа.КоличествоУпаковок; 
								СтрокаПриоб.КоличествоУпаковок = 0;
								СтрокаРасчитана = Истина;
							КонецЕсли;
							Прервать;
						КонецЕсли;
			 	КонецЦикла;
			 	
			 	Если НЕ СтрокаРасчитана Тогда
			 		Продолжить;
			 	Иначе
					Если КоличествоДо > 0 Тогда
						cbr_РазбитьСтроку(ЗаказОбъект.Товары, СтрокаЗаказа, КоличествоДо);
					КонецЕсли;
						
					СтрокаЗаказа.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					СтрокаЗаказа.НачалоОтгрузки = ДатаОтгрузки;
					СтрокаЗаказа.ОкончаниеПоступления = ДатаОтгрузки;
					СтрокаЗаказа.cbr_ЗаказПоставщику = ЗаказПоставщику;
					СтрокаЗаказа.cbr_ПТУ = ПТУ;
					
					ОбрабатываемыеСтроки.Добавить(СтрокаЗаказа);
				 КонецЕсли;
			 
			КонецЦикла;	
		КонецЦикла;
		
		Если ОбрабатываемыеСтроки.Количество() Тогда
			cbr_ОбработатьСтрокиТЧ(ЗаказОбъект.Товары ,ОбрабатываемыеСтроки);
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Конецесли;
			
	КонецЦикла;

КонецПроцедуры //--АшаеваАН 13.02.26 СКЛ.3

//++АшаеваАН 13.02.26 СКЛ.3
Функция cbr_Заказы(Склад, ПТУТовары)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПТУТовары.Номенклатура КАК Номенклатура,
	|	ПТУТовары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втПТУТовары
	|ИЗ
	|	&ПТУТовары КАК ПТУТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
	|	ЗаказыНаПеремещениеОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыНаПеремещениеОстатки.Характеристика КАК Характеристика,
	|	ЗаказыНаПеремещениеОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(, (Номенклатура, Характеристика) В
	|		(ВЫБРАТЬ
	|			втПТУТовары.Номенклатура,
	|			втПТУТовары.Характеристика
	|		ИЗ
	|			втПТУТовары КАК втПТУТовары)) КАК ЗаказыНаПеремещениеОстатки
	|ГДЕ
	|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.СкладОтправитель = &СкладОтправитель
	|
	|УПОРЯДОЧИТЬ ПО
	|ЗаказНаПеремещение";
	
	Запрос.УстановитьПараметр("ПТУТовары", ПТУТовары);
	Запрос.УстановитьПараметр("СкладОтправитель", Склад);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //--АшаеваАН 13.02.26 СКЛ.3

//++АшаеваАН 13.02.26 СКЛ.3
Процедура cbr_РазбитьСтроку(ТоварыЗаказа,СтрокаЗаказа,Количество)
	
	НоваяСтрока = ТоварыЗаказа.Вставить(ТоварыЗаказа.Индекс(СтрокаЗаказа) + 1);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаказа,,"НомерСтроки");
	НоваяСтрока.КоличествоУпаковок = Количество;
	
КонецПроцедуры //--АшаеваАН 13.02.26 СКЛ.3

//++АшаеваАН 13.02.26 СКЛ.3
Процедура cbr_ОбработатьСтрокиТЧ(ТЧТовары, ОбрабатываемыеСтроки)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
	ОбрабатываемыеСтроки,
	СтруктураДействий,
	ТЧТовары,
	КэшированныеЗначения);
	
КонецПроцедуры //--АшаеваАН 13.02.26 СКЛ.3

#КонецОбласти  

#КонецОбласти 
