#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

//++АшаеваАН 26.01.26 ЗПК15
// Параметры:
//  Документ - ДокументОбъект.ПриобретениеТоваровУслуг
Процедура cbr_ЗарегистрироватьЦеныНоменклатурыПоставщика(Знач Документ) Экспорт
		
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&ТЗТовары КАК ТЗТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.ВидЦеныПоставщика,
		|	Товары.Цена,
		|	Товары.НоменклатураПартнера
		|ПОМЕСТИТЬ ВТТоварыЗП
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК Товары
		|
		|ГДЕ Товары.Ссылка = &ЗаказПоставщику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура,
		|	ВТТовары.Характеристика,
		|	ВТТовары.ВидЦеныПоставщика,
		|	МАКСИМУМ(ВТТовары.Цена),
		|	ВТТовары.НоменклатураПартнера,
		|	&Партнер КАК Партнер,
		|	&Валюта КАК Валюта,
		|	&Дата КАК Период,
		|	ВТТовары.Упаковка
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварыЗП КАК ВТТоварыЗП
		|		ПО ВТТовары.Номенклатура = ВТТоварыЗП.Номенклатура
		| 		 И ВТТовары.Характеристика = ВТТоварыЗП.Характеристика
        |   	 И ВТТовары.ВидЦеныПоставщика = ВТТоварыЗП.ВидЦеныПоставщика
        |		 И ВТТовары.НоменклатураПартнера = ВТТоварыЗП.НоменклатураПартнера 
        |
        |ГДЕ 
        |	ВТТовары.Цена <> ЕСТЬNULL(ВТТоварыЗП.Цена,0)
        | 	И ВТТовары.ВидЦеныПоставщика <> ЗНАЧЕНИЕ(Справочник.ВидыЦенПоставщиков.ПустаяСсылка)
        |
        |Сгруппировать ПО
        |	ВТТовары.Номенклатура,
		|	ВТТовары.Характеристика,
		|	ВТТовары.ВидЦеныПоставщика,
		|	ВТТовары.НоменклатураПартнера,
		|   &Партнер,
		|	&Валюта,
		|	&Дата,
		|	ВТТовары.Упаковка";
		
		Запрос.УстановитьПараметр("ТЗТовары", Документ.Товары.Выгрузить());
		Запрос.УстановитьПараметр("ЗаказПоставщику", Документ.ЗаказПоставщику);
		Запрос.УстановитьПараметр("Партнер", Документ.Партнер);
		Запрос.УстановитьПараметр("Валюта", Документ.Валюта);
		Запрос.УстановитьПараметр("Дата", Документ.Дата);
		
		Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда

	    НаборЗаписи = РегистрыСведений.ЦеныНоменклатурыПоставщиков.СоздатьНаборЗаписей();
	    НаборЗаписи.Отбор.Регистратор.Установить(Документ.Ссылка);
	    НаборЗаписи.Загрузить(Результат);
	    НаборЗаписи.Записать();	
	    
	КонецЕсли;	
	
КонецПроцедуры //--АшаеваАН 26.01.26 ЗПК15

Процедура cbr_ВыполнитьФоновеЗаданиеФормированиеДокументовПеремещения(Ссылка) Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	ПараметрыПроцедуры = Новый Структура();
    ПараметрыПроцедуры.Вставить("Приобретение", Ссылка);
    
    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование перемещение товаров.");
    
    ДлительныеОперации.ВыполнитьВФоне("РегистрыНакопления.cbr_ТоварыКПеремещению.cbr_СформироватьДокументыПеремещенияНаОснованииПТУ", ПараметрыПроцедуры, ПараметрыВыполнения);

КонецПроцедуры

Процедура cbr_ПроверитьДокументНаПеремещениеТоваров(Ссылка) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	cbr_ТоварыКПеремещению.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.cbr_ТоварыКПеремещению КАК cbr_ТоварыКПеремещению
	|ГДЕ
	|	cbr_ТоварыКПеремещению.ВидДвижения = &ВидДвижения
	|		И cbr_ТоварыКПеремещению.ПТУ = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	cbr_ТоварыКПеремещению.Регистратор";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда

		МассивПеремещений = Результат.Выгрузить().ВыгрузитьКолонку("Регистратор");
			
		Разделитель = " ,";
		Перемещения = СтрСоединить(МассивПеремещений, Разделитель); 
		
		ТекстСообщения = НСтр("ru = 'У документа ПТУ уже есть документы перемещения: %Перемещения%.'"); 
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Перемещения%", Перемещения); 
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Документы.ПриобретениеТоваровУслуг,, ТекстСообщения);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли