#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
    
    МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ЭтотОбъект.Метаданные().ПолноеИмя());
    
	//++АшаеваАН 26.01.26 ЗПК15    
    Если Не Отказ И РегистрироватьЦеныПоставщика И ЗначениеЗаполнено(ЗаказПоставщику) Тогда
     Документы.ПриобретениеТоваровУслуг.cbr_ЗарегистрироватьЦеныНоменклатурыПоставщика(ЭтотОбъект);
    КонецЕсли;
	//--АшаеваАН 26.01.26 ЗПК15
	
	//++АшаеваАН 13.02.26 СКЛ.3
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "cbr_СкладРаспределения") Тогда
		Если Отказ Тогда
			МенеджерОбъекта.cbr_ПроверитьДокументНаПеремещениеТоваров(Ссылка);
		Иначе
			//МенеджерОбъекта.cbr_ВыполнитьФоновеЗаданиеФормированиеДокументовПеремещения(Ссылка);
		КонецЕсли;
	КонецЕсли;
	//++АшаеваАН 13.02.26 СКЛ.3
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

