#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
    
	//++АшаеваАН 26.01.26 ЗПК15    
    Если Не Отказ И РегистрироватьЦеныПоставщика И ЗначениеЗаполнено(ЗаказПоставщику) Тогда
     Документы.ПриобретениеТоваровУслуг.cbr_ЗарегистрироватьЦеныНоменклатурыПоставщика(ЭтотОбъект);
    КонецЕсли;
	//--АшаеваАН 26.01.26 ЗПК15
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли

