#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СоздатьОтборРазмещениеИзРасходногоОрдера(РасходныйОрдер) Экспорт

	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РасходныйОрдер,
							"Статус, Склад, Помещение, ЗонаОтгрузки, ДатаОтгрузки");
	
	Если Не СкладыСервер.ИспользоватьАдресноеХранение(РеквизитыОснования.Склад, РеквизитыОснования.Помещение, РеквизитыОснования.ДатаОтгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваров.Отбор");
	
	ОтборРазмещениеТоваров = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	ОтборРазмещениеТоваров.Дата = ТекущаяДатаСеанса();
	ОтборРазмещениеТоваров.ВидОперации = ВидОперации;
	ОтборРазмещениеТоваров.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваров.ВРаботе");
	ОтборРазмещениеТоваров.Распоряжение = РасходныйОрдер;
	
	ЗаполнитьЗначенияСвойств(ОтборРазмещениеТоваров, РеквизитыОснования, "ЗонаОтгрузки, Склад, Помещение");
	
	ОтборРазмещениеТоваров.ЗаполнитьТоварыОтборПоРаспоряжению();
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ОтборРазмещениеТоваров, Документы.ОтборРазмещениеТоваров);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтборРазмещениеТоваров, ПараметрыУказанияСерий.Отбор);
	
	ОтборРазмещениеТоваров.ОтобратьТовары("ТоварыОтбор");
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтборРазмещениеТоваров, ПараметрыУказанияСерий.Отбор);
	
	ОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Запись);
	
	Ошибка = Ложь;
	
	МассивЯчеек = ОтборРазмещениеТоваров.ТоварыОтбор.ВыгрузитьКолонку("Ячейка");
	Для Каждого ЭлементМассива Из МассивЯчеек Цикл
		Если Не ЗначениеЗаполнено(ЭлементМассива) Тогда
			Ошибка = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Ошибка Тогда
		ТекстСообщения = НСтр("ru='Ошибка проведения документа %1. Не заполнены некоторые ячейки.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОтборРазмещениеТоваров.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Попытка
	
		ОтборРазмещениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
	
	Исключение
		
		Ошибка = Истина;
	
	КонецПопытки;
	
	ТекстСообщения = НСтр("ru = 'Создан документ %1'");
	
	Если Ошибка Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при записи документа %1'");
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон(ТекстСообщения, ОтборРазмещениеТоваров.Ссылка);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

#КонецЕсли