#Область ОбработчикиСобытий
&ИзменениеИКонтроль("ОтобратьТовары")
Процедура cbr_ОтобратьТовары(ИмяИсточника) Экспорт

	ЗаполнитьПараметрыПроверки(ИмяИсточника);

	Если ПроверитьЗаполнение() Тогда

		Менеджер = Новый МенеджерВременныхТаблиц;

		Если ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение Тогда

			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Менеджер;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	Таблица.Назначение КАК Назначение,
			|	Таблица.Серия КАК Серия,
			|	Таблица.Количество КАК Количество
			|ПОМЕСТИТЬ ТаблицаНоменклатурыДляЗапроса
			|ИЗ
			|	&Товары КАК Таблица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаНоменклатурыДляЗапроса.Номенклатура,
			|	ТаблицаНоменклатурыДляЗапроса.Характеристика,
			|	ТаблицаНоменклатурыДляЗапроса.Назначение,
			|	ТаблицаНоменклатурыДляЗапроса.Серия,
			|	СУММА(ТаблицаНоменклатурыДляЗапроса.Количество) КАК Количество,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
			|	0 КАК Приоритет,
			|	&Распоряжение КАК Распоряжение,
			|	ВЫРАЗИТЬ(ТаблицаНоменклатурыДляЗапроса.Номенклатура КАК Справочник.Номенклатура).СкладскаяГруппа КАК СкладскаяГруппаНоменклатуры
			|ПОМЕСТИТЬ ТаблицаНоменклатуры
			|ИЗ
			|	ТаблицаНоменклатурыДляЗапроса КАК ТаблицаНоменклатурыДляЗапроса
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаНоменклатурыДляЗапроса.Номенклатура,
			|	ТаблицаНоменклатурыДляЗапроса.Характеристика,
			|	ТаблицаНоменклатурыДляЗапроса.Назначение,
			|	ТаблицаНоменклатурыДляЗапроса.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТаблицаНоменклатурыДляЗапроса";

			ТаблицаКРазмещению = ЭтотОбъект[ИмяИсточника].Выгрузить(,"Номенклатура,Характеристика,Назначение,Серия,Количество");

			Запрос.УстановитьПараметр("Товары",ТаблицаКРазмещению);
			Запрос.УстановитьПараметр("Распоряжение",?(ЗначениеЗаполнено(Распоряжение),Распоряжение,""));

			Запрос.Выполнить();

			ОшибкаПроверки = Ложь;

			СтруктураВозврата = СкладыСервер.ОтобратьТоварИзЯчеек(Менеджер,Склад,Помещение);


		Иначе

			СкладыСервер.ОстаткиТоваровКОтбору(Менеджер, Распоряжение, Склад, Помещение);

			ОшибкаПроверки = Ложь;
			
			#Удаление
			СтруктураВозврата = СкладыСервер.ОтобратьТоварИзЯчеек(Менеджер,Склад,Помещение);
			#КонецУдаления
			
			#Вставка
			Если Не ДополнительныеСвойства.Свойство("cbr_РазмещениеПоЭтапуПроизводства") Тогда
				СтруктураВозврата = СкладыСервер.ОтобратьТоварИзЯчеек(Менеджер,Склад,Помещение);
			Иначе
				СтруктураВозврата = СкладыСервер.cbr_ОтобратьТоварИзЯчеек(Менеджер,Склад,Помещение);
			КонецЕсли;
			#КонецВставки

		КонецЕсли;

		Менеджер.Закрыть();

		ТоварыОтбор.Очистить();

		Для Каждого СтрТабл Из СтруктураВозврата.ТаблицаОшибок Цикл

			Если СтрТабл.Количество > 0 Тогда

				НоваяСтрока = ТоварыОтбор.Добавить();

				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТабл);

				Если НоваяСтрока.КоличествоУпаковок = 0 Тогда
					НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		Для Каждого СтрТабл Из СтруктураВозврата.ТаблицаРезультатов Цикл

			Если СтрТабл.Количество > 0 Тогда

				НоваяСтрока = ТоварыОтбор.Добавить();

				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТабл);

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	ДополнительныеСвойства.Удалить("ПараметрыПроверки");

КонецПроцедуры
#КонецОбласти
