#Область Документы_ОбработкаПроведения

//++ БаженоваЕО 30.01.2026 ПРД.18
Процедура cbr_ДобавитьДвиженияcbr_ОплатаОтгрузкаПоМенеджерамОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Движения = Источник.Движения.cbr_ОплатаОтгрузкаПоМенеджерам;
	Движения.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Для Каждого Стр Из Источник.cbr_ТЧПересечениеМенеджеров Цикл
			Движение = Движения.Добавить();
			Движение.Регистратор = Источник.Ссылка;
			Движение.Период = Источник.Дата;
			Движение.РеализацияТоваровУслуг = Источник.Ссылка; 
			Движение.ЗаказКлиента = Источник.ЗаказКлиента;
			Движение.ФизическоеЛицо = Стр.ФизическоеЛицо;
			Движение.Процент = Стр.Процент;
			Движение.СуммаОтгружено = Источник.СуммаДокумента * Стр.Процент;
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
	
		Для Каждого Стр Из Источник.РасшифровкаПлатежа Цикл
			
			ОбъектРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ОбъектРасчетов, "Объект");
			Для каждого СтрокаМенеджер Из ОбъектРасчетов.cbr_ТЧПересечениеМенеджеров Цикл
				Если ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					
					Движение = Движения.Добавить();
					Движение.Регистратор = Источник.Ссылка;
					Движение.Период = Источник.Дата;				
					Движение.РеализацияТоваровУслуг = ОбъектРасчетов;
					Движение.ЗаказКлиента = ОбъектРасчетов.ЗаказКлиента;
					Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
					Движение.Процент = СтрокаМенеджер.Процент;	
					Движение.СуммаОплачено = Источник.СуммаДокумента * СтрокаМенеджер.Процент;
					
				ИначеЕсли ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
					
					Движение = Движения.Добавить();
					Движение.Регистратор = Источник.Ссылка;
					Движение.Период = Источник.Дата;				
					Движение.ЗаказКлиента = ОбъектРасчетов;
					Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
					Движение.Процент = СтрокаМенеджер.Процент;		
					Движение.СуммаОплачено = Источник.СуммаДокумента * СтрокаМенеджер.Процент;
						
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры //-- БаженоваЕО 30.01.2026	

#КонецОбласти