#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Документы_ОбработкаПроведения

//++ БаженоваЕО 30.01.2026 ПРД.18
Процедура cbr_ДобавитьДвиженияcbr_ОплатаОтгрузкаПоМенеджерамОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Движения = Источник.Движения.cbr_ОплатаОтгрузкаПоМенеджерам;
	Движения.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Для Каждого Стр Из Источник.cbr_ТЧПересечениеМенеджеров Цикл
			Движение = Движения.Добавить();
			Движение.Регистратор = Источник.Ссылка;
			Движение.Период = Источник.Дата;
			Движение.РеализацияТоваровУслуг = Источник.Ссылка; 
			Движение.ЗаказКлиента = Источник.ЗаказКлиента;
			Движение.ФизическоеЛицо = Стр.ФизическоеЛицо;
			Движение.Процент = Стр.Процент;
			Движение.СуммаОтгружено = Источник.СуммаДокумента * Стр.Процент/100;
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
	
		Для Каждого Стр Из Источник.РасшифровкаПлатежа Цикл
			
			ОбъектРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ОбъектРасчетов, "Объект");
			НайтиТабличнуюЧасть = ОбъектРасчетов.Метаданные().ТабличныеЧасти.Найти("cbr_ТЧПересечениеМенеджеров");
		
			Если НайтиТабличнуюЧасть <> Неопределено Тогда
				
				Для каждого СтрокаМенеджер Из ОбъектРасчетов.cbr_ТЧПересечениеМенеджеров Цикл
					
					Если СтрокаМенеджер.Процент <> 0 Тогда
						Если ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
							
							Движение = Движения.Добавить();
							Движение.Регистратор = Источник.Ссылка;
							Движение.Период = Источник.Дата;				
							Движение.РеализацияТоваровУслуг = ОбъектРасчетов;
							Движение.ЗаказКлиента = ОбъектРасчетов.ЗаказКлиента;
							Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
							Движение.Процент = СтрокаМенеджер.Процент;	
							Движение.СуммаОплачено = Источник.СуммаДокумента * СтрокаМенеджер.Процент/100;
							
						ИначеЕсли ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
							
							Движение = Движения.Добавить();
							Движение.Регистратор = Источник.Ссылка;
							Движение.Период = Источник.Дата;				
							Движение.ЗаказКлиента = ОбъектРасчетов;
							Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
							Движение.Процент = СтрокаМенеджер.Процент;		
							Движение.СуммаОплачено = Источник.СуммаДокумента * СтрокаМенеджер.Процент/100;
								
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры //-- БаженоваЕО 30.01.2026	

//++АшаеваАН 13.02.26 СКЛ.3
Процедура cbr_ДобавитьДвиженияcbr_ТоварыКПеремещениюОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Движения = Источник.Движения.cbr_ТоварыКПеремещению;
	Движения.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
		 Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Склад, "cbr_СкладРаспределения") Тогда
			Для Каждого Стр Из Источник.Товары Цикл
				Движение = Движения.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Регистратор = Источник.Ссылка;
				Движение.Период = Источник.Дата;
				Движение.ПТУ = Источник.Ссылка;
				Движение.Номенклатура = Стр.Номенклатура;
				Движение.Характеристика = Стр.Характеристика;
				Движение.КоличествоКПеремещению = Стр.КоличествоУпаковок;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //--АшаеваАН 13.02.26 СКЛ.3

#КонецОбласти