#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Документы_ОбработкаПроведения

//++ БаженоваЕО 30.01.2026 ПРД.18
Процедура cbr_ДобавитьДвиженияcbr_ОплатаОтгрузкаПоМенеджерамОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Движения = Источник.Движения.cbr_ОплатаОтгрузкаПоМенеджерам;
	Движения.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Для Каждого Стр Из Источник.cbr_ТЧПересечениеМенеджеров Цикл
			Движение = Движения.Добавить();
			Движение.Регистратор = Источник.Ссылка;
			Движение.Период = Источник.Дата;
			Движение.РеализацияТоваровУслуг = Источник.Ссылка; 
			Движение.ЗаказКлиента = Источник.ЗаказКлиента;
			Движение.ФизическоеЛицо = Стр.ФизическоеЛицо;
			Движение.Процент = Стр.Процент;
			Движение.СуммаОтгружено = Источник.СуммаДокумента * Стр.Процент/100;
		КонецЦикла;
	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
	
		Для Каждого Стр Из Источник.РасшифровкаПлатежа Цикл
			
			ОбъектРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ОбъектРасчетов, "Объект");
			Если ОбъектРасчетов <> Неопределено Тогда
				НайтиТабличнуюЧасть = ОбъектРасчетов.Метаданные().ТабличныеЧасти.Найти("cbr_ТЧПересечениеМенеджеров");
			КонецЕсли;
			
			Если НайтиТабличнуюЧасть <> Неопределено Тогда
				
				Для каждого СтрокаМенеджер Из ОбъектРасчетов.cbr_ТЧПересечениеМенеджеров Цикл
					
					Если СтрокаМенеджер.Процент <> 0 Тогда
						Если ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
							
							Движение = Движения.Добавить();
							Движение.Регистратор = Источник.Ссылка;
							Движение.Период = Источник.Дата;				
							Движение.РеализацияТоваровУслуг = ОбъектРасчетов;
							Движение.ЗаказКлиента = ОбъектРасчетов.ЗаказКлиента;
							Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
							Движение.Процент = СтрокаМенеджер.Процент;	
							Движение.СуммаОплачено = Источник.СуммаДокумента * СтрокаМенеджер.Процент/100;
							
						ИначеЕсли ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
							
							Движение = Движения.Добавить();
							Движение.Регистратор = Источник.Ссылка;
							Движение.Период = Источник.Дата;				
							Движение.ЗаказКлиента = ОбъектРасчетов;
							Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
							Движение.Процент = СтрокаМенеджер.Процент;		
							Движение.СуммаОплачено = Источник.СуммаДокумента * СтрокаМенеджер.Процент/100;
								
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры //-- БаженоваЕО 30.01.2026	

//++ БаженоваЕО 03.02.2026 СКЛ.4
Процедура cbr_ДобавитьДвиженияcbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Движения = Источник.Движения.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке;
	Движения.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") 
		И Источник.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		
		Для Каждого Стр Из Источник.Товары Цикл
			Движение = Движения.Добавить();
			Движение.Период = Источник.Дата;
			Движение.Регистратор = Источник.Ссылка;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Операция = Перечисления.ВидыДоставки.СоСклада;
			Движение.Распоряжение = Источник.Ссылка;
			Движение.Номенклатура = Стр.Номенклатура;	
			Движение.Характеристика = Стр.Характеристика; 
			Движение.Серия = Стр.Серия;
			Движение.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ЕдиницаИзмерения");
			Движение.Количество = Стр.Количество;
		КонецЦикла;

	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику") 
		И Источник.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада Тогда

		Для Каждого Стр Из Источник.Товары Цикл
			Движение = Движения.Добавить();
			Движение.Период = Источник.Дата;
			Движение.Регистратор = Источник.Ссылка;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Операция = Перечисления.ВидыДоставки.НаСклад;
			Движение.Распоряжение = Источник.Ссылка;
			Движение.Номенклатура = Стр.Номенклатура;	
			Движение.Характеристика = Стр.Характеристика;
			Движение.Назначение = Стр.Назначение;
			Движение.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ЕдиницаИзмерения");
			Движение.Количество = Стр.Количество;
		КонецЦикла;

	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаданиеНаПеревозку")
		И Источник.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.cbr_НеУчаствуемВДоставке Тогда

		Для Каждого Стр Из Источник.Распоряжения Цикл
			ТекущееРаспоряжение = Стр.Распоряжение;
			
			Для Каждого СтрокаТЧРаспоряжения Из ТекущееРаспоряжение.Товары Цикл
				Движение = Движения.Добавить();
				Движение.Период = Источник.Дата;
				Движение.Регистратор = Источник.Ссылка;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Операция = Источник.Операция;
				Движение.Распоряжение = ТекущееРаспоряжение;
				Движение.Номенклатура = СтрокаТЧРаспоряжения.Номенклатура;	
				Движение.Характеристика = СтрокаТЧРаспоряжения.Характеристика;
				Движение.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧРаспоряжения.Номенклатура, 
				"ЕдиницаИзмерения");
				Движение.Количество = СтрокаТЧРаспоряжения.Количество;
				
				Если ТипЗнч(ТекущееРаспоряжение) = Тип("ДокументОбъект.ЗаказКлиента") Тогда	
					Движение.Серия = СтрокаТЧРаспоряжения.Серия;
				ИначеЕсли ТипЗнч(ТекущееРаспоряжение) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
					Движение.Назначение = СтрокаТЧРаспоряжения.Назначение;
				КонецЕсли;
				
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //-- БаженоваЕО 03.02.2026 СКЛ.4

//++АшаеваАН 13.02.26 СКЛ.3
Процедура cbr_ДобавитьДвиженияТоварыКПеремещениюОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Источник.Метаданные().ПолноеИмя());
	Движения = Источник.Движения.cbr_ТоварыКПеремещению;
	Движения.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
		 Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Склад, "cbr_СкладРаспределения") Тогда	
		 		 	
			Для Каждого Стр Из Источник.Товары Цикл
				Движение = Движения.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Регистратор = Источник.Ссылка;
				Движение.Период = Источник.Дата;
				Движение.ПТУ = Источник.Ссылка;
				Движение.Номенклатура = Стр.Номенклатура;
				Движение.Характеристика = Стр.Характеристика;
				Движение.КоличествоКПеремещению = Стр.КоличествоУпаковок;
				Движение.Склад = Источник.Склад;
				Движение.Организация = Источник.Организация;
			КонецЦикла;
		 КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		 
		 Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.СкладОтправитель, "cbr_СкладРаспределения")
		 И ЗначениеЗаполнено(Источник.ЗаказНаПеремещение) Тогда
			Для Каждого Стр Из Источник.Товары Цикл
				Если ЗначениеЗаполнено(Стр.cbr_ПТУ) Тогда
					Движение = Движения.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Регистратор = Источник.Ссылка;
					Движение.Период = Источник.Дата;
					Движение.ПТУ = Стр.cbr_ПТУ;
					Движение.Номенклатура = Стр.Номенклатура;
					Движение.Характеристика = Стр.Характеристика;
					Движение.КоличествоКПеремещению = Стр.КоличествоУпаковок;
					Движение.Склад = Источник.СкладОтправитель;
					Движение.Организация = Источник.Организация;
				КонецЕсли;
			КонецЦикла;
			
			Движения.БлокироватьДляИзменения = Истина;
   			Движения.Записать();
   			
   			Запрос = Новый Запрос();
		   	Запрос.Текст =
		    "ВЫБРАТЬ
		    |	cbr_ТоварыКПеремещению.ПТУ КАК ПТУ
		    |ПОМЕСТИТЬ втПТУ
		    |ИЗ
		    |	РегистрНакопления.cbr_ТоварыКПеремещению КАК cbr_ТоварыКПеремещению
		    |ГДЕ
		    |	cbr_ТоварыКПеремещению.Регистратор = &Регистратор
		    |СГРУППИРОВАТЬ ПО
		    |	cbr_ТоварыКПеремещению.ПТУ
		    |;
		    |
		    |////////////////////////////////////////////////////////////////////////////////
		    |ВЫБРАТЬ
		    |	cbr_ТоварыКПеремещениюОстатки.Номенклатура КАК Номенклатура,
		    |	cbr_ТоварыКПеремещениюОстатки.Характеристика КАК Характеристика,
		    |	-cbr_ТоварыКПеремещениюОстатки.КоличествоКПеремещениюОстаток КАК Количество,
		    |	cbr_ТоварыКПеремещениюОстатки.ПТУ КАК ПТУ
		    |ИЗ
		    |	РегистрНакопления.cbr_ТоварыКПеремещению.Остатки(, ПТУ В
		    |		(ВЫБРАТЬ
		    |			втПТУ.ПТУ КАК ПТУ
		    |		ИЗ
		    |			втПТУ КАК втПТУ)) КАК cbr_ТоварыКПеремещениюОстатки,
		    |	втПТУ КАК втПТУ
		    |ГДЕ
		    |	cbr_ТоварыКПеремещениюОстатки.КоличествоКПеремещениюОстаток < 0";
		    
		    Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
		    
		    Результат = Запрос.Выполнить();
		   			
   			Если НЕ Результат.Пустой() Тогда
       			 Отказ = Истина;
   				 Выборка = Результат.Выбрать();
        			Пока Выборка.Следующий() Цикл
        				ТекстСообщения = НСтр("ru = 'Недостаточно номенклатуры %Номенклатура% в количестве %Количество% по документу %ПТУ%.'"); 
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", Выборка.Номенклатура); 
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Выборка.Количество); 
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПТУ%", Выборка.ПТУ); 
		
						ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
						Метаданные.Документы.ПеремещениеТоваров,, ТекстСообщения);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
      				КонецЦикла;  
   			КонецЕсли;
   			 
   			Если Отказ Тогда
       			 Возврат;
    		КонецЕсли;

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //--АшаеваАН 13.02.26 СКЛ.3

#КонецОбласти
