
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ)
	
	//++ cbr-larkovgeorg 03.03.2026 ПРЗ.33
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Если Не ЭтоНовый() Тогда
			
			Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Номер") = Номер Тогда
				ТекстСообщения = НСтр("ru = 'Изменять номер уже существующей серии запрещено. Обратитесь к администратору'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры//-- cbr-larkovgeorg 03.03.2026 ПРЗ.33

&После("ПриЗаписи")
Процедура cbr_ПриЗаписи(Отказ)
	
 	//++ cbr-larkovgeorg 03.03.2026 ПРЗ.33
	Если Не Отказ Тогда

		ЭтоНовыйЭлемент = Ложь;
		Если ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовыйЭлемент) Тогда
			
			ОтменитьКонтрольНомераПоШаблону = Ложь;
			ДополнительныеСвойства.Свойство("ОтменитьКонтрольНомераПоШаблону", ОтменитьКонтрольНомераПоШаблону);
			Если ОтменитьКонтрольНомераПоШаблону = Истина Тогда
				Возврат;
			КонецЕсли;
			
			Если УжеЕстьТакойНомер(Ссылка, Номер) Тогда
				ТекстСообщения = НСтр("ru='Уже существует серия с номером ""%1"". Запись отменена.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Номер);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				Возврат;
			КонецЕсли;
			
			Если ЭтоНовыйЭлемент И ЗначениеЗаполнено(Номер) И ЗначениеЗаполнено(ВидНоменклатуры) Тогда
				РегистрыСведений.НомераСерийПоВидам.ЗаписатьНовыйНомер(Номер, ВидНоменклатуры, Отказ, Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры//-- cbr-larkovgeorg 03.03.2026 ПРЗ.33

Функция УжеЕстьТакойНомер(ЭтаСсылка, НомерСерии)
	
	//++ cbr-larkovgeorg 03.03.2026 ПРЗ.33
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Номер = &НомерСерии
		|	И СерииНоменклатуры.Ссылка <> &ЭтаСсылка";
	
	Запрос.УстановитьПараметр("НомерСерии", НомерСерии);
	Запрос.УстановитьПараметр("ЭтаСсылка", ЭтаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

	
КонецФункции//-- cbr-larkovgeorg 03.03.2026 ПРЗ.33

#КонецОбласти
