#Если Не ТолстыйКлиентУправляемоеПриложение И НЕ ТолстыйКлиентОбычноеПриложение  Тогда

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)		
	УсловияОтбора = Новый Структура();
	
	Если ЗначениеЗаполнено(Объект.ВидЦены) Тогда
		УсловияОтбора.Вставить("ВидЦены", Объект.ВидЦены);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураОтборы) Тогда
		УсловияОтбора.Вставить("Номенклатура", НоменклатураОтборы.ВыгрузитьЗначения());	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.cbr_ПрайсРеестраПродажТД.Форма", ПараметрыФормы,,Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументУстановкаЦен(Команда)
	СоздатьДокументУстановкаЦенНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьАктуальноеХранилищеЗначений(ВидЦены)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаЦенНоменклатурыВидыЦен.ВидЦены КАК ВидЦены,
		|	УстановкаЦенНоменклатурыВидыЦен.НастройкиКомпоновкиДанных КАК НастройкиКомпоновкиДанных,
		|	УстановкаЦенНоменклатурыВидыЦен.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК УстановкаЦенНоменклатурыВидыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыВидыЦен.ВидЦены = &ВидЦены
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НастройкиКомпоновкиДанных;	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура СоздатьДокументУстановкаЦенНаСервере()
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", Объект.ДатаЗаписиПлановойЦены);
	СтруктураПараметров.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	СтруктураПараметров.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыУстановокЦенНоменклатуры.Согласован"));
	СтруктураПараметров.Вставить("ВидЦены", Объект.ВидЦены);
	СтруктураПараметров.Вставить("НастройкиКомпоновкиДанных", ПолучитьАктуальноеХранилищеЗначений(Объект.ВидЦены));
	
	ТаблицаКЗаполнению = Объект.ТаблицаРасчетов.Выгрузить(,"Номенклатура, ХарактеристикаЦО, ВидЦены, ПлавноваяЦенаБудущегоКвартала");
	ТаблицаКЗаполнению.Очистить();
	ТаблицаКЗаполнению.Колонки.Добавить("ЦенаИзмененаВручную");
	ТаблицаКЗаполнению.Колонки.Добавить("Валюта");
	
	ВалютаЦены = ПредопределенноеЗначение("Справочник.cbr_ПредопределенныеЗначенияКонстант.ВалютаРубль");
	Если ЗначениеЗаполнено(ВалютаЦены) Тогда
		ВалютаЦены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВалютаЦены, "Значение")
	Иначе
		ВызватьИсключение "Не установлено предопределенное значение";
	КонецЕсли;
	
	Для каждого ЭлементТЧ из Объект.ТаблицаРасчетов Цикл
		Если ЭлементТЧ.ПлавноваяЦенаБудущегоКвартала > 0 Тогда
			НоваяСтрока = ТаблицаКЗаполнению.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЧ);
			
			НоваяСтрока.ВидЦены = Объект.ВидЦены;
			НоваяСтрока.ЦенаИзмененаВручную = Истина;
			НоваяСтрока.Валюта = ВалютаЦены;
		КонецЕсли;
	КонецЦикла;
	СтруктураПараметров.Вставить("ТаблицаРасчетов", ТаблицаКЗаполнению);
	
	Обработки.cbr_РеестрТМЦ.СоздатьДокумент(СтруктураПараметров);
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОтборов()
	Результат = Новый Структура; 
	
	ЭлементыОтборов = Новый Массив;	
	ЭлементыОтборов.Добавить("НоменклатураОтборы");
	ЭлементыОтборов.Добавить("Объект.ДатаЗаписиПлановойЦены");
	ЭлементыОтборов.Добавить("Объект.ПризнакВключенияВДействующиеТехКарты");
	ЭлементыОтборов.Добавить("Объект.Статус");
	ЭлементыОтборов.Добавить("Объект.ТранспортнаяЧистаяЦена");
	ЭлементыОтборов.Добавить("Объект.ВидЦены");
		
	Для каждого ИмяЭлементаКДобавлению из ЭлементыОтборов Цикл
		
		Если ЗначениеЗаполнено(СтрНайти(ИмяЭлементаКДобавлению,"Объект")) Тогда
			ИмяЭлементаДляПоиска = Прав(ИмяЭлементаКДобавлению, СтрДлина(ИмяЭлементаКДобавлению) - СтрНайти(ИмяЭлементаКДобавлению,"."));
			ТекущийЭлементКДобавлению = ЭтотОбъект["Объект"][ИмяЭлементаДляПоиска];
		Иначе
			ТекущийЭлементКДобавлению = ЭтотОбъект[ИмяЭлементаКДобавлению];
			ИмяЭлементаДляПоиска = ИмяЭлементаКДобавлению;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущийЭлементКДобавлению) Тогда
			Результат.Вставить(ИмяЭлементаДляПоиска, ТекущийЭлементКДобавлению);
		Иначе
			Результат.Вставить(ИмяЭлементаДляПоиска, Неопределено);
		КонецЕсли;	
	КонецЦикла;
	
	Если Результат.Свойство("ДатаЗаписиПлановойЦены") Тогда
		Результат.Вставить("КонецПериода", Результат.ДатаЗаписиПлановойЦены);
		Результат.Вставить("НачалоПериода", НачалоМесяца(Результат.ДатаЗаписиПлановойЦены - 365 * 86400));
	КонецЕсли;
	
	Результат.Вставить("ТаблицаРасчетов", Объект.ТаблицаРасчетов.Выгрузить());
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	Объект.ТаблицаРасчетов.Очистить();
	
	ПараметрыЗапроса = ПолучитьПараметрыОтборов();	
		
	Обработки.cbr_РеестрТМЦ.ПолучениеДанныхКЗаполениюИзСКД(ПараметрыЗапроса);
	
	Объект.ТаблицаРасчетов.Загрузить(ПараметрыЗапроса.ТаблицаРасчетов);
КонецПроцедуры

#КонецОбласти

#КонецЕсли