#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

&Перед("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.cbr_НомерПаллета) И Не ЗначениеЗаполнено(Строка.cbr_Уровень) Тогда

			Отказ = Истина;
			Сообщение = СтрШаблон("В строке %1 не заполнено колонка «Уровень»!", Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(Сообщение);

		КонецЕсли;
	КонецЦикла;
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12
КонецПроцедуры
#КонецОбласти

#КонецЕсли