#Область СлужебныеПроцедурыИФункции
&После("ПриСозданииНаСервере")
&НаСервере
Процедура cbr_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ cbr-larkovgeorg 12.02.2026 ПРД12
	Если Параметры.Свойство("АгентскоеВознаграждение") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Ссылка КАК Ссылка,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.ПометкаУдаления КАК ПометкаУдаления,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Номер КАК Номер,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Дата КАК Дата,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Проведен КАК Проведен,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Сумма КАК Сумма,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Организация КАК Организация,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Ссылка = ДокументВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента.ВерсияСоглашения КАК
		|		АктуальныйГрафик,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.НаименованиеВерсии КАК НаименованиеВерсии,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.НомерДополнительногоСоглашения КАК НомерДополнительногоСоглашения,
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ВерсияСоглашенияКоммерческийДоговор КАК ДокументВерсияСоглашенияКоммерческийДоговор
		|ГДЕ
		|	ДокументВерсияСоглашенияКоммерческийДоговор.Организация = &Организация
		|	И ДокументВерсияСоглашенияКоммерческийДоговор.Контрагент = &Контрагент";
		
		Список.ТекстЗапроса = ТекстЗапроса;
		Список.ОсновнаяТаблица = "Документ.ВерсияСоглашенияКоммерческийДоговор";
		Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Отбор.Организация);
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Отбор.Контрагент);
	
	КонецЕсли;
	//-- cbr-larkovgeorg 12.02.2026 ПРД12
КонецПроцедуры
#КонецОбласти
