
&ИзменениеИКонтроль("ПриЗаписиДокументаРегистрацияДанныхПервичныхДокументов")
Процедура П3_ПриЗаписиДокументаРегистрацияДанныхПервичныхДокументов(Источник, Отказ)
	Перем НомерДокумента, ДатаДокумента;
	 
	Если Источник.ОбменДанными.Загрузка = Истина
		И Источник.ДополнительныеСвойства.Свойство("РегистрироватьДанныеПервичныхДокументов")
		И Источник.ДополнительныеСвойства.РегистрироватьДанныеПервичныхДокументов = Ложь Тогда
		// Регистр ДанныеПервичныхДокументов по сути содержит в себе данные документа.
		// При обменах формирование регистра также необходимо выполнить. Без этого данные не будут корректными.
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ссылка = Источник.Ссылка;
	МетаданныеДокумента = Источник.Метаданные();
	
	ИменаРеквизитов = "Номер, Дата";
	
	ЭтоДокументИнтеркампани     = ОбщегоНазначения.ЕстьРеквизитОбъекта("РасчетыЧерезОтдельногоКонтрагента", МетаданныеДокумента);
	ЕстьНомерВходящегоДокумента = ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерВходящегоДокумента", МетаданныеДокумента);
	ЕстьПредставлениеНомера     = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеНомера", МетаданныеДокумента);
	ЕстьДатаВходящегоДокумента  = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаВходящегоДокумента", МетаданныеДокумента); 
	ЕстьРеквизитИсправление     = ОбщегоНазначения.ЕстьРеквизитОбъекта("Исправление", МетаданныеДокумента);
	ЕстьНомерКомиссионера       = ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерКомиссионера", МетаданныеДокумента);
	ЕстьДатаКомиссионера        = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаКомиссионера", МетаданныеДокумента);
	
	ЕстьРеквизитХозяйственнаяОперация = ОбщегоНазначения.ЕстьРеквизитОбъекта("ХозяйственнаяОперация", МетаданныеДокумента); 
	ЕстьРеквизитОснованиеДата         = ОбщегоНазначения.ЕстьРеквизитОбъекта("ОснованиеДата", МетаданныеДокумента); 
	ЕстьРеквизитОснованиеНомер        = ОбщегоНазначения.ЕстьРеквизитОбъекта("ОснованиеНомер", МетаданныеДокумента); 
	
	Если ?(ЭтоДокументИнтеркампани, Источник["РасчетыЧерезОтдельногоКонтрагента"], Истина) 
		 И ЕстьНомерВходящегоДокумента Тогда
		 
		ИменаРеквизитов = ИменаРеквизитов + ", НомерВходящегоДокумента";
		Если ЕстьДатаВходящегоДокумента Тогда
			ИменаРеквизитов = ИменаРеквизитов + ", ДатаВходящегоДокумента";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьПредставлениеНомера Тогда
		ИменаРеквизитов = ИменаРеквизитов + ", ПредставлениеНомера";
	КонецЕсли;
	
	Реквизиты = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Реквизиты, Источник);
	
	// Установка управляемой блокировки.
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ДанныеПервичныхДокументов");
	ЭлементБлокировки.УстановитьЗначение("Документ", Ссылка);
	БлокировкаДанных.Заблокировать();
	
	НомерДокумента	= "";
	ДатаДокумента	= '00010101';
	
	Если ЕстьНомерКомиссионера И ЗначениеЗаполнено(Источник.НомерКомиссионера)
		И ЕстьДатаКомиссионера И ЗначениеЗаполнено(Источник.ДатаКомиссионера) Тогда
		НомерДокумента = Источник.НомерКомиссионера;
		ДатаДокумента  = Источник.ДатаКомиссионера;
	ИначеЕсли ЕстьРеквизитХозяйственнаяОперация
		И КомиссионнаяТорговляСервер.РеализацияЧерезКомиссионера(Источник.ХозяйственнаяОперация)
		И ЕстьРеквизитОснованиеНомер И ЗначениеЗаполнено(Источник.ОснованиеНомер)
		И ЕстьРеквизитОснованиеДата И ЗначениеЗаполнено(Источник.ОснованиеДата) Тогда
		НомерДокумента = Источник.ОснованиеНомер;
		ДатаДокумента  = Источник.ОснованиеДата;
	ИначеЕсли Реквизиты.Свойство("НомерВходящегоДокумента") Тогда
		НомерДокумента	= СокрЛП(Реквизиты.НомерВходящегоДокумента);
		Если Реквизиты.Свойство("ДатаВходящегоДокумента") Тогда
			ДатаДокумента = Реквизиты.ДатаВходящегоДокумента;
		КонецЕсли;
	ИначеЕсли Реквизиты.Свойство("ПредставлениеНомера") Тогда
		НомерДокумента	= СокрЛП(Реквизиты.ПредставлениеНомера);
		ДатаДокумента	= Реквизиты.Дата;
	Иначе
		НомерДокумента	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Ложь, Истина);
		#Вставка
		// НАЧАЛО Османов Н.М. 30.01.2026 
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураВыданныйАванс") Тогда
			НомерДокумента	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина);
		КонецЕсли;
		// КОНЕЦ Османов Н.М. 30.01.2026
		#КонецВставки 
		ДатаДокумента	= Реквизиты.Дата;
	КонецЕсли;
	
	ОрганизацииКРегистрации = Новый Соответствие();
	ДополнитьОрганизацииКРегистрации(Источник, МетаданныеДокумента, ОрганизацииКРегистрации);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СторнируемыйДокумент", МетаданныеДокумента) 
		И ЗначениеЗаполнено(Источник["СторнируемыйДокумент"]) Тогда
		СторнируемыйДокументОбъект = Источник["СторнируемыйДокумент"].ПолучитьОбъект();
		ДополнитьОрганизацииКРегистрации(СторнируемыйДокументОбъект, СторнируемыйДокументОбъект.Метаданные(), ОрганизацииКРегистрации);
	КонецЕсли;
	
	НаборЗаписейРегистра = РегистрыСведений.ДанныеПервичныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.Документ.Установить(Ссылка);
	
	Для каждого КлючИЗначение Из ОрганизацииКРегистрации Цикл
		
		Организация = КлючИЗначение.Ключ;
		ИмяРеквизита = КлючИЗначение.Значение;
		
		НоваяЗапись = НаборЗаписейРегистра.Добавить();
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Документ    = Ссылка;
		
		Если ЭтоДокументИнтеркампани И ИмяРеквизита = "Организация" Тогда
			НоваяЗапись.Номер    = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер, Истина, Истина);
			НоваяЗапись.Дата     = Реквизиты.Дата;
		Иначе
			НоваяЗапись.Номер    = НомерДокумента;
			НоваяЗапись.Дата     = ДатаДокумента;
		КонецЕсли;
		
		НоваяЗапись.НомерРегистратора = Реквизиты.Номер;
		НоваяЗапись.ДатаРегистратора = Реквизиты.Дата;
		
	КонецЦикла;
	
	НаборЗаписейРегистра.Записать(Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
