
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Номенклатура КАК Номенклатура,
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Характеристика КАК Характеристика,
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Количество КАК Количество
		|ИЗ
		|	Документ.cbr_ОперацияСоглашения.СписокНоменклатура КАК cbr_ОперацияСоглашенияСписокНоменклатура
		|ГДЕ
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Добавить();
		
		Если Действие = ПредопределенноеЗначение("Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Приход") Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
		ИначеЕсли Действие = ПредопределенноеЗначение("Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Расход") Тогда 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаОкончания;
		КонецЕсли;
		
		
		Движение.Соглашение = Соглашение;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.ДатаНачала = Дата;
	КонецЦикла;
	
	Ответ = Ложь;
	
	Если Не (РольДоступна("cbr_ЗаписьЗаказаКлиентаСОтрицательнымиОстатками") или РольДоступна("ПолныеПрава")) Тогда
		Ответ = ПроверитьРегистрНаОтрицание();
	КонецЕсли;
	
	Если Ответ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьРегистрНаОтрицание()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОперацияСоглашенияСписокНоменклатура.Номенклатура КАК Номенклатура,
		|	ОперацияСоглашенияСписокНоменклатура.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	Документ.cbr_ОперацияСоглашения.СписокНоменклатура КАК ОперацияСоглашенияСписокНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
		|	-cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток КАК Превышение,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Характеристика.Представление КАК ХарактеристикаПредставление
		|ИЗ
		|	РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.Остатки(&МоментВремени, (Номенклатура, Характеристика) В
		|		(ВЫБРАТЬ
		|			ВТТЧ.Номенклатура,
		|			ВТТЧ.Характеристика
		|		ИЗ
		|			ВТТЧ КАК ВТТЧ)
		|	И Соглашение = &Соглашение
		|	И ДатаНачала = &ДатаНачала) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстатки
		|ГДЕ
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Дата));
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	Запрос.УстановитьПараметр("ДатаНачала", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"" на количество ""%3""'"),
			ВыборкаДетальныеЗаписи.НоменклатураПредставление, ВыборкаДетальныеЗаписи.ХарактеристикаПредставление, ВыборкаДетальныеЗаписи.Превышение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
	Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
