#Область СлужебныеПроцедурыИФункции
&ИзменениеИКонтроль("УчетныеМеханизмыКонфигурации")
Функция cbr_УчетныеМеханизмыКонфигурации() Экспорт

	МеханизмыКонфигурации = Новый Структура;

	МеханизмыКонфигурации.Вставить("АдресныйСклад", "СкладыСервер");
	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("Бюджетирование", "БюджетированиеСервер");
	//-- НЕ УТ
	МеханизмыКонфигурации.Вставить("Взаиморасчеты", "ВзаиморасчетыСервер");
	МеханизмыКонфигурации.Вставить("ВнутреннееТовародвижение", "ВнутреннееТовародвижение");
	//++ НЕ УТКА
	МеханизмыКонфигурации.Вставить("ВнутренняяПереработка", "ВнутренняяПереработкаСервер");
	МеханизмыКонфигурации.Вставить("ДоступностьРабочихЦентров", "УчетДоступностиРабочихЦентров");
	//-- НЕ УТКА
	МеханизмыКонфигурации.Вставить("Закупки", "Закупки");
	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("КонтрольЛимитовБюджетирования", "ЛимитыПоДаннымБюджетированияСервер");
	//-- НЕ УТ

	//++ НЕ УТКА
	МеханизмыКонфигурации.Вставить("МеждународныйУчет", "МеждународныйУчетПроведениеСервер");
	//-- НЕ УТКА

	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("НематериальныеАктивы", "НематериальныеАктивыСервер");
	//-- НЕ УТ

	//++ НЕ УТКА
	МеханизмыКонфигурации.Вставить("НСИПроизводства", "УправлениеДаннымиОбИзделиях");
	//-- НЕ УТКА
	МеханизмыКонфигурации.Вставить("Обеспечение", "РаспределениеЗапасовДвижения");
	МеханизмыКонфигурации.Вставить("ОборотныеРегистрыУправленческогоУчета", "УправленческийУчетПроведениеСервер");
	МеханизмыКонфигурации.Вставить("ОперативныйУчетТоваровОрганизаций", "ЗапасыСервер");
	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("ОсновныеСредства", "ОсновныеСредстваСервер");
	МеханизмыКонфигурации.Вставить("ПередачаВПереработку", "ПереработкаНаСтороне");
	//-- НЕ УТ
	МеханизмыКонфигурации.Вставить("ПередачаНаОтветхранение", "ПередачаНаОтветхранение");
	МеханизмыКонфигурации.Вставить("ПланированиеЗапасов", "Планирование");
	МеханизмыКонфигурации.Вставить("ПланированиеКонтрольДенежныхСредств", "ЛимитыРасходованияДенежныхСредствСервер");
	МеханизмыКонфигурации.Вставить("ПодарочныеСертификаты", "ПодарочныеСертификатыСервер");
	//++ НЕ УТКА
	МеханизмыКонфигурации.Вставить("ПриемВПереработку", "ДавальческаяСхема");
	//-- НЕ УТКА
	МеханизмыКонфигурации.Вставить("ПриемНаОтветхранение", "ПриемНаОтветхранение");
	МеханизмыКонфигурации.Вставить("Продажи", "Продажи");
	МеханизмыКонфигурации.Вставить("ОформлениеОтчетовКомитентуОЗакупках", "РегистрыНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках");
	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("Производство", "ПроизводствоСервер");
	//-- НЕ УТ

	МеханизмыКонфигурации.Вставить("РетроБонусы", "РетроБонусыСервер");

	//++ НЕ УТКА
	МеханизмыКонфигурации.Вставить("СтруктураЗаказа", "СтруктураЗаказаПроведениеДокументов");
	//-- НЕ УТКА
	МеханизмыКонфигурации.Вставить("РасчетыСПодотчетниками", "РегистрыНакопления.ДенежныеСредстваУПодотчетныхЛиц");
	МеханизмыКонфигурации.Вставить("РеестрДокументов", "РегистрыСведений.РеестрДокументов");
	МеханизмыКонфигурации.Вставить("ИсправлениеДокументов", "ИсправлениеДокументов");
	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("РезервыПоСомнительнымДолгам", "НачислениеСписаниеРезервовПоСомнительнымДолгамСервер");
	МеханизмыКонфигурации.Вставить("РезервыПредстоящихРасходов", "РезервыПредстоящихРасходов");
	//-- НЕ УТ
	МеханизмыКонфигурации.Вставить("СебестоимостьИПартионныйУчет", "ПартионныйУчетСервер");
	МеханизмыКонфигурации.Вставить("СерийныйУчет", "РегистрыНакопления.ДвиженияСерийТоваров");
	МеханизмыКонфигурации.Вставить("СуммыДокументовВВалютахУчета", "РегистрыСведений.СуммыДокументовВВалютахУчета");
	МеханизмыКонфигурации.Вставить("УправлениеАссортиментом", "АссортиментСервер");
	//++ НЕ УТКА
	МеханизмыКонфигурации.Вставить("УправлениеРемонтами", "УправлениеРемонтами");
	//-- НЕ УТКА
	МеханизмыКонфигурации.Вставить("УчетДенежныхСредств", "ДенежныеСредстваСервер");
	МеханизмыКонфигурации.Вставить("УчетДоходовРасходов", "ДоходыИРасходыСервер");
	МеханизмыКонфигурации.Вставить("УчетИмпорта", "УчетИмпорта");
	МеханизмыКонфигурации.Вставить("УчетНДС", "УчетНДСУП");
	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("УчетНЗП", "УчетНЗП");
	//-- НЕ УТ
	МеханизмыКонфигурации.Вставить("УчетПрочихАктивовПассивов", "ПрочиеАктивыПассивыСервер");
	МеханизмыКонфигурации.Вставить("УчетРабот", "РегистрыНакопления.МатериалыИРаботыВПроизводстве");
	МеханизмыКонфигурации.Вставить("ФинансовыеИнструменты", "РегистрыНакопления.РасчетыПоФинансовымИнструментам");
	МеханизмыКонфигурации.Вставить("ФинансовыйРезультат", "РегистрыНакопления.ФинансовыеРезультаты");
	МеханизмыКонфигурации.Вставить("ЦеныИСкидки", "Ценообразование");

	//++ НЕ УТ
	МеханизмыКонфигурации.Вставить("ОбесценениеВНА", "ОбесценениеВНАСервер");
	//-- НЕ УТ

	МеханизмыКонфигурации.Вставить("ТМЦВЭксплуатации", "ТМЦВЭксплуатацииСервер");
	
	#Вставка
	//Мохов ++ 06.02.2026
	
	
	
	//Мохов -- 06.02.2026
	#КонецВставки


	ПроведениеДокументовЛокализация.ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации);
	#Область УХ_Встраивание
	ВстраиваниеУХ.ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации);
	#КонецОбласти
	Возврат МеханизмыКонфигурации;

КонецФункции
#КонецОбласти
