#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("НачалоВыбораСоглашенияСКлиентомФрагмент")
Процедура cbr_НачалоВыбораСоглашенияСКлиентомФрагмент(СтруктураПараметров)

	Если Не ЗначениеЗаполнено(СтруктураПараметров.Партнер) Тогда
		Возврат;
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДатаДокумента", СтруктураПараметров.ДатаДокумента);
		ПараметрыФормы.Вставить("Партнер", СтруктураПараметров.Партнер);
		ПараметрыФормы.Вставить("ТолькоТиповые",СтруктураПараметров.ТолькоТиповые);
		ПараметрыФормы.Вставить("ТолькоИспользуемыеВРаботеТП",СтруктураПараметров.ТолькоИспользуемыеВРаботеТП);
		ПараметрыФормы.Вставить("ТекущаяСтрока",СтруктураПараметров.Документ);
		ПараметрыФормы.Вставить("ХозяйственнаяОперация",СтруктураПараметров.ХозяйственнаяОперация);
		ПараметрыФормы.Вставить("ИспользуютсяДоговорыКонтрагентов",СтруктураПараметров.ИспользуютсяДоговорыКонтрагентов);
		ПараметрыФормы.Вставить("КомиссионныеПродажи25",СтруктураПараметров.КомиссионныеПродажи25);
		ПараметрыФормы.Вставить("ОтгрузкаБезПереходаПраваСобственности25",СтруктураПараметров.ОтгрузкаБезПереходаПраваСобственности25);
		ПараметрыФормы.Вставить("ТолькоОперацииПередачи",СтруктураПараметров.ТолькоОперацииПередачи);
		ПараметрыФормы.Вставить("ОперацииПередачиОтгрузки",СтруктураПараметров.ОперацииПередачиОтгрузки);
		
		#Вставка
		//++ БаженоваЕО 10.03.2026 ПРД.21
		ПараметрыФормы.Вставить("Ссылка", СтруктураПараметров.ДанныеФормыСтруктура.Ссылка);
		//-- БаженоваЕО 10.03.2026
		#КонецВставки
		
		ДополнительныйОтбор = Новый Структура;

		Для Каждого ПараметрВыбора Из СтруктураПараметров.Элемент.ПараметрыВыбора Цикл
			ДополнительныйОтбор.Вставить(СтрЗаменить(ПараметрВыбора.Имя, "Отбор.", ""), ПараметрВыбора.Значение);
		КонецЦикла;

		ПараметрыФормы.Вставить("Отбор", ДополнительныйОтбор);

		ОткрытьФорму("Справочник.СоглашенияСКлиентами.ФормаВыбора",
			ПараметрыФормы,
			СтруктураПараметров.Элемент);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
