#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

//++ cba AlopinAS 27.01.26
&После("ОбработкаПроверкиЗаполнения")
Процедура cbr_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив();
	
	Если Клиент и Не ЗначениеЗаполнено(cbr_ОтрасльКонтрагента) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена отрасль контрагента'"));
		Отказ = Истина;
		НепроверяемыеРеквизиты.Добавить("cbr_ОтрасльКонтрагента");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры
//-- cba AlopinAS 27.01.26

#КонецОбласти

#КонецЕсли