#Область ОбработчикиСобытийЭлементовШапкиФормы

//++ cba AlopinAS 27.01.26
&НаКлиенте
Процедура ОтрасльКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Настройки = Новый НастройкиКомпоновкиДанных();
	ГруппаОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.Использование = Истина;
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	Если Объект.Клиент и Не Объект.Поставщик Тогда
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
	ИначеЕсли Объект.Поставщик и Не Объект.Клиент Тогда	
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
	ИначеЕсли Не Объект.Клиент и Не Объект.Поставщик Тогда
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Ложь;
		
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Ложь;
	ИначеЕсли Объект.Поставщик и Объект.Клиент Тогда 
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
		
		Элемент = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Поставщик");
		Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Элемент.Использование = Истина;
		Элемент.ПравоеЗначение = Истина;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);	
	
	СтруктураПараметров = Новый Структура;
	
	ОписаниеВыбора = Новый ОписаниеОповещения("cbr_ОбработкаВыбораОтраслиКонтрагента", ЭтотОбъект, СтруктураПараметров);
	
	ОткрытьФорму("Справочник.cbr_ОтраслиКонтрагентов.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
//-- cba AlopinAS 27.01.26

//++ cba AlopinAS 27.01.26
&НаКлиенте
Процедура cbr_ОбработкаВыбораОтраслиКонтрагента(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Контейнер = Элементы.ОтрасльКонтрагента;
	Если Не Контейнер = Неопределено Тогда
		Объект.cbr_ОтрасльКонтрагента = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры
//-- cba AlopinAS 27.01.26

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗаписатьКонтрагентаПартнера")
&НаСервере
Процедура cbr_ЗаписатьКонтрагентаПартнера()

	СоздатьКонтрагента = КонтрагентПартнера.Пустая();

	Если СоздатьКонтрагента Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		КонтрагентОбъект = КонтрагентПартнера.ПолучитьОбъект();
	КонецЕсли;

	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, КонтрагентОбъект);

	КонтрагентОбъект.Наименование = Объект.Наименование;
	КонтрагентОбъект.НаименованиеПолное        = Объект.НаименованиеПолное;
	КонтрагентОбъект.НаименованиеМеждународное = НаименованиеМеждународное;
	КонтрагентОбъект.НаименованиеВТранскрипции = НаименованиеВТранскрипции;
	КонтрагентОбъект.Партнер                   = Объект.Ссылка;
	КонтрагентОбъект.ЮрФизЛицо                 = ЮрФизЛицо;
	КонтрагентОбъект.ОбособленноеПодразделение = ОбособленноеПодразделение;
	КонтрагентОбъект.СтранаРегистрации         = СтранаРегистрации;
	КонтрагентОбъект.РегистрационныйНомер      = РегистрационныйНомер;
	КонтрагентОбъект.НалоговыйНомер            = НалоговыйНомер;
	КонтрагентОбъект.ИНН                       = ИНН;
	КонтрагентОбъект.ИсторияНаименований.Загрузить(ИсторияНаименований.Выгрузить());
    #Вставка
    //++ Тусеев Н.Ю. 27.01.2026 ПРД2
	КонтрагентОбъект.cbr_КодFO                  = ЭтотОбъект.cbr_КодFO;
    КонтрагентОбъект.cbr_КодBitrix              = ЭтотОбъект.cbr_КодBitrix;	
    //-- Тусеев Н.Ю. 27.01.2026 ПРД2
	#КонецВставки
	Если Не ЗначениеЗаполнено(ГоловнойКонтрагент) И Не ОбособленноеПодразделение Тогда

		Если СоздатьКонтрагента Тогда
			НоваяСсылка = Справочники.Контрагенты.ПолучитьСсылку();
			КонтрагентОбъект.УстановитьСсылкуНового(НоваяСсылка);
			ГоловнойКонтрагент = КонтрагентОбъект.ПолучитьСсылкуНового();
		Иначе
			ГоловнойКонтрагент = КонтрагентПартнера;
		КонецЕсли;

	КонецЕсли;
	КонтрагентОбъект.ГоловнойКонтрагент = ГоловнойКонтрагент;
	ПартнерыИКонтрагенты.ЗаполнитьКонтактнуюИнформациюКонтрагентаПартнера(КонтрагентОбъект, ЭтотОбъект, Объект.КонтактнаяИнформация);
	ПартнерыИКонтрагентыЛокализация.ПередЗаписьюКонтрагентаПартнера(КонтрагентОбъект, ЭтаФорма);
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, КонтрагентОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонтрагентОбъект.Записать();

	КонтрагентПартнера = КонтрагентОбъект.Ссылка;

КонецПроцедуры

&НаСервере
&Перед("ОбработкаПроверкиЗаполненияНаСервере")
Процедура cbr_ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не  ЗначениеЗаполнено(ЭтотОбъект.cbr_КодFO) И Не ЗначениеЗаполнено(ЭтотОбъект.cbr_КодBitrix) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обязательно должен быть заполен один из реквизитов: КодFO или КодBitrix'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.cbr_КодFO) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "cbr_КодBitrix");
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.cbr_КодBitrix) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "cbr_КодFO");
	КонецЕсли;
	
КонецПроцедуры

//++ Тусеев Н.Ю. 04.02.2026 ПРД12
&НаКлиенте
Процедура cbr_КодFOПриИзменении(Элемент)
    Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура cbr_КодBitrixПриИзменении(Элемент)
     Модифицированность = Истина;
КонецПроцедуры //-- Тусеев Н.Ю. 04.02.2026 ПРД12

#КонецОбласти
