#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗаписатьКонтрагентаПартнера")
&НаСервере
Процедура cbr_ЗаписатьКонтрагентаПартнера()

	СоздатьКонтрагента = КонтрагентПартнера.Пустая();

	Если СоздатьКонтрагента Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		КонтрагентОбъект = КонтрагентПартнера.ПолучитьОбъект();
	КонецЕсли;

	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, КонтрагентОбъект);

	КонтрагентОбъект.Наименование = Объект.Наименование;
	КонтрагентОбъект.НаименованиеПолное        = Объект.НаименованиеПолное;
	КонтрагентОбъект.НаименованиеМеждународное = НаименованиеМеждународное;
	КонтрагентОбъект.НаименованиеВТранскрипции = НаименованиеВТранскрипции;
	КонтрагентОбъект.Партнер                   = Объект.Ссылка;
	КонтрагентОбъект.ЮрФизЛицо                 = ЮрФизЛицо;
	КонтрагентОбъект.ОбособленноеПодразделение = ОбособленноеПодразделение;
	КонтрагентОбъект.СтранаРегистрации         = СтранаРегистрации;
	КонтрагентОбъект.РегистрационныйНомер      = РегистрационныйНомер;
	КонтрагентОбъект.НалоговыйНомер            = НалоговыйНомер;
	КонтрагентОбъект.ИНН                       = ИНН;
	КонтрагентОбъект.ИсторияНаименований.Загрузить(ИсторияНаименований.Выгрузить());
    #Вставка
    //++ Тусеев Н.Ю. 27.01.2026 ПРД2
	КонтрагентОбъект.cbr_КодFO                  = ЭтотОбъект.cbr_КодFO;
    КонтрагентОбъект.cbr_КодBitrix              = ЭтотОбъект.cbr_КодBitrix;	
    //-- Тусеев Н.Ю. 27.01.2026 ПРД2
	#КонецВставки
	Если Не ЗначениеЗаполнено(ГоловнойКонтрагент) И Не ОбособленноеПодразделение Тогда

		Если СоздатьКонтрагента Тогда
			НоваяСсылка = Справочники.Контрагенты.ПолучитьСсылку();
			КонтрагентОбъект.УстановитьСсылкуНового(НоваяСсылка);
			ГоловнойКонтрагент = КонтрагентОбъект.ПолучитьСсылкуНового();
		Иначе
			ГоловнойКонтрагент = КонтрагентПартнера;
		КонецЕсли;

	КонецЕсли;
	КонтрагентОбъект.ГоловнойКонтрагент = ГоловнойКонтрагент;
	ПартнерыИКонтрагенты.ЗаполнитьКонтактнуюИнформациюКонтрагентаПартнера(КонтрагентОбъект, ЭтотОбъект, Объект.КонтактнаяИнформация);
	ПартнерыИКонтрагентыЛокализация.ПередЗаписьюКонтрагентаПартнера(КонтрагентОбъект, ЭтаФорма);
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, КонтрагентОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонтрагентОбъект.Записать();

	КонтрагентПартнера = КонтрагентОбъект.Ссылка;

КонецПроцедуры

#КонецОбласти
