#Область СлужебныеПроцедурыИФункции

&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	//++ БаженоваЕО 30.01.2026 ПРД.18
	// Движение по регистру накопления cbr_ОплатаОтгрузкаПоМенеджерам
	Движения = Объект.Движения.cbr_ОплатаОтгрузкаПоМенеджерам;
	Движения.Записывать = Истина;
	Для Каждого Стр Из Объект.cbr_ТЧПересечениеМенеджеров Цикл
		Движение = Движения.Добавить();
		Движение.Регистратор = Объект.Ссылка;
		Движение.Период = Объект.Дата;
		Движение.РеализацияТоваровУслуг = Объект.Ссылка; 
		Движение.ЗаказКлиента = Объект.ЗаказКлиента;
		Движение.ФизическоеЛицо = Стр.ФизическоеЛицо;
		Движение.Процент = Стр.Процент;
		Движение.СуммаОтгружено = Объект.СуммаДокумента * Стр.Процент;
	КонецЦикла;
	//-- БаженоваЕО 30.01.2026
	
КонецПроцедуры

#КонецОбласти
