#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура cbr_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	//++ БаженоваЕО 03.02.2026 СКЛ.4
	КомандаСозданияНаОснованииЗадание = Документы.ЗаданиеНаПеревозку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если КомандаСозданияНаОснованииЗадание <> Неопределено Тогда
			ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаСозданияНаОснованииЗадание, 
															"СпособДоставки", 
															Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада,
															ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	//-- БаженоваЕО 03.02.2026 СКЛ.4
КонецПроцедуры

#КонецОбласти
#КонецЕсли