#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

&После("ДобавитьКомандыСозданияНаОсновании")
Процедура cbr_ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	//++АшаеваАН 03.02.26 СКЛ.9
	Документы.ПриобретениеУслугПрочихАктивов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//++АшаеваАН 03.02.26 СКЛ.9
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция cbr_ИтоговоеКоличествоПаллетов(Маршрут) Экспорт
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	ИтоговыйОбъем = Маршрут.Итог("Объем");
	Если ИтоговыйОбъем = 0 Тогда
		КоличествоПаллетов = 0;
	Иначе
		КоличествоПаллетов = Цел(ИтоговыйОбъем / 2.16) + 1;
	КонецЕсли;

	Возврат КоличествоПаллетов

КонецФункции//--cbr-larkovgeorg 26.02.2026 СКЛ.12

#КонецОбласти

#КонецЕсли
