#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//++ БаженоваЕО 13.02.2026 СКЛ.4
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Или ТипЗнч(ДанныеЗаполнения) = Тип(
		"ДокументСсылка.ЗаказПоставщику") Тогда

		Дата = ТекущаяДата();
		Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		Склад = ДанныеЗаполнения.Склад;
		Ответственный = Пользователи.ТекущийПользователь();
		ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.cbr_НеУчаствуемВДоставке;
		Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется;

		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Операция = Перечисления.ВидыДоставки.СоСклада;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Операция = Перечисления.ВидыДоставки.НаСклад;
		КонецЕсли;

		НоваяСтрокаМаршрут = Маршрут.Добавить();
		НоваяСтрокаМаршрут.Адрес = ДанныеЗаполнения.АдресДоставки;
		
		ВесНоменклатуры = 0;
		Для Каждого Стр Из ДанныеЗаполнения.Товары Цикл
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВесЧислитель") <> 0
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВесЗнаменатель") <> 0 Тогда
				ВесНоменклатуры = ВесНоменклатуры + (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура,
					"ВесЧислитель") / ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВесЗнаменатель")
					* Стр.КоличествоУпаковок);
			КонецЕсли;
		КонецЦикла;
		
		НоваяСтрокаМаршрут.Вес = ВесНоменклатуры;
		НоваяСтрокаМаршрут.КлючСвязи = Строка(Новый УникальныйИдентификатор);

		НоваяСтрокаРаспоряжение = Распоряжения.Добавить();
		НоваяСтрокаРаспоряжение.КлючСвязи = НоваяСтрокаМаршрут.КлючСвязи;
		НоваяСтрокаРаспоряжение.Склад = ДанныеЗаполнения.Склад;
		НоваяСтрокаРаспоряжение.Распоряжение = ДанныеЗаполнения;
		НоваяСтрокаРаспоряжение.ПолучательОтправитель = ДанныеЗаполнения.Партнер;

	КонецЕсли;
	//-- БаженоваЕО 13.02.2026

КонецПроцедуры

#КонецОбласти