#Область ОбработчикиСобытий
&ИзменениеИКонтроль("ЗаполнитьСписокВыбора")
Процедура cbr_ЗаполнитьСписокВыбора(ДанныеВыбора, УстановленныйСтатус) Экспорт

	ДанныеВыбора.Очистить();

	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Формируется);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Начат);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);
	#Вставка
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.cbr_НаКонтроле);
	#КонецВставки
	Если ДанныеВыбора.НайтиПоЗначению(УстановленныйСтатус) = Неопределено Тогда

		ДанныеВыбора.Добавить(УстановленныйСтатус, УстановленныйСтатус);

	КонецЕсли;

КонецПроцедуры
#КонецОбласти
