#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
	ЗаполнитьПоступлениеОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//	ПодключитьОбработчикОжидания("ЗаполнитьПоступлениеОтгрузка", 600);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ЗаполнитьПоступлениеОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьПоступлениеОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоставкиПриИзменении(Элемент)
	ЗаполнитьПоступлениеОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ЗаполнитьПоступлениеОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура УчитываяОтгруженныеПриИзменении(Элемент)
	ЗаполнитьПоступлениеОтгрузка();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьПоступлениеОтгрузка();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПоступлениеОтгрузкаВремяПо.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоступлениеОтгрузкаВремяПо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДата();

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоступлениеОтгрузка()

	ПоступлениеОтгрузка.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Склад КАК Склад,
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Операция КАК Операция,
	|	ЗаданиеНаПеревозкуМаршрут.ВремяС КАК Дата,
	|	ЗаданиеНаПеревозкуРаспоряжения.ВремяС КАК ВремяС,
	|	ЗаданиеНаПеревозкуРаспоряжения.ВремяПо КАК ВремяПо,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ЗаданиеВыполняет КАК ВидДоставки,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ТранспортноеСредство.Тип КАК ВидТранспортногоСредства,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Водитель КАК Водитель,	
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Водитель.ФИО КАК ВодительФИО,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ТранспортноеСредство.Марка КАК МаркаТС,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ТранспортноеСредство.Код КАК НомерТС,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус КАК Статус,
	|	ЛОЖЬ КАК Выписка,
	|	ЗаданиеНаПеревозкуРаспоряжения.Вес КАК Вес,
	|	ЗаданиеНаПеревозкуРаспоряжения.Объем КАК Объем,
	|	ЗаданиеНаПеревозкуМаршрут.Доставлено КАК Доставлено
	|ПОМЕСТИТЬ ВТ_ДанныеЗаданийНаПеревозку
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО ЗаданиеНаПеревозкуМаршрут.КлючСвязи = ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка <> ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка)
	|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Водитель,
	|	Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЗаданийНаПеревозку.Склад КАК Склад,
	|	ВТ_ДанныеЗаданийНаПеревозку.Распоряжение КАК Распоряжение,
	|	ВТ_ДанныеЗаданийНаПеревозку.Операция КАК Операция,
	|	ВТ_ДанныеЗаданийНаПеревозку.Дата КАК Дата,
	|	ВТ_ДанныеЗаданийНаПеревозку.ВремяС КАК ВремяС,
	|	ВТ_ДанныеЗаданийНаПеревозку.ВремяПо КАК ВремяПо,
	|	ВТ_ДанныеЗаданийНаПеревозку.ВидДоставки КАК ВидДоставки,
	|	ВТ_ДанныеЗаданийНаПеревозку.ВидТранспортногоСредства КАК ВидТранспортногоСредства,
	|	ВТ_ДанныеЗаданийНаПеревозку.ВодительФИО КАК ВодительФИО,
	|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	ВТ_ДанныеЗаданийНаПеревозку.МаркаТС КАК МаркаТС,
	|	ВТ_ДанныеЗаданийНаПеревозку.НомерТС КАК НомерТС,
	|	ВТ_ДанныеЗаданийНаПеревозку.Статус КАК Статус,
	|	ВТ_ДанныеЗаданийНаПеревозку.Выписка КАК Выписка,
	|	ВТ_ДанныеЗаданийНаПеревозку.Вес КАК Вес,
	|	ВТ_ДанныеЗаданийНаПеревозку.Объем КАК Объем,
	|	РеализацияТоваровУслуг.Номер КАК НомерРеализации,
	|	СчетФактураВыданный.Номер КАК НомерСчетФактура,
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
	|	ВТ_ДанныеЗаданийНаПеревозку.Доставлено КАК Доставлено
	|ИЗ
	|	ВТ_ДанныеЗаданийНаПеревозку КАК ВТ_ДанныеЗаданийНаПеревозку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&МоментВремени, Физлицо В
	|			(ВЫБРАТЬ
	|				Вт_ДанныеЗаданийНаПеревозку.Водитель
	|			ИЗ
	|				Вт_ДанныеЗаданийНаПеревозку КАК Вт_ДанныеЗаданийНаПеревозку)) КАК ДокументыФизическихЛицСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|			ПО ДокументыФизическихЛицСрезПоследних.Физлицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|		ПО ВТ_ДанныеЗаданийНаПеревозку.Водитель = ДокументыФизическихЛицСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|			ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
	|		ПО ВТ_ДанныеЗаданийНаПеревозку.Распоряжение = РеализацияТоваровУслуг.ЗаказКлиента
	|		&ТекстУсловия";

	ТекстУсловия = "";
	Если ЗначениеЗаполнено(Склад) Или ЗначениеЗаполнено(Период) Или ЗначениеЗаполнено(ВидДоставки)
		Или ЗначениеЗаполнено(Статус) Или Не УчитываяОтгруженные Тогда

		ТекстУсловия = "ГДЕ";

		Если ЗначениеЗаполнено(Склад) Тогда

			ТекстУсловия = ТекстУсловия + " ВТ_ДанныеЗаданийНаПеревозку.Склад В (&Склады)";
			Запрос.УстановитьПараметр("Склады", Склад);

		ИначеЕсли ЗначениеЗаполнено(Период) Тогда

			ТекстУсловия = ?(СтрДлина(ТекстУсловия) > 3, ТекстУсловия + " И", ТекстУсловия);
			ТекстУсловия = ТекстУсловия + " ВТ_ДанныеЗаданийНаПеревозку.Дата МЕЖДУ &ПериодН И &ПериодК";
			Запрос.УстановитьПараметр("ПериодН", НачалоМесяца(Период));
			Запрос.УстановитьПараметр("ПериодК", КонецМесяца(Период));

		ИначеЕсли ЗначениеЗаполнено(ВидДоставки) Тогда

			ТекстУсловия = ?(СтрДлина(ТекстУсловия) > 3, ТекстУсловия + " И", ТекстУсловия);
			ТекстУсловия = ТекстУсловия + " ВТ_ДанныеЗаданийНаПеревозку.ВидДоставки = &ВидДоставки";
			Запрос.УстановитьПараметр("ВидДоставки", ВидДоставки);

		ИначеЕсли ЗначениеЗаполнено(Статус) Тогда

			ТекстУсловия = ?(СтрДлина(ТекстУсловия) > 3, ТекстУсловия + " И", ТекстУсловия);
			ТекстУсловия = ТекстУсловия + " ВТ_ДанныеЗаданийНаПеревозку.Статус = &Статус";
			Запрос.УстановитьПараметр("Статус", Статус);

		ИначеЕсли Не УчитываяОтгруженные Тогда

			ТекстУсловия = ?(СтрДлина(ТекстУсловия) > 3, ТекстУсловия + " И", ТекстУсловия);
			ТекстУсловия = ТекстУсловия + " ВТ_ДанныеЗаданийНаПеревозку.Доставлено = &УчитываяОтгруженные";
			Запрос.УстановитьПараметр("УчитываяОтгруженные", УчитываяОтгруженные);

		КонецЕсли;

	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловия", ТекстУсловия);

	Запрос.УстановитьПараметр("МоментВремени", ТекущаяДата());

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		НоваяСтрока = ПоступлениеОтгрузка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

		Если ЗначениеЗаполнено(Выборка.НомерРеализации) И ЗначениеЗаполнено(Выборка.НомерСчетФактура) Тогда
			НоваяСтрока.НомераСформированныхПервичныхДокументов = Строка(Выборка.НомерРеализации) + ", " + Строка(
				Выборка.НомерСчетФактура);
		ИначеЕсли ЗначениеЗаполнено(Выборка.НомерРеализации) Тогда
			НоваяСтрока.НомераСформированныхПервичныхДокументов = Строка(Выборка.НомерРеализации);
		ИначеЕсли ЗначениеЗаполнено(Выборка.НомерСчетФактура) Тогда
			НоваяСтрока.НомераСформированныхПервичныхДокументов = Строка(Выборка.НомерСчетФактура);
		КонецЕсли;
		
//		ПараметрыГиперссылки = Новый Структура("Владелец, Размещение", НоваяСтрока.Распоряжение, НоваяСтрока.ПодгруженныеФайлы);
//		РаботаСФайлами.ГиперссылкаФайлов();

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()

	МассивРаспоряжений = Новый Массив;

	Для Каждого Строка Из ПоступлениеОтгрузка Цикл

		Распоряжение = Строка.Распоряжение;

		Если Строка.Выписка Тогда
			МассивРаспоряжений.Добавить(Распоряжение);
		КонецЕсли;

	КонецЦикла;

	ДанныеРаспоряжения = НайтиТоварыКДоставке(МассивРаспоряжений);
	НайденныеРаспоряжения = НайтиРаспоряженияВРегистрах(ДанныеРаспоряжения);

	Если НайденныеРаспоряжения <> Неопределено Тогда

		ПредыдущееРаспоряжение = Неопределено;

		Для Каждого Стр Из НайденныеРаспоряжения Цикл

			Если ПредыдущееРаспоряжение = Неопределено Тогда

				Если Стр.Операция = Перечисления.ВидыДоставки.НаСклад Тогда
					
					//создание ПриходныйОрдерНаТовары
					НовыйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();

					СтруктураРаспоряжения = КонвертироватьОбъектВСтруктуру(Стр.Распоряжение);
					НовыйОрдер.Заполнить(СтруктураРаспоряжения);

					НовыйОрдер.Дата = ТекущаяДата();
					НоваяСтрокаТЧ = НовыйОрдер.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;
					
					//создание ПриобретениеТоваровУслуг
					НовыйПриобретениеТоваровУслуг = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
					НовыйПриобретениеТоваровУслуг.Заполнить(Стр.Распоряжение);

					НовыйПриобретениеТоваровУслуг.Дата = ТекущаяДата();

					НоваяСтрокаТЧ = НовыйПриобретениеТоваровУслуг.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;

				ИначеЕсли Стр.Операция = Перечисления.ВидыДоставки.СоСклада Тогда

					//создание РасходныйОрдерНаТовары
					НовыйОрдер = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
					НовыйОрдер.Заполнить(Стр.Распоряжение);

					НовыйОрдер.Дата = ТекущаяДата();
					НовыйОрдер.Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Распоряжение, "Автор");
					НовыйОрдер.Склад = Стр.Склад;
					НовыйОрдер.Получатель = Стр.Контрагент;
					НовыйОрдер.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
					НовыйОрдер.Помещение = Справочники.СкладскиеПомещения.НайтиПоНаименованию("Теплое");

					НоваяСтрокаТЧ = НовыйОрдер.ТоварыПоРаспоряжениям.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.Количество = Стр.Количество;
					НоваяСтрокаТЧ.Распоряжение = Стр.Распоряжение;

					//создание РеализацияТоваровУслуг
					НовыйРеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
					НовыйРеализацияТоваровУслуг.Заполнить(Стр.Распоряжение);

					НовыйРеализацияТоваровУслуг.Дата = ТекущаяДата();

					НоваяСтрокаТЧ = НовыйРеализацияТоваровУслуг.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;

				КонецЕсли;

				ПредыдущееРаспоряжение =  Стр.Распоряжение;

			ИначеЕсли ПредыдущееРаспоряжение = Стр.Распоряжение Тогда

				Если Стр.Операция = Перечисления.ВидыДоставки.НаСклад Тогда

					//добавление строки в ПриходныйОрдерНаТовары
					НоваяСтрокаТЧ = НовыйОрдер.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;
					
					//добавление строки в ПриобретениеТоваровУслуг
					НоваяСтрокаТЧ = НовыйПриобретениеТоваровУслуг.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;

				ИначеЕсли Стр.Операция = Перечисления.ВидыДоставки.СоСклада Тогда
					
					//добавление строки в РасходныйОрдерНаТовары
					НоваяСтрокаТЧ = НовыйОрдер.ТоварыПоРаспоряжениям.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.Количество = Стр.Количество;
					НоваяСтрокаТЧ.Распоряжение = Стр.Распоряжение;

					//добавление строки в РеализацияТоваровУслуг
					НоваяСтрокаТЧ = НовыйРеализацияТоваровУслуг.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;

				КонецЕсли;

			ИначеЕсли ПредыдущееРаспоряжение <> Стр.Распоряжение Тогда

				Попытка
					
					НовыйОрдер.Записать(РежимЗаписиДокумента.Проведение);
					Если ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
						НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
					ИначеЕсли ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
						НовыйРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
					
				Исключение
					
					НовыйОрдер.Записать(РежимЗаписиДокумента.Запись);
					Если ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
						НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
					ИначеЕсли ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
						НовыйРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
					
				КонецПопытки;

				Если Стр.Операция = Перечисления.ВидыДоставки.НаСклад Тогда
					
					//создание ПриходныйОрдерНаТовары
					НовыйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();

					СтруктураРаспоряжения = КонвертироватьОбъектВСтруктуру(Стр.Распоряжение);
					НовыйОрдер.Заполнить(СтруктураРаспоряжения);

					НовыйОрдер.Дата = ТекущаяДата();
					НоваяСтрокаТЧ = НовыйОрдер.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;

					//создание ПриобретениеТоваровУслуг
					НовыйПриобретениеТоваровУслуг = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
					НовыйПриобретениеТоваровУслуг.Заполнить(Стр.Распоряжение);

					НовыйПриобретениеТоваровУслуг.Дата = ТекущаяДата();

					НоваяСтрокаТЧ = НовыйПриобретениеТоваровУслуг.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;

				ИначеЕсли Стр.Операция = Перечисления.ВидыДоставки.СоСклада Тогда
					
					//создание РасходныйОрдерНаТовары
					НовыйОрдер = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
					НовыйОрдер.Заполнить(Стр.Распоряжение);

					НовыйОрдер.Дата = ТекущаяДата();
					НовыйОрдер.Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Распоряжение, "Автор");
					НовыйОрдер.Склад = Стр.Склад;
					НовыйОрдер.Получатель = Стр.Контрагент;
					НовыйОрдер.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
					НовыйОрдер.Помещение = Справочники.СкладскиеПомещения.НайтиПоНаименованию("Теплое");

					НоваяСтрокаТЧ = НовыйОрдер.ТоварыПоРаспоряжениям.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.Количество = Стр.Количество;
					НоваяСтрокаТЧ.Распоряжение = Стр.Распоряжение;

					//создание РеализацияТоваровУслуг
					НовыйРеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
					НовыйРеализацияТоваровУслуг.Заполнить(Стр.Распоряжение);

					НовыйРеализацияТоваровУслуг.Дата = ТекущаяДата();

					НоваяСтрокаТЧ = НовыйРеализацияТоваровУслуг.Товары.Добавить();
					НоваяСтрокаТЧ.Номенклатура = Стр.Номенклатура;
					НоваяСтрокаТЧ.Характеристика = Стр.Характеристика;
					НоваяСтрокаТЧ.Назначение = Стр.Назначение;
					НоваяСтрокаТЧ.Серия = Стр.Серия;
					НоваяСтрокаТЧ.КоличествоУпаковок = Стр.Количество;
					НоваяСтрокаТЧ.Количество = Стр.Количество;

				КонецЕсли;

				ПредыдущееРаспоряжение =  Стр.Распоряжение;

			КонецЕсли;

			Попытка
				
				НовыйОрдер.Записать(РежимЗаписиДокумента.Проведение);
				Если ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
					НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
				ИначеЕсли ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
					НовыйРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
			Исключение
				
				НовыйОрдер.Записать(РежимЗаписиДокумента.Запись);
				Если ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда
					НовыйПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
				ИначеЕсли ТипЗнч(НовыйОрдер) = Тип("ДокументОбъект.РасходныйОрдерНаТовары") Тогда
					НовыйРеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецПопытки;
			
//			НовыйОтборРазмещениеТоваров = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
//			НовыйОтборРазмещениеТоваров.Заполнить(НовыйОрдер);

		КонецЦикла;

	КонецЕсли;

//	ТекстПредупреждения = НСтр("ru = 'Выберите распоряжение на поступление товаров.';
//							   |en = 'Select a goods receipt reference.'");
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);

КонецПроцедуры

Функция НайтиТоварыКДоставке(МассивРаспоряжений)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыКДоставке.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|	ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|	ВЫБОР
	|		КОГДА ТоварыКДоставке.ВсеТовары
	|			ТОГДА ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|					ТОГДА ЗаказПоставщикуТовары.Номенклатура
	|				ИНАЧЕ ЗаказКлиентаТовары.Номенклатура
	|			КОНЕЦ
	|		ИНАЧЕ ТоварыКДоставке.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТоварыКДоставке.ВсеТовары
	|			ТОГДА ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|					ТОГДА ЗаказПоставщикуТовары.Характеристика
	|				ИНАЧЕ ЗаказКлиентаТовары.Характеристика
	|			КОНЕЦ
	|		ИНАЧЕ ТоварыКДоставке.Характеристика
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТоварыКДоставке.ВсеТовары
	|			ТОГДА ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|					ТОГДА ЗаказПоставщикуТовары.Назначение
	|				ИНАЧЕ NULL
	|			КОНЕЦ
	|		ИНАЧЕ ТоварыКДоставке.Назначение
	|	КОНЕЦ КАК Назначение,
	|	ВЫБОР
	|		КОГДА ТоварыКДоставке.ВсеТовары
	|			ТОГДА ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(ТоварыКДоставке.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|					ТОГДА NULL
	|				ИНАЧЕ ЗаказКлиентаТовары.Серия
	|			КОНЕЦ
	|		ИНАЧЕ ТоварыКДоставке.Серия
	|	КОНЕЦ КАК Серия
	|ИЗ
	|	РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО ТоварыКДоставке.Распоряжение = ЗаказПоставщикуТовары.Ссылка
	|		И ТоварыКДоставке.ВсеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ТоварыКДоставке.Распоряжение = ЗаказКлиентаТовары.Ссылка
	|		И ТоварыКДоставке.ВсеТовары
	|ГДЕ
	|	ТоварыКДоставке.Распоряжение В (&Распоряжение)";

	Запрос.УстановитьПараметр("Распоряжение", МассивРаспоряжений);

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции

Функция НайтиРаспоряженияВРегистрах(ДанныеРаспоряжения)

	Распоряжения = ДанныеРаспоряжения.ВыгрузитьКолонку("Распоряжение");
	Номенклатура = ДанныеРаспоряжения.ВыгрузитьКолонку("Номенклатура");
	Назначение = ДанныеРаспоряжения.ВыгрузитьКолонку("Назначение");
	Характеристика = ДанныеРаспоряжения.ВыгрузитьКолонку("Характеристика");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстатки.Назначение КАК Назначение,
	|	ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоРаспоряжениюОстаток КАК Количество,
	|	ТоварыКПоступлениюОстатки.Склад КАК Склад,
	|	ТоварыКПоступлениюОстатки.Отправитель КАК Контрагент,
	|	ТоварыКПоступлениюОстатки.Серия КАК Серия,
	|	ТоварыКПоступлениюОстатки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыКПоступлениюОстатки.КОформлениюНакладныхПоРаспоряжениюОстаток КАК КоличествоКОформлению
	|ПОМЕСТИТЬ ВТИтог
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	|	ТоварыКОтгрузкеОстатки.Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Характеристика,
	|	ТоварыКОтгрузкеОстатки.Назначение,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток,
	|	ТоварыКОтгрузкеОстатки.Склад,
	|	ТоварыКОтгрузкеОстатки.Получатель,
	|	ТоварыКОтгрузкеОстатки.Серия,
	|	NULL,
	|	ТоварыКОтгрузкеОстатки.КОформлениюОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИтог.Распоряжение КАК Распоряжение,
	|	ВТИтог.Номенклатура КАК Номенклатура,
	|	ВТИтог.Характеристика КАК Характеристика,
	|	ВТИтог.Назначение КАК Назначение,
	|	ВТИтог.Количество КАК Количество,
	|	ВТИтог.Склад КАК Склад,
	|	ВТИтог.Контрагент КАК Контрагент,
	|	ВТИтог.Серия КАК Серия,
	|	ВТИтог.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТИтог.КоличествоКОформлению КАК КоличествоКОформлению
	|ИЗ
	|	ВТИтог КАК ВТИтог
	|ГДЕ
	|	ВТИтог.Распоряжение В (&Распоряжения)
	|	И ВТИтог.Номенклатура В (&Номенклатура)
	|	И ВТИтог.Характеристика В (&Характеристика)
	|	И ВТИтог.Назначение В (&Назначение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Распоряжение";

	Запрос.УстановитьПараметр("Распоряжения", Распоряжения);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("Операция", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоставки"));

	Для Каждого СтрокаРезультат Из Результат Цикл
		Для Каждого СтрокаРаспоряжения Из ДанныеРаспоряжения Цикл
			Если СтрокаРезультат.Распоряжение = СтрокаРаспоряжения.Распоряжение Тогда
				СтрокаРезультат.Операция = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					СтрокаРаспоряжения.ЗаданиеНаПеревозку, "Операция");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция КонвертироватьОбъектВСтруктуру(Распоряжение)

	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Склад", Распоряжение.Склад);
	СтруктураОбъекта.Вставить("Помещение", Справочники.СкладскиеПомещения.НайтиПоНаименованию("Теплое"));
	СтруктураОбъекта.Вставить("Распоряжение", Распоряжение);
	СтруктураОбъекта.Вставить("ДатаПоступления", Распоряжение.ДатаПоступления);
	СтруктураОбъекта.Вставить("Отправитель", Распоряжение.Партнер);
	СтруктураОбъекта.Вставить("ХозяйственнаяОперация", Распоряжение.ХозяйственнаяОперация);
  
//  СтандартныеРеквизитыОбъекта = Распоряжение.Метаданные().СтандартныеРеквизиты;
//  Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыОбъекта Цикл
//      СтруктураОбъекта.Вставить(СтандартныйРеквизит.Имя, Распоряжение[СтандартныйРеквизит.Имя]);
//  КонецЦикла;
//
//  РеквизитыОбъекта = Распоряжение.Метаданные().Реквизиты;
//  Для Каждого Реквизит Из РеквизитыОбъекта Цикл
//      СтруктураОбъекта.Вставить(Реквизит.Имя, Распоряжение[Реквизит.Имя]);
//  КонецЦикла;

	Возврат СтруктураОбъекта;

КонецФункции

#КонецОбласти