#Область ОбработчикиСобытийЭлементовШапкиФормы

//++ cba AlopinAS 27.01.26
&После("СоглашениеПриИзменении")
&НаКлиенте
Процедура cbr_СоглашениеПриИзменении(Элемент)
	cbr_СоглашениеПриИзмененииНаСервере(Объект.Соглашение);
КонецПроцедуры
//-- cba AlopinAS 27.01.26
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ cba AlopinAS 27.01.26
&НаСервере
Процедура cbr_СоглашениеПриИзмененииНаСервере(Соглашение)
	Объект.cbr_Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение, "cbr_Проект");
КонецПроцедуры
//-- cba AlopinAS 27.01.26

#КонецОбласти
