#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура cbr_МенеджерПриИзмененииПосле(Элемент)
	
	//++ БаженоваЕО 29.01.2026 ПРД.18
	Если ЗначениеЗаполнено(Объект.Менеджер) Тогда
		Объект.cbr_ТЧПересечениеМенеджеров.Очистить();
		НоваяСтрока = Объект.cbr_ТЧПересечениеМенеджеров.Добавить();
		НоваяСтрока.ФизическоеЛицо = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Менеджер,"ФизическоеЛицо");
		НоваяСтрока.Процент = 100;
	КонецЕсли;
	//-- БаженоваЕО 29.01.2026
	
КонецПроцедуры

//++ БаженоваЕО 29.01.2026 ПРД.18
&НаКлиенте
Процедура cbr_ПересечениеМенеджеровПриИзменении(Элемент)
	
	Элементы.ПересечениеМенеджеров.Видимость = Объект.cbr_ПересечениеМенеджеров;

КонецПроцедуры //-- БаженоваЕО 29.01.2026

#КонецОбласти

