#Область СлужебныеПроцедурыИФункции

//++АшаеваАН 29.01.26 ПРД.5
&После("СоглашениеПриИзменении")
&НаКлиенте
Процедура cbr_СоглашениеПриИзменении(Элемент)

Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
	
	СтруктураСпецТребования = Новый Структура();
	СтруктураСпецТребования.Вставить("ЕстьРазличия",Ложь);
	СтруктураСпецТребования.Вставить("ДокументыДляВодителя","");
	СтруктураСпецТребования.Вставить("ТаможенноеСопровождение","");
	СтруктураСпецТребования.Вставить("УсловияДоставки","");
	СтруктураСпецТребования.Вставить("ТребованияКУпаковке","");
	СтруктураСпецТребования.Вставить("ТребованияКЭтикетке","");
	СтруктураСпецТребования.Вставить("ТребованиеККомплектации","");
	СтруктураСпецТребования.Вставить("НеБолееДатыПроизводства",0);
	СтруктураСпецТребования.Вставить("ДопустимыйОстатокГСХНеМенееПроцент",0);
	СтруктураСпецТребования.Вставить("ДопустимыйОстатокГСХНеМенееМес",0);
	СтруктураСпецТребования.Вставить("ПрочиеТребования","");

	cbr_СверитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования);

	Если СтруктураСпецТребования.ЕстьРазличия Тогда
		cbr_ЗадатьВопросОРаспределенииТоваровПоЗаказам(СтруктураСпецТребования);
	КонецЕсли;
	
КонецЕсли;

КонецПроцедуры //--АшаеваАН 29.01.26 ПРД.5

//++АшаеваАН 29.01.26 ПРД.5
&НаКлиенте
Асинх Процедура	cbr_ЗадатьВопросОРаспределенииТоваровПоЗаказам(СтруктураСпецТребования)
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Обновить информацию по специальным требованиям?'"), РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда  
		cbr_ОбновитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования); 
	КонецЕсли	
	
КонецПроцедуры  //--АшаеваАН 29.01.26 ПРД.5

//++АшаеваАН 29.01.26 ПРД.5
&НаСервере
Процедура cbr_СверитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|СоглашенияСКлиентами.cbr_ДокументыДляВодителя,
	|СоглашенияСКлиентами.cbr_ТаможенноеСопровождение,
	|СоглашенияСКлиентами.cbr_УсловияДоставки,
	|СоглашенияСКлиентами.cbr_ТребованияКУпаковке,
	|СоглашенияСКлиентами.cbr_ТребованияКЭтикетке,
	|СоглашенияСКлиентами.cbr_ТребованиеККомплектации,
	|СоглашенияСКлиентами.cbr_НеБолееДатыПроизводства,
	|СоглашенияСКлиентами.cbr_ДопустимыйОстатокГСХНеМенееПроцент,
	|СоглашенияСКлиентами.cbr_ДопустимыйОстатокГСХНеМенееМес,
	|СоглашенияСКлиентами.cbr_ПрочиеТребования
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|ГДЕ
	|	СоглашенияСКлиентами.Ссылка = &Соглашение
	|	И (ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ДокументыДляВодителя КАК СТРОКА(100)) <> ВЫРАЗИТЬ(&ДокументыДляВодителя КАК СТРОКА(100))
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ТаможенноеСопровождение КАК СТРОКА(1000)) <> ВЫРАЗИТЬ(&ТаможенноеСопровождение КАК СТРОКА(1000))
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_УсловияДоставки КАК СТРОКА(100)) <> ВЫРАЗИТЬ(&УсловияДоставки КАК СТРОКА(100))
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ТребованияКУпаковке КАК СТРОКА(1000)) <> ВЫРАЗИТЬ(&ТребованияКУпаковке КАК СТРОКА(1000))
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ТребованияКЭтикетке КАК СТРОКА(1000)) <> ВЫРАЗИТЬ(&ТребованияКЭтикетке КАК СТРОКА(1000))
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ТребованиеККомплектации КАК СТРОКА(1000)) <> ВЫРАЗИТЬ(&ТребованиеККомплектации КАК СТРОКА(1000))
	|	ИЛИ СоглашенияСКлиентами.cbr_НеБолееДатыПроизводства <> &НеБолееДатыПроизводства
	|	ИЛИ СоглашенияСКлиентами.cbr_ДопустимыйОстатокГСХНеМенееПроцент <> &ДопустимыйОстатокГСХНеМенееПроцент
	|	ИЛИ СоглашенияСКлиентами.cbr_ДопустимыйОстатокГСХНеМенееМес <> &ДопустимыйОстатокГСХНеМенееМес
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ПрочиеТребования КАК СТРОКА(1000)) <> ВЫРАЗИТЬ(&ПрочиеТребования КАК СТРОКА(1000)))";
	
	Запрос.УстановитьПараметр("ДокументыДляВодителя", Объект.cbr_ДокументыДляВодителя);
	Запрос.УстановитьПараметр("ТаможенноеСопровождение", Объект.cbr_ТаможенноеСопровождение);
	Запрос.УстановитьПараметр("УсловияДоставки", Объект.cbr_УсловияДоставки);
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
	Запрос.УстановитьПараметр("ТребованияКУпаковке", Объект.cbr_ТребованияКУпаковке);
	Запрос.УстановитьПараметр("ТребованияКЭтикетке", Объект.cbr_ТребованияКЭтикетке);
	Запрос.УстановитьПараметр("ТребованиеККомплектации", Объект.cbr_ТребованиеККомплектации);
	Запрос.УстановитьПараметр("НеБолееДатыПроизводства", Объект.cbr_НеБолееДатыПроизводства);
	Запрос.УстановитьПараметр("ДопустимыйОстатокГСХНеМенееПроцент", Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент);
	Запрос.УстановитьПараметр("ДопустимыйОстатокГСХНеМенееМес", Объект.cbr_ДопустимыйОстатокГСХНеМенееМес);
	Запрос.УстановитьПараметр("ПрочиеТребования", Объект.cbr_ПрочиеТребования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураСпецТребования.ЕстьРазличия = Истина;
		СтруктураСпецТребования.ДокументыДляВодителя = Выборка.cbr_ДокументыДляВодителя;
		СтруктураСпецТребования.ТаможенноеСопровождение = Выборка.cbr_ТаможенноеСопровождение;
		СтруктураСпецТребования.УсловияДоставки = Выборка.cbr_УсловияДоставки;
		СтруктураСпецТребования.ТребованияКУпаковке = Выборка.cbr_ТребованияКУпаковке;
		СтруктураСпецТребования.ТребованияКЭтикетке = Выборка.cbr_ТребованияКЭтикетке;
		СтруктураСпецТребования.ТребованиеККомплектации = Выборка.cbr_ТребованиеККомплектации;
		СтруктураСпецТребования.НеБолееДатыПроизводства = Выборка.cbr_НеБолееДатыПроизводства;
		СтруктураСпецТребования.ДопустимыйОстатокГСХНеМенееПроцент = Выборка.cbr_ДопустимыйОстатокГСХНеМенееПроцент;
		СтруктураСпецТребования.ДопустимыйОстатокГСХНеМенееМес = Выборка.cbr_ДопустимыйОстатокГСХНеМенееМес;
		СтруктураСпецТребования.ПрочиеТребования = Выборка.cbr_ПрочиеТребования;
		
	КонецЕсли;	
	
КонецПроцедуры  //--АшаеваАН 29.01.26 ПРД.5

//++АшаеваАН 29.01.26 ПРД.5
&НаСервере
Процедура cbr_ОбновитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования)
	
	Объект.cbr_ДокументыДляВодителя = СтруктураСпецТребования.ДокументыДляВодителя;
	Объект.cbr_ТаможенноеСопровождение = СтруктураСпецТребования.ТаможенноеСопровождение;
	Объект.cbr_УсловияДоставки = СтруктураСпецТребования.УсловияДоставки;
	Объект.cbr_ТребованияКУпаковке = СтруктураСпецТребования.ТребованияКУпаковке;
	Объект.cbr_ТребованияКЭтикетке = СтруктураСпецТребования.ТребованияКЭтикетке;
	Объект.cbr_ТребованиеККомплектации = СтруктураСпецТребования.ТребованиеККомплектации;
	Объект.cbr_НеБолееДатыПроизводства = СтруктураСпецТребования.НеБолееДатыПроизводства;
	Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент = СтруктураСпецТребования.ДопустимыйОстатокГСХНеМенееПроцент;
	Объект.cbr_ДопустимыйОстатокГСХНеМенееМес = СтруктураСпецТребования.ДопустимыйОстатокГСХНеМенееМес;
	Объект.cbr_ПрочиеТребования = СтруктураСпецТребования.ПрочиеТребования;
	
КонецПроцедуры  //--АшаеваАН 29.01.26 ПРД.5

#Область Обеспечение

&ИзменениеИКонтроль("ПараметрыФормыЗапросаКоличестваИСерий")
&НаКлиенте
Функция cbr_ПараметрыФормыЗапросаКоличестваИСерий(Режим)

	ПараметрыПроверки = ОбеспечениеКлиентСервер.ИнициализироватьПараметрыПроверкиЗаполнения();

	Если Не ОбеспечениеКлиент.ПроверитьЗаполнение(
				Объект,
				Объект.Товары,
				Элементы.Товары.ТекущаяСтрока,
				ПараметрыПроверки,
				Объект.Склад,
				Режим) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыФормы = ПараметрыВыбораОбеспечения(Режим);
	ПараметрыФормы.ПараметрыУказанияСерий = ПараметрыУказанияСерий;
	#Вставка
	//++АшаеваАН 29.01.26 ПРД.5
	ПараметрыФормы.Вставить("cbr_НеБолееДатыПроизводства", Объект.cbr_НеБолееДатыПроизводства);
	ПараметрыФормы.Вставить("cbr_ДопустимыйОстатокГСХНеМенееПроцент", Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент);
	ПараметрыФормы.Вставить("cbr_ДопустимыйОстатокГСХНеМенееМес", Объект.cbr_ДопустимыйОстатокГСХНеМенееМес);
	//--АшаеваАН 29.01.26 ПРД.5
	#КонецВставки

	Возврат ПараметрыФормы;

КонецФункции

#КонецОбласти

#КонецОбласти
