#Область СлужебныеПроцедурыИФункции
&После("ТоварыНоменклатураПриИзменении")
&НаКлиенте
Процедура cbr_ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
	ЭтотОбъект.ДоступныеОстаткиПараметрыВстраивания.СлужебныеПараметры.ВариантОбеспеченияВыбранноеЗначение = Неопределено;
	
	ОбеспечениеВДокументахКлиент.ВариантОбеспеченияПриИзменении(
        ЭтотОбъект,
        Неопределено,
        "ОбработатьВыборСкладаИСерии",
        Истина,
        "ТоварыВариантОбеспеченияПриИзмененииПослеВопроса");
	
КонецПроцедуры

&После("ТоварыПриНачалеРедактирования")
&НаКлиенте
Процедура cbr_ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		
		ТекущаяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
		ЭтотОбъект.ДоступныеОстаткиПараметрыВстраивания.СлужебныеПараметры.ВариантОбеспеченияВыбранноеЗначение = Неопределено;
	
		ОбеспечениеВДокументахКлиент.ВариантОбеспеченияПриИзменении(
       		ЭтотОбъект,
        	Неопределено,
        	"ОбработатьВыборСкладаИСерии",
        	Истина,
        	"ТоварыВариантОбеспеченияПриИзмененииПослеВопроса");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
