#Область СлужебныеПроцедурыИФункции

//++АшаеваАН 29.01.26 ПРД.5
&После("СоглашениеПриИзменении")
&НаКлиенте
Процедура cbr_СоглашениеПриИзменении(Элемент)

Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
	
	СтруктураСпецТребования = Новый Структура();
	СтруктураСпецТребования.Вставить("ЕстьРазличия",Ложь);
	СтруктураСпецТребования.Вставить("ДокументыДляВодителя","");
	СтруктураСпецТребования.Вставить("ТаможенноеСопровождение","");
	СтруктураСпецТребования.Вставить("УсловияДоставки","");

	cbr_СверитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования);

	Если СтруктураСпецТребования.ЕстьРазличия Тогда
		cbr_ЗадатьВопросОРаспределенииТоваровПоЗаказам(СтруктураСпецТребования);
	КонецЕсли;
	
КонецЕсли;

КонецПроцедуры //--АшаеваАН 29.01.26 ПРД.5

//++АшаеваАН 29.01.26 ПРД.5
&НаКлиенте
Асинх Процедура	cbr_ЗадатьВопросОРаспределенииТоваровПоЗаказам(СтруктураСпецТребования)
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Обновить информацию по специальным требованиям?'"), РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда  
		cbr_ОбновитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования); 
	КонецЕсли	
	
КонецПроцедуры  //--АшаеваАН 29.01.26 ПРД.5

//++АшаеваАН 29.01.26 ПРД.5
&НаСервере
Процедура cbr_СверитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|СоглашенияСКлиентами.cbr_ДокументыДляВодителя,
	|СоглашенияСКлиентами.cbr_ТаможенноеСопровождение,
	|СоглашенияСКлиентами.cbr_УсловияДоставки
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|ГДЕ
	|	СоглашенияСКлиентами.Ссылка = &Соглашение
	|	И (ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ДокументыДляВодителя КАК СТРОКА(100)) <> ВЫРАЗИТЬ(&ДокументыДляВодителя КАК СТРОКА(100))
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_ТаможенноеСопровождение КАК СТРОКА(1000)) <> ВЫРАЗИТЬ(&ТаможенноеСопровождение КАК СТРОКА(1000))
	|	ИЛИ ВЫРАЗИТЬ(СоглашенияСКлиентами.cbr_УсловияДоставки КАК СТРОКА(100)) <> ВЫРАЗИТЬ(&УсловияДоставки КАК СТРОКА(100)))";
	
	Запрос.УстановитьПараметр("ДокументыДляВодителя", Объект.cbr_ДокументыДляВодителя);
	Запрос.УстановитьПараметр("ТаможенноеСопровождение", Объект.cbr_ТаможенноеСопровождение);
	Запрос.УстановитьПараметр("УсловияДоставки", Объект.cbr_УсловияДоставки);
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураСпецТребования.ЕстьРазличия = Истина;
		СтруктураСпецТребования.ДокументыДляВодителя = Выборка.cbr_ДокументыДляВодителя;
		СтруктураСпецТребования.ТаможенноеСопровождение = Выборка.cbr_ТаможенноеСопровождение;
		СтруктураСпецТребования.УсловияДоставки = Выборка.cbr_УсловияДоставки;
		
	КонецЕсли;	
	
КонецПроцедуры  //--АшаеваАН 29.01.26 ПРД.5

//++АшаеваАН 29.01.26 ПРД.5
&НаСервере
Процедура cbr_ОбновитьИнформациюПоСпециальнымТребованиям(СтруктураСпецТребования)
	
	Объект.cbr_ДокументыДляВодителя = СтруктураСпецТребования.ДокументыДляВодителя;
	Объект.cbr_ТаможенноеСопровождение = СтруктураСпецТребования.ТаможенноеСопровождение;
	Объект.cbr_УсловияДоставки = СтруктураСпецТребования.УсловияДоставки;
	
КонецПроцедуры  //--АшаеваАН 29.01.26 ПРД.5

#КонецОбласти
