#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
//++AlopinAS 28.01.2026 ПРД.20
&После("ТоварыНоменклатураПриИзменении")
&НаКлиенте
Процедура cbr_ТоварыНоменклатураПриИзменении(Элемент)
//	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
КонецПроцедуры
//--AlopinAS 28.01.2026 ПРД.20

//++AlopinAS 28.01.2026 ПРД.20
&После("ТоварыХарактеристикаПриИзменении")
&НаКлиенте
Процедура cbr_ТоварыХарактеристикаПриИзменении(Элемент)
//	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
//	cbr_ТоварыРедактированиеНаСервере(ТекущаяСтрока);
КонецПроцедуры
//--AlopinAS 28.01.2026 ПРД.20

//++AlopinAS 28.01.2026 ПРД.20
//&После("ТоварыПриИзменении")
//&НаКлиенте
//Процедура cbr_ТоварыПриИзменении(Элемент)
//	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
//	cbr_ТоварыРедактированиеНаСервере(ТекущаяСтрока);
//КонецПроцедуры
//--AlopinAS 28.01.2026 ПРД.20
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++AlopinAS 28.01.2026 ПРД.20
&НаСервере
//Процедура cbr_ТоварыРедактированиеНаСервере(ТекущаяСтрока)
//	
//	ТекущаяСтрокаТч = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
//	ТекущаяСтрокаТч.СтрокаИзСоглашенияСКлиентом = Ложь;
//	
//	СтруктураПарамтеров = Новый Структура();
//	СтруктураПарамтеров.Вставить("Соглашение", Объект.Соглашение);
//	СтруктураПарамтеров.Вставить("Номенклатура", ТекущаяСтрокаТч.Номенклатура);
//	СтруктураПарамтеров.Вставить("Характеристика", ТекущаяСтрокаТч.Характеристика);
////	СтруктураПарамтеров.Вставить("ЕдиницаИзмерения",ТекущаяСтрокаТч.Упаковка);
//	СтрокаТчЦеныПоТоварам = ПолучитьТЧЦеныПоТоварам(СтруктураПарамтеров);
//	
//	Если ЗначениеЗаполнено(СтрокаТчЦеныПоТоварам) Тогда
//		ТекущаяСтрокаТч.ПроцентРучнойСкидки = СтрокаТчЦеныПоТоварам[0].ПрцентРучнаяСкидка; 
//		ТекущаяСтрокаТч.Цена = СтрокаТчЦеныПоТоварам[0].Цена;
//		ТекущаяСтрокаТч.ВидЦены = СтрокаТчЦеныПоТоварам[0].ВидЦены;
//		ТекущаяСтрокаТч.СтрокаИзСоглашенияСКлиентом = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры
//--AlopinAS 28.01.2026 ПРД.20

//++AlopinAS 28.01.2026 ПРД.20
&НаСервереБезКонтекста
Функция ПолучитьТЧЦеныПоТоварам(СтруктураПарамтеров)
	
	Если СтруктураПарамтеров.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено соглашение с клиентом'"));
		Возврат Неопределено;	
	КонецЕсли;
	
	Если СтруктураПарамтеров.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		
		ЕденицаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПарамтеров.Номенклатура, "ЕдиницаИзмерения");
	Иначе
		ЕденицаИзмерения = СтруктураПарамтеров.ЕдиницаИзмерения;
	КонецЕсли;	
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Количество КАК Количество,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ВидЦены КАК ВидЦены,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Цена КАК Цена,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ПрцентРучнаяСкидка КАК ПрцентРучнаяСкидка,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.СуммаРучнаяСкидка КАК СуммаРучнаяСкидка,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Сумма КАК Сумма,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
			|ИЗ
			|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
			|ГДЕ
			|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Ссылка
			|	И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура = &Номенклатура
			|	И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика = &Характеристика
			|	И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения = &ЕдиницаИзмерения";
		
		Запрос.УстановитьПараметр("Ссылка", СтруктураПарамтеров.Соглашение);
		Запрос.УстановитьПараметр("Номенклатура", СтруктураПарамтеров.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", СтруктураПарамтеров.Характеристика);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕденицаИзмерения);
		
		РезультатЗапроса = Запрос.Выполнить();
		Результат = РезультатЗапроса.Выгрузить();	
	
	Возврат Результат;
КонецФункции
//--AlopinAS 28.01.2026 ПРД.20
#КонецОбласти
