
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура cbr_ТранспортныйТарифПриИзменении(Команда) 
	
	ПересчитатьСтоимостьДоставки(,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура cbr_СтоимостьДоставкиСНДСПриИзменении(Команда)

    Объект.cbr_СтоимостьДоставкиБезНДС = Объект.cbr_СтоимостьДоставкиСНДС / 1.22;

	Если Объект.П3_МожноРедактироватьТранспортныеУсловия Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСтоимостьДоставки(Истина);
	
КонецПроцедуры 


&НаКлиенте
Процедура cbr_СтоимостьДоставкиБезНДСПриИзменении(Команда)
	
	Объект.cbr_СтоимостьДоставкиСНДС = Объект.cbr_СтоимостьДоставкиБезНДС * 1.22; 
	
	ПересчитатьСтоимостьДоставки(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьСтоимостьДоставки(ПересчитатьТариф = Ложь, ПересчитатьСтоимость = Ложь)
	
	Если ЗначениеЗаполнено(Объект.cbr_СтоимостьДоставкиСНДС) И ПересчитатьТариф Тогда
		
		Объект.cbr_ТранспортныйТариф = ?(ЭтаФорма.РеквизитВесТоваров = 0, 0, Объект.cbr_СтоимостьДоставкиСНДС / ЭтаФорма.РеквизитВесТоваров);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.cbr_ТранспортныйТариф) И ПересчитатьСтоимость Тогда 
		
		Объект.cbr_СтоимостьДоставкиСНДС = Объект.cbr_ТранспортныйТариф * ЭтаФорма.РеквизитВесТоваров;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.cbr_СтоимостьДоставкиСНДС) Тогда
		
		Объект.cbr_ТранспортныйТариф = ?(ЭтаФорма.РеквизитВесТоваров = 0, 0, Объект.cbr_СтоимостьДоставкиСНДС / ЭтаФорма.РеквизитВесТоваров);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


