
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура cbr_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ПодготовитьФорму();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФорму()
	

	Если ФормыУХ.ЭлементыФормыУХУжеСозданы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
												
	ЭлементГосзаказ = ФормыУХ.СоздатьПолеФормы(Элементы,
												"Госзаказ",
												"Госзаказ",
												"Объект.ГосЗаказ",
												ВидПоляФормы.ПолеФлажка,
												Элементы.СтраницаОсновное,
												Элементы.Комментарий);
												
	ПараметрЭлемента = Новый Структура("МногострочныйРежим, РастягиватьПоГоризонтали, РастягиватьПоВертикали, ПоложениеЗаголовка, Высота", 
										Истина, Истина, Ложь, ПоложениеЗаголовкаЭлементаФормы.Лево, 4);
	ЭлементСпецТребования = ФормыУХ.СоздатьПолеФормы(Элементы,
												"СпециальныеТребования",
												"Спец.требования",
												"Объект.СпециальныеТребования",
												,
												Элементы.СтраницаОсновное,
												Элементы.Комментарий,
												ПараметрЭлемента);
	
	Элементы.Статус.СписокВыбора.Очистить();
	Элементы.Статус.РежимВыбораИзСписка = Истина;
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.Формируется, "Формируется");
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.АктуализацияСпецификаций, "Актуализация спецификаций");
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству, "К производству"); 
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовНаПроизводство2_2.Закрыт, "Закрыт");
	
	УсловияВидимостиСпецтребований = Документы.СпециальныеТребования.УсловияВидимостиСпецтребований();
	УсловияВидимостиСпецтребований.Логистические = Ложь;
	УсловияВидимостиСпецтребований.Прочие = Ложь;
	Документы.СпециальныеТребования.ВывестиТаблицуСпецТребований(ЭтотОбъект, Элементы.Содержание, УсловияВидимостиСпецтребований, Объект.ДокументОснование);
	
	ИмяКомандыПересчитатьКоличествоУпаковок = "cbr_ПересчитатьКоличествоУпаковокк";
	Команда = ФормыУХ.СоздатьКоманду(ЭтотОбъект, ИмяКомандыПересчитатьКоличествоУпаковок, "", ИмяКомандыПересчитатьКоличествоУпаковок);
	
	ФормыУХ.СоздатьКнопкуФормы(Элементы, 
							  "cbr_ПересчитатьКоличествоУпаковок", 
							  НСтр("ru = 'Пересчитать количество в упаковках'"),
							  ИмяКомандыПересчитатьКоличествоУпаковок,
							  ВидКнопкиФормы.КнопкаКоманднойПанели,
							  Элементы.ПродукцияГруппаДеревоСпецификаций,
							  );

	РежимТолькоПросмотр = РежимТолькоПросмотр();
	Элементы.ПродукцияНоменклатураКод.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияНоменклатураТипНоменклатуры.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияНоменклатура.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияХарактеристика.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияАртикул.ТолькоПросмотр = РежимТолькоПросмотр;
    Элементы.ПродукцияНазначение.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияКоличествоУпаковок.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияУпаковкаЕдиницаИзмерения.ТолькоПросмотр = РежимТолькоПросмотр;
	Элементы.ПродукцияДатаПотребности.ТолькоПросмотр = РежимТолькоПросмотр;
	
	Элементы.ПродукцияРазбитьСтроку.Доступность = Не РежимТолькоПросмотр;

	Элементы.Продукция.УстановитьДействие("ПередУдалением", "Подключаемый_Продукция_ПередУдалением");
	Элементы.Продукция.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_Продукция_ПередНачаломДобавления");
	
	ФормыУХ.ЭлементыФормыУХДобавлены(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_Продукция_ПередУдалением(Элемент, Отказ)
	
	Отказ = РежимТолькоПросмотр();
	
	Если Отказ Тогда 
		ВызватьИсключение НСтр("ru = 'Запрещено удаление строки документа'");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_Продукция_ПередНачаломДобавления(Элемент, Отказ)
	
	Отказ = РежимТолькоПросмотр();
	
	Если Отказ Тогда 
    	ВызватьИсключение НСтр("ru = 'Запрещено добавление строки документа'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РежимТолькоПросмотр()
	
	Результат = Не Пользователи.РолиДоступны("П3_ИзменениеЗаказНаПроизводствоПродукция")
	            И (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента")
					Или ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление"));
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура cbr_ПересчитатьКоличествоУпаковок(Команда)
	
	cbr_ПересчитатьКоличествоУпаковокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура cbr_ПересчитатьКоличествоУпаковокНаСервере()
	
	СвойствоУпаковка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "УпаковкаРеквизитХарактеристики");
	МассивСвойств = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СвойствоУпаковка);
	
	Для Каждого СтрокаПродукции Из Объект.Продукция Цикл
		ТаблицаСвойствХарактеристик = УправлениеСвойствами.ЗначенияСвойств(СтрокаПродукции.Характеристика, Истина, , МассивСвойств);
		
		Если ТаблицаСвойствХарактеристик.Количество() Тогда
			ЗначениеСвойстваХарактеристика = ТаблицаСвойствХарактеристик[0].Значение;
			Если Не СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика Тогда
				КоэффициентУпаковки= Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки
				(ЗначениеСвойстваХарактеристика, СтрокаПродукции.Номенклатура);
				СтрокаПродукции.КоличествоУпаковок = СтрокаПродукции.КоличествоУпаковок / КоэффициентУпаковки;
				СтрокаПродукции.Упаковка = ЗначениеСвойстваХарактеристика;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры