#Область ОбработчикиСобытийФормы
&После("ПриСозданииНаСервере")
&НаСервере
Процедура cbr_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	
//	Элемент = УсловноеОформление.Элементы.Добавить();
		
//		ПолеОформления = Элемент.Поля.Элементы.Добавить();       
//        ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");
//        ПолеОформления.Использование = Истина;
//		
//		ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
//		ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
//        ГруппаЭлементовОтбора.Использование = Истина;
//		
//		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//        ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.cbr_НомерПаллета");  
//        ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;   
//        ЭлементОтбора.ПравоеЗначение = 0;   
//        ЭлементОтбора.Использование  = Истина;
//               
//        ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//        ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.cbr_Уровень");  
//        ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
//        ЭлементОтбора.ПравоеЗначение = 0;      
//        ЭлементОтбора.Использование  = Истина;
//
//		Элемент.УсловноеОформление.УстановитьЗначениеПараметра("Цвет", WebЦвета.Фиолетовый);		
	
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12
КонецПроцедуры

&После("ОбработкаПроверкиЗаполненияНаСервере")
&НаСервере
Процедура cbr_ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	Для каждого Строка из Объект.Товары цикл
		Если ЗначениеЗаполнено(Строка.cbr_НомерПаллета) 
		И НЕ ЗначениеЗаполнено(Строка.cbr_Уровень) Тогда
			
			Отказ = Истина;
			Сообщение = СтрШаблон("В строке %1 не заполнено колонка «Уровень»!", Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
		КонецЕсли;
	КонецЦикла;
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура cbr_РасставитьПродукциюПоПаллетам(Команда)
	
	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	Если Элементы.Товары.ВыделенныеСтроки.Количество() > 0 тогда

		ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("Владелец", ПредопределенноеЗначение("Справочник.НаборыУпаковок.cbr_Паллеты")));
		ОповещениеЗакрытия = Новый ОписаниеОповещения("cbr_ВыборПаллетаЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаВыбораЕдиницыИзмерения", ПараметрыОткрытия, ,,,,ОповещениеЗакрытия);
	
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выделите строки для расстановки на паллеты!");
	
	КонецЕсли;
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12	
	
КонецПроцедуры

&НаКлиенте
Процедура cbr_НомерПаллетаПриИзменении(Элемент)

	//++ cbr-larkovgeorg 10.02.2026 СКЛ.12
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные.cbr_НомерПаллета > Объект.cbr_КоличествоПаллет Тогда
		Объект.cbr_КоличествоПаллет = ТекущиеДанные.cbr_НомерПаллета;	
	КонецЕсли;
	//-- cbr-larkovgeorg 10.02.2026 СКЛ.12	
	
КонецПроцедуры

&НаКлиенте
Процедура cbr_ВыборПаллетаЗавершение(Результат, Параметры) Экспорт
	cbr_РасставитьПродукциюПоПаллетамНаСервере();	
КонецПроцедуры

&НаСервере
Процедура cbr_РасставитьПродукциюПоПаллетамНаСервере()
	
	ТоварыТЗ = Объект.Товары.Выгрузить();			
КонецПроцедуры
#КонецОбласти