
#Область СлужебныеПроцедурыИФункции

//++ БаженоваЕО 02.02.2026 ПРД.18
&НаКлиенте
Процедура cbr_ТЧПересечениеМенеджеровПроцентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.cbr_ТЧПересечениеМенеджеров.ТекущиеДанные;
	СуммаПроцента = ПолучитьСуммуПроцента(); 	 
	Если СуммаПроцента > 100 Тогда
		ТекущаяСтрока.Процент = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма процентов не может быть больше 100");
	КонецЕсли;
		
КонецПроцедуры //-- БаженоваЕО 02.02.2026

//++ БаженоваЕО 02.02.2026 ПРД.18
&НаСервере
Функция ПолучитьСуммуПроцента()
	  
	СуммаПроцента = 0;
	Для Каждого Стр Из Объект.cbr_ТЧПересечениеМенеджеров Цикл
		СуммаПроцента = СуммаПроцента + Стр.Процент;
	КонецЦикла;
	Возврат СуммаПроцента;
	
КонецФункции //-- БаженоваЕО 02.02.2026

#КонецОбласти