
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	
	ОграничитьТипЗначений();
		
КонецПроцедуры //-- cbr-larkovgeorg 25.02.26 СКЛ.12

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.cbr_ПредопределенныеЗначенияКонстант.ЕвроПаллет") 
		ИЛИ Объект.Ссылка = ПредопределенноеЗначение("Справочник.cbr_ПредопределенныеЗначенияКонстант.АмерПаллет") Тогда
			
		СтандартнаяОбработка = Ложь;
		
		Паллеты = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение(
			"Справочник.cbr_ПредопределенныеЗначенияКонстант.НаборУпаковокПаллеты"), "Значение");
			
		Если Паллеты <> Неопределено Тогда

			ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("Владелец", Паллеты));
			ОповещениеЗакрытия = Новый ОписаниеОповещения("cbr_ВыборПаллетаЗавершение", ЭтотОбъект);

			ОткрытьФорму("Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаВыбораУпаковки", ПараметрыОткрытия, , , , , ОповещениеЗакрытия);

		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры//-- cbr-larkovgeorg 25.02.26 СКЛ.12

&НаКлиенте
Процедура cbr_ВыборПаллетаЗавершение(Результат, Параметры) Экспорт
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	Если Результат <> Неопределено Тогда
		Объект.Значение = Результат;	
	КонецЕсли;
КонецПроцедуры//-- cbr-larkovgeorg 25.02.26 СКЛ.12
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОграничитьТипЗначений()
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	
	Если Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.НаборУпаковокПаллеты Тогда
		
		Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.НаборыУпаковок");
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
			
	ИначеЕсли Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.ЕвроПаллет 
		ИЛИ	Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.АмерПаллет Тогда
		
		Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
		
	КонецЕсли;
	
КонецПроцедуры //-- cbr-larkovgeorg 25.02.26 СКЛ.12

#КонецОбласти
