
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	
	ОграничитьТипЗначений();
		
КонецПроцедуры //-- cbr-larkovgeorg 25.02.26 СКЛ.12

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОграничитьТипЗначений()
	//++ cbr-larkovgeorg 25.02.26 СКЛ.12
	
	Если Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.Паллет Тогда
		
		Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
			
	ИначеЕсли Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.ЕвроПаллет 
		ИЛИ	Объект.Ссылка = Справочники.cbr_ПредопределенныеЗначенияКонстант.АмерПаллет Тогда
		
		Элементы.Значение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
		Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
		
	КонецЕсли;
	
КонецПроцедуры //-- cbr-larkovgeorg 25.02.26 СКЛ.12

#КонецОбласти
