#Область ОбработчикиСобытийФормы

//++ БаженоваЕО 09.02.2026 СКЛ.4
&НаКлиенте
Процедура cbr_ПриОткрытииПосле(Отказ)
	cbr_ЗаполнитьТаблицуТоваровКДоставке();
КонецПроцедуры //-- БаженоваЕО 09.02.2026

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМаршрут

&После("МаршрутОбъемПриИзменении")
&НаКлиенте
Процедура cbr_МаршрутОбъемПриИзменении(Элемент)
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	Объект.cbr_КоличествоПаллет = ИтоговоеКоличествоПаллетов();
	//--cbr-larkovgeorg 26.02.2026 СКЛ.12
КонецПроцедуры

&НаКлиенте
Процедура cbr_МаршрутПриИзмененииПосле(Элемент)
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	Объект.cbr_КоличествоПаллет = ИтоговоеКоличествоПаллетов();
	//--cbr-larkovgeorg 26.02.2026 СКЛ.12
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ БаженоваЕО 09.02.2026 СКЛ.4
&НаСервере
Процедура cbr_ЗаполнитьТаблицуТоваровКДоставке()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Распоряжения.Количество() Тогда
		Если ТипЗнч(Объект.Распоряжения[0].Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Номенклатура КАК Номенклатура,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Характеристика КАК Характеристика,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Назначение КАК Назначение,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Серия КАК Серия,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке.Остатки(, Распоряжение = &Распоряжение) КАК
			|		cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки";

			Запрос.УстановитьПараметр("Распоряжение", Объект.Распоряжения[0].Распоряжение);

			РезультатЗапроса = Запрос.Выполнить();

			Если Не РезультатЗапроса.Пустой() Тогда

				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

					ТоварыКДоставкеСтрока = ТоварыКДоставке.Добавить();
					ТоварыКДоставкеСтрока.Склад = Объект.Распоряжения[0].Распоряжение.Склад;
					ТоварыКДоставкеСтрока.Распоряжение = Объект.Распоряжения[0].Распоряжение;
					ТоварыКДоставкеСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					ТоварыКДоставкеСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					ТоварыКДоставкеСтрока.Назначение = ВыборкаДетальныеЗаписи.Назначение;
					ТоварыКДоставкеСтрока.Серия = ВыборкаДетальныеЗаписи.Серия;
					ТоварыКДоставкеСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;

				КонецЦикла;

			КонецЕсли;

		ИначеЕсли ТипЗнч(Объект.Распоряжения[0].Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Номенклатура КАК Номенклатура,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Характеристика КАК Характеристика,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Назначение КАК Назначение,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.Серия КАК Серия,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке.Остатки(, Распоряжение = &Распоряжение) КАК
			|		cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставкеОстатки";

			Запрос.УстановитьПараметр("Распоряжение", Объект.Распоряжения[0].Распоряжение);

			РезультатЗапроса = Запрос.Выполнить();

			Если Не РезультатЗапроса.Пустой() Тогда

				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

					ТоварыКДоставкеСтрока = ТоварыКДоставке.Добавить();
					ТоварыКДоставкеСтрока.Склад = Объект.Распоряжения[0].Распоряжение.Склад;
					ТоварыКДоставкеСтрока.Распоряжение = Объект.Распоряжения[0].Распоряжение;
					ТоварыКДоставкеСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					ТоварыКДоставкеСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					ТоварыКДоставкеСтрока.Назначение = ВыборкаДетальныеЗаписи.Назначение;
					ТоварыКДоставкеСтрока.Серия = ВыборкаДетальныеЗаписи.Серия;
					ТоварыКДоставкеСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;

				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //-- БаженоваЕО 09.02.2026

&НаСервере
Функция ИтоговоеКоличествоПаллетов()
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	ИтоговыйОбъем = Объект.Маршрут.Итог("Объем");
	КоличествоПаллетов = Цел(ИтоговыйОбъем/2.16) + 1;
	
	Возврат КоличествоПаллетов
	
КонецФункции//--cbr-larkovgeorg 26.02.2026 СКЛ.12

#КонецОбласти