#Область СлужебныеПроцедурыИФункции
//++ БаженоваЕО 05.02.2026 СКЛ.4
&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Объект.Дата = ТекущаяДата();
		Объект.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		Объект.Склад = ДанныеЗаполнения.Склад;
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.ЗаданиеВыполняет	= Перечисления.ТипыИсполнителейЗаданийНаПеревозку.cbr_НеУчаствуемВДоставке;
		Объект.Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Объект.Операция = Перечисления.ВидыДоставки.СоСклада;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			 Объект.Операция = Перечисления.ВидыДоставки.НаСклад;
		КонецЕсли;
		
		НоваяСтрока = Объект.Маршрут.Добавить();
		НоваяСтрока.Адрес = ДанныеЗаполнения.АдресДоставки;	
			
	КонецЕсли;
	
КонецПроцедуры //-- БаженоваЕО 05.02.2026 СКЛ.4

#КонецОбласти
