#Область СлужебныеПроцедурыИФункции

//++ БаженоваЕО 05.02.2026 СКЛ.4
&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Или ТипЗнч(ДанныеЗаполнения) = Тип(
		"ДокументСсылка.ЗаказПоставщику") Тогда

		Объект.Дата = ТекущаяДата();
		Объект.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		Объект.Склад = ДанныеЗаполнения.Склад;
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.ЗаданиеВыполняет	= Перечисления.ТипыИсполнителейЗаданийНаПеревозку.cbr_НеУчаствуемВДоставке;
		Объект.Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется;

		НоваяСтрокаМаршрут = Объект.Маршрут.Добавить();
		НоваяСтрокаМаршрут.Адрес = ДанныеЗаполнения.АдресДоставки;
		НоваяСтрокаМаршрут.КлючСвязи = Строка(Новый УникальныйИдентификатор);

		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда

			Объект.Операция = Перечисления.ВидыДоставки.СоСклада;

			НоваяСтрокаРаспоряжение = Объект.Распоряжения.Добавить();
			НоваяСтрокаРаспоряжение.КлючСвязи = НоваяСтрокаМаршрут.КлючСвязи;
			НоваяСтрокаРаспоряжение.Склад = ДанныеЗаполнения.Склад;
			НоваяСтрокаРаспоряжение.Распоряжение = ДанныеЗаполнения;
			НоваяСтрокаРаспоряжение.ПолучательОтправитель = ДанныеЗаполнения.Партнер;

		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

			Объект.Операция = Перечисления.ВидыДоставки.НаСклад;

			НоваяСтрокаРаспоряжение = Объект.Распоряжения.Добавить();
			НоваяСтрокаРаспоряжение.КлючСвязи = НоваяСтрокаМаршрут.КлючСвязи;
			НоваяСтрокаРаспоряжение.Склад = ДанныеЗаполнения.Склад;
			НоваяСтрокаРаспоряжение.Распоряжение = ДанныеЗаполнения;
			НоваяСтрокаРаспоряжение.ПолучательОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ДанныеЗаполнения.ДокументОснование, "Партнер");

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры //-- БаженоваЕО 05.02.2026 СКЛ.4

#КонецОбласти