&Перед("ОбработкаПроверкиЗаполнения")
Процедура cbr_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не  ЗначениеЗаполнено(cbr_КодFO) И Не ЗначениеЗаполнено(cbr_КодBitrix) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(cbr_КодFO) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "cbr_КодBitrix");
	ИначеЕсли ЗначениеЗаполнено(cbr_КодBitrix) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "cbr_КодFO");
	КонецЕсли;
	
КонецПроцедуры
