
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура cbr_ПодпискаНаПроведенияДокументовДляОтловаЛИМСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	Если ТипЗнч(Источник) = Тип("ДокументОбъект.лимсЗаявкаНаКонтроль") Тогда
	
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	лимсЗаявкаНаКонтроль.Ссылка КАК Ссылка,
		|	лимсЗаявкаНаКонтроль.ДокументОснование КАК ДокументОснование,
		|	лимсЗаявкаНаКонтроль.Дата КАК Дата
		|ИЗ
		|	Документ.лимсЗаявкаНаКонтроль КАК лимсЗаявкаНаКонтроль
		|ГДЕ
		|	лимсЗаявкаНаКонтроль.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда
			Попытка
				ДокументЭтапСсылка = РезультатЗапроса.ДокументОснование;
				ДокументЭтапОбъект = ДокументЭтапСсылка.ПоулчитьОбъект();
				ДокументЭтапОбъект.cbr_СтатусДоКонтроля = ДокументЭтапОбъект.Статус;
				ДокументЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.cbr_НаКонтроле;
				ДокументЭтапОбъект.cbr_ВремяКонтроля = -1;
				ДокументЭтапОбъект.cbr_ДатаДокументКотнроля = РезультатЗапроса.Дата;
				ДокументЭтапОбъект.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю("Ошибка записи контроля времени по документу «Заявка на контроль»");
				СобытиеЖурналаРегистрации = "Документы.ЭтапПроизводства2_2.Запись";
				ТекстСообщения = "Ошибка записи контроля времени по документу «Заявка на контроль»";
				ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			КонецПопытки;	
		КонецЕсли;	
			
	ИначеЕсли ТипЗнч(Источник)	= Тип("ДокументОбъект.лимсРегистрацияРезультатовКонтроля") Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	лимсРегистрацияРезультатовКонтроля.Ссылка КАК Ссылка,
		|	лимсРегистрацияРезультатовКонтроля.Дата КАК ДатаРегистрацияРезультатовКонтроля,
		|	лимсРегистрацияРезультатовКонтроля.ДокументОснование КАК ДокументОснование,
		|	лимсЗаявкаНаКонтроль.Дата КАК ДатаЗаявкаНаКонтроль
		|ИЗ
		|	Документ.лимсРегистрацияРезультатовКонтроля КАК лимсРегистрацияРезультатовКонтроля
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.лимсЗаявкаНаКонтроль КАК лимсЗаявкаНаКонтроль
		|		ПО (лимсРегистрацияРезультатовКонтроля.ДокументОснование = лимсЗаявкаНаКонтроль.ДокументОснование)
		|ГДЕ
		|	лимсРегистрацияРезультатовКонтроля.Ссылка = &Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда 
			Попытка
				ДокументЭтапСсылка = РезультатЗапроса.ДокументОснование;
				ДокументЭтапОбъект = ДокументЭтапСсылка.ПоулчитьОбъект();
				ДокументЭтапОбъект.Статус = ДокументЭтапОбъект.cbr_СтатусДоКонтроля;
				ДокументЭтапОбъект.cbr_ВремяКонтроля = Число(РезультатЗапроса.ДатаРегистрацияРезультатовКонтроля - РезультатЗапроса.ДатаЗаявкаНаКонтроль);
				ДокументЭтапОбъект.cbr_ДатаДокументКотнроля = РезультатЗапроса.ДатаРегистрацияРезультатовКонтроля;
				ДокументЭтапОбъект.Записать();
			Исключение
				ОбщегоНазначения.СообщитьПользователю("Ошибка записи контроля времени по документу «Регистрация результатов контроля»");
				СобытиеЖурналаРегистрации = "Документы.ЭтапПроизводства2_2.Запись";
				ТекстСообщения = "Ошибка записи контроля времени по документу «Регистрация результатов контроля»";
				ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			КонецПопытки;	
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

