#Область СлужебныеПроцедурыИФункции

//++АшаеваАН 06.02.26 ПРЗ.7
&НаСервере
Функция cbr_МаксимальноеЗначениеНомерГруппы() 
	
	ТЗДанныеТаблицы = Объект.ПланИтоги.Выгрузить(); 
	ТЗДанныеТаблицы.Сортировать("НомерГруппы УБЫВ");
	
	Возврат ТЗДанныеТаблицы[0].НомерГруппы;
	
КонецФункции //--АшаеваАН 06.02.26 ПРЗ.7

#КонецОбласти

#Область ОбработчикиКомандФормы

//++АшаеваАН 06.02.26 ПРЗ.7
&НаКлиенте
Процедура cbr_РазбитьСтроку(Команда) 
	
	ТекущаяСтрока = Элементы.ПланИтоги.ТекущиеДанные;
	
	ТребуетсяДо = ТекущаяСтрока.Требуется;
	КЗапускуДо = ТекущаяСтрока.КЗапуску;
	
	ТекущаяСтрока.Требуется = Окр(ТребуетсяДо/2,-1,РежимОкругления.Окр15как20);
	ТекущаяСтрока.КЗапуску = Окр((ТекущаяСтрока.Требуется*КЗапускуДо)/ТребуетсяДо,-1,РежимОкругления.Окр15как20);
	
	ПланИтогиПриИзменении();

	ТребуетсяПосле = ТребуетсяДо - ТекущаяСтрока.Требуется;
	КЗапускуПосле = КЗапускуДо - ТекущаяСтрока.КЗапуску;
	
	НовыйИндекс = Объект.ПланИтоги.Индекс(ТекущаяСтрока) + 1;
	НоваяСтрока = Объект.ПланИтоги.Вставить(НовыйИндекс);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	НоваяСтрока.Требуется = ТребуетсяПосле;
	НоваяСтрока.КЗапуску = КЗапускуПосле;
	НоваяСтрока.НомерГруппы = cbr_МаксимальноеЗначениеНомерГруппы() + 1;
	НоваяСтрока.ПланВХранилище = Ложь;
	НоваяСтрока.cbr_ЭтоКопия = Истина;

	Элементы.ПланИтоги.ТекущаяСтрока = Объект.ПланИтоги[НовыйИндекс].ПолучитьИдентификатор();
	ПланИтогиПриИзменении();
		
КонецПроцедуры //--АшаеваАН 06.02.26 ПРЗ.7
	
#КонецОбласти
