#Область СлужебныеПроцедурыИФункции

//++АшаеваАН 06.02.26 ПРЗ.7
&НаСервере
Функция cbr_МаксимальноеЗначениеНомерГруппы() 
	
	ТЗДанныеТаблицы = Объект.ПланИтоги.Выгрузить(); 
	ТЗДанныеТаблицы.Сортировать("НомерГруппы УБЫВ");
	
	Возврат ТЗДанныеТаблицы[0].НомерГруппы;
	
КонецФункции //--АшаеваАН 06.02.26 ПРЗ.7


&После("ПланИтогиСпецификацияПриИзменении")
&НаКлиенте
Процедура cbr_ПланИтогиСпецификацияПриИзменении(Элемент)
	
//	ТекущиеДанные = Элементы.ПланИтоги.ТекущиеДанные;
//	Если ЗначениеЗаполнено(ТекущиеДанные.Спецификация) 
//			И ТекущиеДанные.Отметка 
//			И ДанныеАктивнойСтроки.Свойство("МинимальнаяПартияВыпуска")
//			И ДанныеАктивнойСтроки.Свойство("КЗапуску") 
//			И ДанныеАктивнойСтроки.МинимальнаяПартияВыпуска> ДанныеАктивнойСтроки.КЗапуску Тогда
//		ТекущиеДанные.Спецификация = Неопределено;
//		ПланИтогиСпецификацияПриИзменении(Неопределено);
//	КонецЕсли;
	
КонецПроцедуры

&После("ЗаполнитьИнформационнуюСтроку")
&НаКлиенте
Процедура cbr_ЗаполнитьИнформационнуюСтроку()
	
	ТекущиеДанные = Элементы.ПланИтоги.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Спецификация) 
			И ТекущиеДанные.Отметка 
			И ДанныеАктивнойСтроки.Свойство("МинимальнаяПартияВыпуска")
			И ДанныеАктивнойСтроки.МинимальнаяПартияВыпуска > ТекущиеДанные.КЗапуску Тогда
		ТекстСообщения = НСтр("ru = 'Нельзя выбрать спецификацию %Спецификация%, так как минимальная партия выпуска превышает количество к запуску.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Спецификация%", ТекущиеДанные.Спецификация);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ТекущиеДанные.Спецификация = Неопределено;
		ПланИтогиСпецификацияПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("УстановитьФлажкиНоменклатурныйПлан")
&НаКлиенте
Процедура cbr_УстановитьФлажкиНоменклатурныйПлан(Команда)

	#Вставка
	Для каждого ИдентификаторСтроки Из Элементы.ПланИтоги.ВыделенныеСтроки Цикл
		Строка = Объект.ПланИтоги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(Строка.Спецификация) 
			И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Строка.Спецификация,"МинимальнаяПартияВыпуска") > Строка.КЗапуску Тогда
		ТекстСообщения = НСтр("ru = 'Нельзя выбрать спецификацию %Спецификация%, так как минимальная партия выпуска превышает количество к запуску.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Спецификация%", Строка.Спецификация);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Строка.Спецификация = Неопределено;
	КонецЕсли;
	КонецЦикла;
	#КонецВставки
	ИзменитьОтметкиВВыделенныхСтроках(Истина, Элементы.ПланИтоги.ВыделенныеСтроки);
	ЗаполнитьИнформационнуюСтроку();

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьКЗапускуПоПотребности")
&НаКлиенте
Процедура cbr_ЗаполнитьКЗапускуПоПотребности(Команда)

	ЗаполнитьКЗапускуВВыделенныхСтроках("Требуется", Элементы.ПланИтоги.ВыделенныеСтроки);
	#Вставка
	Для каждого ИдентификаторСтроки Из Элементы.ПланИтоги.ВыделенныеСтроки Цикл
		Строка = Объект.ПланИтоги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(Строка.Спецификация) 
			И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Строка.Спецификация,"МинимальнаяПартияВыпуска") > Строка.КЗапуску Тогда
		ТекстСообщения = НСтр("ru = 'Нельзя выбрать спецификацию %Спецификация%, так как минимальная партия выпуска превышает количество к запуску.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Спецификация%", Строка.Спецификация);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Строка.Спецификация = Неопределено;
	КонецЕсли;
	КонецЦикла;
	#КонецВставки
	ЗаполнитьИнформационнуюСтроку();

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьКЗапускуПоОбеспеченномуКоличеству")
&НаКлиенте
Процедура cbr_ЗаполнитьКЗапускуПоОбеспеченномуКоличеству(Команда)

	ЗаполнитьКЗапускуВВыделенныхСтроках("Обеспечено", Элементы.ПланИтоги.ВыделенныеСтроки);
	#Вставка
	Для каждого ИдентификаторСтроки Из Элементы.ПланИтоги.ВыделенныеСтроки Цикл
		Строка = Объект.ПланИтоги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(Строка.Спецификация) 
			И ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Строка.Спецификация,"МинимальнаяПартияВыпуска") > Строка.КЗапуску Тогда
		ТекстСообщения = НСтр("ru = 'Нельзя выбрать спецификацию %Спецификация%, так как минимальная партия выпуска превышает количество к запуску.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Спецификация%", Строка.Спецификация);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Строка.Спецификация = Неопределено;
	КонецЕсли;
	КонецЦикла;
	#КонецВставки
	ЗаполнитьИнформационнуюСтроку();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

//++АшаеваАН 06.02.26 ПРЗ.7
&НаКлиенте
Процедура cbr_РазбитьСтроку(Команда) 
	
	ТекущаяСтрока = Элементы.ПланИтоги.ТекущиеДанные;
	
	ТребуетсяДо = ТекущаяСтрока.Требуется;
	КЗапускуДо = ТекущаяСтрока.КЗапуску;
	
	ТекущаяСтрока.Требуется = Окр(ТребуетсяДо/2,-1,РежимОкругления.Окр15как20);
	ТекущаяСтрока.КЗапуску = Окр((ТекущаяСтрока.Требуется*КЗапускуДо)/ТребуетсяДо,-1,РежимОкругления.Окр15как20);
	
	ПланИтогиПриИзменении();

	ТребуетсяПосле = ТребуетсяДо - ТекущаяСтрока.Требуется;
	КЗапускуПосле = КЗапускуДо - ТекущаяСтрока.КЗапуску;
	
	НовыйИндекс = Объект.ПланИтоги.Индекс(ТекущаяСтрока) + 1;
	НоваяСтрока = Объект.ПланИтоги.Вставить(НовыйИндекс);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	НоваяСтрока.Требуется = ТребуетсяПосле;
	НоваяСтрока.КЗапуску = КЗапускуПосле;
	НоваяСтрока.НомерГруппы = cbr_МаксимальноеЗначениеНомерГруппы() + 1;
	НоваяСтрока.ПланВХранилище = Ложь;
	НоваяСтрока.cbr_ЭтоКопия = Истина;
	НоваяСтрока.Спецификация = Неопределено;

	Элементы.ПланИтоги.ТекущаяСтрока = Объект.ПланИтоги[НовыйИндекс].ПолучитьИдентификатор();
	ПланИтогиПриИзменении();
		
КонецПроцедуры //--АшаеваАН 06.02.26 ПРЗ.7
	
#КонецОбласти
