#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьОтгрузкуИЗаполнитьСерииВОбеспечении() Экспорт
	
	Для Каждого СтрокаОбеспечения Из ОбеспечениеМатериаламиИРаботами Цикл
		СтрокаОбеспечения.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// НАЧАЛО Османов Н.М. 22.11.2023 ЧТЗ №Действия в производстве
	Если ЗначениеЗаполнено(Спецификация) Тогда
		ЗаполнитьДействияПоСпецификации(ЭтотОбъект)
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 22.11.2023 ЧТЗ №Действия в производстве

КонецПроцедуры

&После("ПриЗаписи")
Процедура cbr_ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// НАЧАЛО Османов Н.М. 11.12.2023
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Распоряжение) Тогда
		Если ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Тогда
			РегистрыСведений.НормативныйГрафикЭтаповПроизводства.Рассчитать(Распоряжение);
		КонецЕсли;
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 11.12.2023
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;	
	
	//++ Мохов 24.02.2026 ПРЗ.30
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьяКалькуляции", Справочники.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());	
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество) КАК Количество,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ТД
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &Ссылка
	|	И НЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = &СтатьяКалькуляции
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТД.Количество КАК Количество,
	|	ВТ_ТД.Склад КАК Склад,
	|	ВТ_ТД.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток
	|ИЗ
	|	ВТ_ТД КАК ВТ_ТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментВремени, ) КАК ТоварыНаСкладахОстатки
	|		ПО (ВТ_ТД.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)";	
	ЗапросВыборка = Запрос.Выполнить().Выбрать();
	
	Предупреждение = Ложь;
	Пока ЗапросВыборка.Следующий() Цикл
		Если ЗапросВыборка.ВНаличииОстаток - ЗапросВыборка.Количество < 0 Тогда
			Предупреждение = Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если Предупреждение И ЭтоНовый() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Некоторые материалы отсутствуют на складе'"));		
	ИначеЕсли ЭтоНовый() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Материалы в наличии'"));		
	КонецЕсли;		
		
	//-- Мохов 24.02.2026 ПРЗ.30	
	
	// НАЧАЛО Османов Н.М. 25.12.2023 Действия в производстве
	Если Не ОбменДанными.Загрузка Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обеспечение.Номенклатура КАК Номенклатура,
		|	Обеспечение.Характеристика КАК Характеристика,
		|	Обеспечение.Упаковка КАК Упаковка,
		|	Обеспечение.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ОбеспечениеПредварительно
		|ИЗ
		|	&Обеспечение КАК Обеспечение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Действия.Номенклатура КАК Номенклатура,
		|	Действия.Характеристика КАК Характеристика,
		|	Действия.Упаковка КАК Упаковка,
		|	Действия.ВнесеноПлан КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ДействияПредварительно
		|ИЗ
		|	&Действия КАК Действия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбеспечениеПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ОбеспечениеПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Обеспечение
		|ИЗ
		|	ВТ_ОбеспечениеПредварительно КАК ВТ_ОбеспечениеПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбеспечениеПредварительно.Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДействияПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ДействияПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Действия
		|ИЗ
		|	ВТ_ДействияПредварительно КАК ВТ_ДействияПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДействияПредварительно.Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Действия.Номенклатура КАК Номенклатура,
		|	ВТ_Действия.Характеристика КАК Характеристика,
		|	ВТ_Действия.Упаковка КАК Упаковка,
		|	ВТ_Действия.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Разница
		|ИЗ
		|	ВТ_Действия КАК ВТ_Действия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Обеспечение.Номенклатура,
		|	ВТ_Обеспечение.Характеристика,
		|	ВТ_Обеспечение.Упаковка,
		|	-ВТ_Обеспечение.КоличествоУпаковок
		|ИЗ
		|	ВТ_Обеспечение КАК ВТ_Обеспечение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Разница.Номенклатура КАК Номенклатура,
		|	ВТ_Разница.Характеристика КАК Характеристика,
		|	ВТ_Разница.Упаковка КАК Упаковка,
		|	СУММА(ВТ_Разница.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	ВТ_Разница КАК ВТ_Разница
		|ГДЕ
		|	НЕ ВТ_Разница.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Разница.Номенклатура,
		|	ВТ_Разница.Характеристика,
		|	ВТ_Разница.Упаковка
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_Разница.КоличествоУпаковок) <> 0";
		
		Запрос.УстановитьПараметр("Обеспечение", ОбеспечениеМатериаламиИРаботами.Выгрузить());
		Запрос.УстановитьПараметр("Действия", Действия.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоУпаковок > 0 Тогда
				
				ТекстСообщения = НСтр("ru='ВНИМАНИЕ! По номенклатуре: %1 и характеристике: %2 Внесено (План) на вкладке Действия превышает количество из вкладки Материалы и работы'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Номенклатура, Выборка.Характеристика);
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				
			Иначе
				
				ТекстСообщения = НСтр("ru='Внимание! По номенклатуре: %1 и характеристике: %2 недостаточно количества Внесено (План) (%3) на вкладке Действия'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Номенклатура, Выборка.Характеристика, Выборка.КоличествоУпаковок);
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 25.12.2023 Действия в производстве
	
	// НАЧАЛО Османов Н.М. 27.09.2024
	Если Не Отказ Тогда
		
		СтатусыДляОчереди = Документы.ЭтапПроизводства2_2.СтатусыЭтаповДляОчереди();
		Если СтатусыДляОчереди.НайтиПоЗначению(Статус) = Неопределено Тогда
			
			Очередь = 0;
			
		Иначе
			
			Если Очередь = 0 Тогда
				Очередь = Документы.ЭтапПроизводства2_2.НовыйНомерОчереди();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 27.09.2024
	
	// НАЧАЛО Османов Н.М. 15.01.2025
	ПредыдущийСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
	
	Если Не Отказ 
		И Не ЭтоНовый()
		И Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И Не ПредыдущийСтатус = Статус Тогда
		
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.КВыполнению")
			Или (Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Начат")
					И ПредыдущийСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Сформирован"))
			Тогда
		
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										   НоменклатураСервер.ПараметрыУказанияСерий(
										   					  ЭтотОбъект, Документы.ЭтапПроизводства2_2));
			ИмяТЧСерии = ПараметрыУказанияСерий.ВыходныеИзделия.ИмяТЧСерии;
			
			ЕстьИзменения = Ложь;
			
			СтрокаССерией = Неопределено;
			Если ЭтотОбъект[ИмяТЧСерии].Количество() = 0 Тогда
			
				Если ИмяТЧСерии = "ВыходныеИзделияСерии"
					И ВыходныеИзделия.Количество() > 0
					Тогда
					
					СозданнаяСерия = Неопределено;
					Для Каждого СтрокаВыходногоИзделия Из ВыходныеИзделия Цикл
					
						ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаВыходногоИзделия.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
						ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаВыходногоИзделия.Номенклатура);
						ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаВыходногоИзделия.Характеристика);
					
						Если ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина Тогда						
							СтрокаССерией = ВыходныеИзделияСерии.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаССерией, СтрокаВыходногоИзделия);
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
							КонецЕсли;
							СтрокаССерией.Серия = СозданнаяСерия;
							ЕстьИзменения = Истина;
						КонецЕсли;
					
					КонецЦикла; 
					
				ИначеЕсли Не ИмяТЧСерии = "ВыходныеИзделияСерии" 
					И ВыходныеИзделия.Количество() > 0 
					Тогда
					
					СозданнаяСерия = Неопределено;
					Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
						
						ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
						ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаССерией.Номенклатура);
						ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаССерией.Характеристика);
						
						Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) 
							И ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина
							Тогда
							
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
							КонецЕсли;
							СтрокаССерией.Серия = СозданнаяСерия;
							ЕстьИзменения = Истина;
						Иначе
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СтрокаССерией.Серия;
							КонецЕсли;	
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
			
			Иначе
				
				СозданнаяСерия = Неопределено;
				Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
				
					ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
					ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаССерией.Номенклатура);
					ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаССерией.Характеристика);
					Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) 
						И ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина
						Тогда
						Если СозданнаяСерия = Неопределено Тогда
							СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
						КонецЕсли;
						СтрокаССерией.Серия = СозданнаяСерия;	
						ЕстьИзменения = Истина;
					Иначе
						Если СозданнаяСерия = Неопределено Тогда
							СозданнаяСерия = СтрокаССерией.Серия;
						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
			
			КонецЕсли;
			
			Если ЕстьИзменения Тогда
				ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ЭтотОбъект);
				НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий.ВыходныеИзделия);
			КонецЕсли;
			
	// НАЧАЛО Османов Н.М. 21.02.2025 
		ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Начат") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										   НоменклатураСервер.ПараметрыУказанияСерий(
										   					  ЭтотОбъект, Документы.ЭтапПроизводства2_2));
			ИмяТЧСерии = ПараметрыУказанияСерий.ВыходныеИзделия.ИмяТЧСерии;
			Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) Тогда
					Продолжить;					
				КонецЕсли;
				
				ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
				
				ОбъектСерия = СтрокаССерией.Серия.ПолучитьОбъект();
				ОбъектСерия.ДатаПроизводства = ФактическоеНачалоЭтапа;
				ОбъектСерия.ГоденДо = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ОбъектСерия.ДатаПроизводства,
																	 ДанныеПоНоменклатуре.СрокГодности,
																	 ДанныеПоНоменклатуре.ЕдиницаИзмеренияСрокаГодности);
																	 
				ОбъектСерия.Записать();
	
				
			КонецЦикла;
	// КОНЕЦ Османов Н.М. 21.02.2025 
			
		ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") Тогда
			
	//		ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
	//									   НоменклатураСервер.ПараметрыУказанияСерий(
	//									   					  ЭтотОбъект, Документы.ЭтапПроизводства2_2));
	//		ИмяТЧСерии = ПараметрыУказанияСерий.ВыходныеИзделия.ИмяТЧСерии;
	//		Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
	//			
	//			Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) Тогда
	//				Продолжить;					
	//			КонецЕсли;
	//			
	//			ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
	//																  "ВидНоменклатуры,
	//																  |СрокГодности,
	//																  |ЕдиницаИзмеренияСрокаГодности");
	//			
	//			ОбъектСерия = СтрокаССерией.Серия.ПолучитьОбъект();
	//			ОбъектСерия.ДатаПроизводства = ТекущаяДатаСеанса();
	//			ОбъектСерия.ГоденДо = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ОбъектСерия.ДатаПроизводства,
	//																 ДанныеПоНоменклатуре.СрокГодности,
	//																 ДанныеПоНоменклатуре.ЕдиницаИзмеренияСрокаГодности);
	//																 
	//			ОбъектСерия.Записать();
	//
	//			
	//		КонецЦикла;
				
		КонецЕсли;
	
	КонецЕсли;
	// КОНЕЦ Османов Н.М. 15.01.2025
		
КонецПроцедуры


&Перед("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	//++АшаеваАН 10.02.26 ПРЗ.13
	Если ДополнительныеСвойства.Свойство("cbr_МассивЭтапов") Тогда
		Для каждого ЭтапСсылка Из ДополнительныеСвойства.cbr_МассивЭтапов Цикл
			ЭтапОбъект = ЭтапСсылка.ПолучитьОбъект();
	        Если ЭтапОбъект.Проведен Тогда
	            ЭтапОбъект.ПометкаУдаления = Истина;
	            ЭтапОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	        Иначе    
	            ЭтапОбъект.УстановитьПометкуУдаления(Истина);
	        КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	//--АшаеваАН 10.02.26 ПРЗ.13
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьДействияПоСпецификации(ДокументОбъект)
	
	// НАЧАЛО Османов Н.М. 22.11.2023 ЧТЗ №Действия в производстве
	//КоличествоУпаковокПлан - из этапа
	//ВыходныеИзделия.КоличествоУпаковок - первая строка из ресурсной спецификации
	Если Спецификация.ВыходныеИзделия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Спецификация.ВыходныеИзделия[0].КоличествоУпаковок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериалов = ОбеспечениеМатериаламиИРаботами.Выгрузить( , "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок");
	ТаблицаМатериалов.Свернуть("Номенклатура,Характеристика,Упаковка", "КоличествоУпаковок");
	
	ТаблицаДобавленныхДействий = ТаблицаМатериалов.Скопировать();
	ТаблицаДобавленныхДействий.Колонки.Добавить("КоличествоВДействиях", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	КоэффициентПересчета = КоличествоУпаковокПлан / Спецификация.ВыходныеИзделия[0].КоличествоУпаковок;
	
	ОтборПоЭтапу = Новый Структура("Этап", Этап);
	ТаблицаДействий = Спецификация.Действия.Выгрузить(ОтборПоЭтапу);
	Для Каждого ДействиеСпецификации Из ТаблицаДействий Цикл
		
		НоваяСтрокаДействий = Действия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДействий, ДействиеСпецификации);
		НоваяСтрокаДействий.ВнесеноПлан = ДействиеСпецификации.КоличествоУпаковок * КоэффициентПересчета;

		ОтборПоДобавленнымДействиям = Новый Структура("Номенклатура,Характеристика,Упаковка");
		ЗаполнитьЗначенияСвойств(ОтборПоДобавленнымДействиям, ДействиеСпецификации);
		НайденнаяСтрокаДобавленныхДействий = ТаблицаДобавленныхДействий.НайтиСтроки(ОтборПоДобавленнымДействиям);
		Если НайденнаяСтрокаДобавленныхДействий.Количество() > 0 Тогда
			
			СтрокаДействия = НайденнаяСтрокаДобавленныхДействий[0];
			Если СтрокаДействия.КоличествоВДействиях + НоваяСтрокаДействий.ВнесеноПлан > СтрокаДействия.КоличествоУпаковок Тогда
				НоваяСтрокаДействий.ВнесеноПлан = СтрокаДействия.КоличествоУпаковок - СтрокаДействия.КоличествоВДействиях; 
			КонецЕсли;
			
			СтрокаДействия.КоличествоВДействиях = СтрокаДействия.КоличествоВДействиях + НоваяСтрокаДействий.ВнесеноПлан;
			
		КонецЕсли;			
		
		НоваяСтрокаДействий.Продолжительность = ДействиеСпецификации.Время;
		НоваяСтрокаДействий.ТемператураПлан = ДействиеСпецификации.Температура;
		НоваяСтрокаДействий.ДавлениеПлан = ДействиеСпецификации.Давление;
		НоваяСтрокаДействий.СкоростьВращенияПлан = ДействиеСпецификации.СкоростьВращения;
		
	КонецЦикла;
	
	Для Каждого СтрокаДобавленныхДействий Из ТаблицаДобавленныхДействий Цикл
		Если СтрокаДобавленныхДействий.КоличествоУпаковок > СтрокаДобавленныхДействий.КоличествоВДействиях Тогда 
			ОтборПоДействиям = Новый Структура("Номенклатура,Характеристика,Упаковка");
			ЗаполнитьЗначенияСвойств(ОтборПоДействиям, СтрокаДобавленныхДействий);
			НайденныеСтрокиДействий = Действия.НайтиСтроки(ОтборПоДействиям);
			Если НайденныеСтрокиДействий.Количество() > 0 Тогда
				СтрокаДействия = НайденныеСтрокиДействий[НайденныеСтрокиДействий.Количество() - 1];
				СтрокаДействия.ВнесеноПлан = СтрокаДействия.ВнесеноПлан + 
											СтрокаДобавленныхДействий.КоличествоУпаковок -
											СтрокаДобавленныхДействий.КоличествоВДействиях; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// КОНЕЦ Османов Н.М. 22.11.2023 ЧТЗ №Действия в производстве
	
КонецПроцедуры

Функция СоздатьСерию(ДанныеПоНоменклатуре)
	
	НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	НоваяСерия.Номер = РегистрыСведений.НомераСерийПоВидам.СледущийНомерСерии(ДанныеПоНоменклатуре.ВидНоменклатуры);
	НоваяСерия.ВидНоменклатуры = ДанныеПоНоменклатуре.ВидНоменклатуры;
	НоваяСерия.ДатаПроизводства = ТекущаяДатаСеанса();
	НоваяСерия.ГоденДо = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(НоваяСерия.ДатаПроизводства,
																		   ДанныеПоНоменклатуре.СрокГодности,
																		   ДанныеПоНоменклатуре.ЕдиницаИзмеренияСрокаГодности);
																		   
	НоваяСерия.ЗаполнитьСтатусГодностиВСерии(ДанныеПоНоменклатуре);
	
	НоваяСерия.Записать();
	
	Возврат НоваяСерия.Ссылка;
	
КонецФункции

//++ Мохов ПРЗ.19
//Процедура создания документа "Заявка на контроль" на основании данных этапа
Процедура cbr_СоздатьДокументЛимсЗаявкаНаКонтроль()
	ЗаявкаНаКонтрольОбъект = Документы.лимсЗаявкаНаКонтроль.СоздатьДокумент();
	ЗаявкаНаКонтрольОбъект.Заполнить(Ссылка);
	Если ЗаявкаНаКонтрольОбъект.ПроверитьЗаполнение() Тогда
		Попытка
			ЗаявкаНаКонтрольОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана!" + Символы.ПС + 
			ОписаниеОшибки());
			ЗаписьЖурналаРегистрации("Заявка на контроль не создана!" + Символы.ПС + 
			ОписаниеОшибки(),УровеньЖурналаРегистрации.Предупреждение,,,,);
		КонецПопытки;
	КонецЕсли;			
КонецПроцедуры	//-- Мохов ПРЗ.19


// +-Алейников М.Н. 04.04.2025
&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	//++ Мохов ПРЗ.19
	//Переменная для контроля заполненности значений для создания документа
	ЗаявкаНаКонтрольОтказ = Ложь;		
	
	ОсновноеИзделиеЭтап = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация,"ОсновноеИзделиеЭтап");	
	лимсОперативныйКонтроль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеИзделиеЭтап,"лимсОперативныйКонтроль");
	лимсВидыПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеИзделиеЭтап,"ЛимсВидыПроверки").Выгрузить();
	//Контроль заполненности значений
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Статус");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Статус",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;			
	ИначеЕсли НЕ ЗначениеЗаполнено(Спецификация) Тогда	
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Спецификация");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Спецификация",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;	
	ИначеЕсли НЕ ЗначениеЗаполнено(лимсОперативныйКонтроль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Оперативный контроль в Основное изделие");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Оперативный контроль в Основное изделие",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;	
	ИначеЕсли ВыходныеИзделия.Количество() = 0 Тогда	
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение таблицы Выходные изделия");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения таблицы Выходные изделия",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;			
	ИначеЕсли лимсВидыПроверки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение таблицы Виды проверки в Основное изделие");
		ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения таблицы Виды проверки в Основное изделие",
		УровеньЖурналаРегистрации.Предупреждение,,,,);					
		ЗаявкаНаКонтрольОтказ =  Истина;
	КонецЕсли;
	//Получение значения НЕ предопределнного значения спрвочника
	ЛимсВидПроверкиСсылка	= Справочники.cbr_ПредопределенныеЗначенияКонстант.ВыходнойКонтроль;
	ЛимсВидПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛимсВидПроверкиСсылка,"Значение");		
	//Проверка значений реквизитов по услвоиям для создания документа на основании
	Если НЕ ЗаявкаНаКонтрольОтказ 
		И лимсОперативныйКонтроль = истина
		И ЛимсВидыПроверки[0].ВидПроверки = ЛимсВидПроверки
		И Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат Тогда				
			//Проверека на произведенность изделий
			Если НЕ ВыходныеИзделия.Найти(Ложь,"Произведено") = Неопределено Тогда		
				Запрос = новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	лимсЗаявкаНаКонтроль.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.лимсЗаявкаНаКонтроль КАК лимсЗаявкаНаКонтроль
				|ГДЕ
				|	НЕ лимсЗаявкаНаКонтроль.ПометкаУдаления 
				|	И лимсЗаявкаНаКонтроль.Проведен
				|	И лимсЗаявкаНаКонтроль.ДокументОснование = &ДокументОснование";
				Запрос.Установитьпараметры("ДокументОснование","Ссылка");
				РезультатЗапрос = Запрос.Выполнить().Выбрать();
				//Првоверяем, был ли уже создан смежный документ
				Если РезультатЗапрос.Следующий() Тогда
					ОбщегоНазначения.СообщитьПользователю("По данному этапу производства уже создана заявка на контроль:"
					 + РезультатЗапрос.Ссылка);
				//Если нет, делаем новый
				Иначе					
					cbr_СоздатьДокументЛимсЗаявкаНаКонтроль();							
				КонецЕсли;
			Иначе 
				ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! В таблице Выходные изделия не все элемнеты имеют свойство "+"Произведено" +"!");
				ЗаписьЖурналаРегистрации("Заявка на контроль не создана! В таблице Выходные изделия не все элемнеты имеют свойство "+"Произведено" +"!",
				УровеньЖурналаРегистрации.Предупреждение,,,,);						
			КонецЕсли;		
	КонецЕсли;	
	//-- Мохов 06.02.2026 ПРЗ.19
	
	// НАЧАЛО Османов Н.М. 05.09.2025 
	НовыеДокументыРасходныхОрдеров = Документы.РасходныйОрдерНаТовары.СоздатьРасходныеОрдераИзЭтапа(ЭтотОбъект);
	Для Каждого ДокументРасходныйОрдер Из НовыеДокументыРасходныхОрдеров Цикл
		Документы.ОтборРазмещениеТоваров.СоздатьОтборРазмещениеИзРасходногоОрдера(ДокументРасходныйОрдер);
	КонецЦикла;
	
	// КОНЕЦ Османов Н.М. 05.09.2025 
	
	Если Не Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда 
		Возврат;
	КонецЕсли;	
	
	//Мохов ПРЗ.19
	//Если тпсКонтролиЭтапов.ЕстьЗаявкаНаКонтрольПоЭтапуПроизводства(Ссылка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ВидНоменклатуры = Неопределено;
	
	Если Не ВыходныеИзделия.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = ВыходныеИзделия[0].Номенклатура;
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат;			
	КонецЕсли;
	
	ЭтоПолуфабрикат = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
	
	Если Не (ЭтоПолуфабрикат = Ложь Или ЭтоПолуфабрикат = Неопределено) Тогда
		Возврат;	
	КонецЕсли; 
	
	//ЗаявкаНаКонтрольОбъект = Документы.лимсЗаявкаНаКонтроль.СоздатьДокумент();
	//ЗаявкаНаКонтрольОбъект.Заполнить(Ссылка);
	//ЗаявкаНаКонтрольОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли