#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьОтгрузкуИЗаполнитьСерииВОбеспечении() Экспорт
	
	Для Каждого СтрокаОбеспечения Из ОбеспечениеМатериаламиИРаботами Цикл
		СтрокаОбеспечения.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Спецификация) Тогда
		ЗаполнитьДействияПоСпецификации(ЭтотОбъект)
	КонецЕсли;

КонецПроцедуры

&После("ПриЗаписи")
Процедура cbr_ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Распоряжение) Тогда
		Если ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство") Тогда
			РегистрыСведений.НормативныйГрафикЭтаповПроизводства.Рассчитать(Распоряжение);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;	
	
	//++ Мохов ПРЗ.18 13.03.2026 доработка
	Если ЭтоНовый() Тогда
		cbr_СтатусКонтроля = Перечисления.cbr_СтаутсыКонтроляЭтаповПроизводства.КонтрольНеВводился;
		cbr_ВремяКонтроля = 0;	
	ИначеЕсли cbr_СтатусКонтроля = Перечисления.cbr_СтаутсыКонтроляЭтаповПроизводства.КонтрольНачат Тогда
		cbr_ДатаНачалоКонтроля = ТекущаяДатаСеанса();
		cbr_ДатаОкончаниеКонтроля = Дата(1,1,1);	
	ИначеЕсли cbr_СтатусКонтроля = Перечисления.cbr_СтаутсыКонтроляЭтаповПроизводства.КонтрольОкончен Тогда
		cbr_ДатаОкончаниеКонтроля = ТекущаяДатаСеанса();
		СтароеЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"cbr_СтатусКонтроля");
		Если СтароеЗначение = Перечисления.cbr_СтаутсыКонтроляЭтаповПроизводства.КонтрольНачат Тогда
			cbr_ВремяКонтроля = cbr_ВремяКонтроля + Число(cbr_ДатаОкончаниеКонтроля - cbr_ДатаНачалоКонтроля);
			cbr_ДатаНачалоКонтроля = Дата(1,1,1);
			cbr_ДатаОкончаниеКонтроля = Дата(1,1,1);			
		КонецЕсли;	
	КонецЕсли;		
	//-- Мохов ПРЗ.18 13.03.2026	
	
	//++ Мохов 24.02.2026 ПРЗ.30
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьяКалькуляции", Справочники.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());	
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество) КАК Количество,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ТД
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = &Ссылка
	|	И НЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = &СтатьяКалькуляции
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТД.Количество КАК Количество,
	|	ВТ_ТД.Склад КАК Склад,
	|	ВТ_ТД.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток
	|ИЗ
	|	ВТ_ТД КАК ВТ_ТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментВремени, ) КАК ТоварыНаСкладахОстатки
	|		ПО (ВТ_ТД.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)";	
	ЗапросВыборка = Запрос.Выполнить().Выбрать();
	
	Предупреждение = Ложь;
	Пока ЗапросВыборка.Следующий() Цикл
		Если ЗапросВыборка.ВНаличииОстаток - ЗапросВыборка.Количество < 0 Тогда
			Предупреждение = Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если Предупреждение И ЭтоНовый() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Некоторые материалы отсутствуют на складе'"));		
	ИначеЕсли ЭтоНовый() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Материалы в наличии'"));		
	КонецЕсли;		
		
	//-- Мохов 24.02.2026 ПРЗ.30	
	
	Если Не ОбменДанными.Загрузка Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обеспечение.Номенклатура КАК Номенклатура,
		|	Обеспечение.Характеристика КАК Характеристика,
		|	Обеспечение.Упаковка КАК Упаковка,
		|	Обеспечение.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ОбеспечениеПредварительно
		|ИЗ
		|	&Обеспечение КАК Обеспечение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Действия.Номенклатура КАК Номенклатура,
		|	Действия.Характеристика КАК Характеристика,
		|	Действия.Упаковка КАК Упаковка,
		|	Действия.ВнесеноПлан КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ДействияПредварительно
		|ИЗ
		|	&Действия КАК Действия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбеспечениеПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ОбеспечениеПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Обеспечение
		|ИЗ
		|	ВТ_ОбеспечениеПредварительно КАК ВТ_ОбеспечениеПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбеспечениеПредварительно.Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДействияПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ДействияПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Действия
		|ИЗ
		|	ВТ_ДействияПредварительно КАК ВТ_ДействияПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДействияПредварительно.Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Действия.Номенклатура КАК Номенклатура,
		|	ВТ_Действия.Характеристика КАК Характеристика,
		|	ВТ_Действия.Упаковка КАК Упаковка,
		|	ВТ_Действия.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Разница
		|ИЗ
		|	ВТ_Действия КАК ВТ_Действия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Обеспечение.Номенклатура,
		|	ВТ_Обеспечение.Характеристика,
		|	ВТ_Обеспечение.Упаковка,
		|	-ВТ_Обеспечение.КоличествоУпаковок
		|ИЗ
		|	ВТ_Обеспечение КАК ВТ_Обеспечение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Разница.Номенклатура КАК Номенклатура,
		|	ВТ_Разница.Характеристика КАК Характеристика,
		|	ВТ_Разница.Упаковка КАК Упаковка,
		|	СУММА(ВТ_Разница.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	ВТ_Разница КАК ВТ_Разница
		|ГДЕ
		|	НЕ ВТ_Разница.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Разница.Номенклатура,
		|	ВТ_Разница.Характеристика,
		|	ВТ_Разница.Упаковка
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_Разница.КоличествоУпаковок) <> 0";
		
		Запрос.УстановитьПараметр("Обеспечение", ОбеспечениеМатериаламиИРаботами.Выгрузить());
		Запрос.УстановитьПараметр("Действия", Действия.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоУпаковок > 0 Тогда
				
				ТекстСообщения = НСтр("ru='ВНИМАНИЕ! По номенклатуре: %1 и характеристике: %2 Внесено (План) на вкладке Действия превышает количество из вкладки Материалы и работы'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Номенклатура, Выборка.Характеристика);
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				
			Иначе
				
				ТекстСообщения = НСтр("ru='Внимание! По номенклатуре: %1 и характеристике: %2 недостаточно количества Внесено (План) (%3) на вкладке Действия'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Номенклатура, Выборка.Характеристика, Выборка.КоличествоУпаковок);
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Если Не Отказ Тогда
		
		СтатусыДляОчереди = Документы.ЭтапПроизводства2_2.СтатусыЭтаповДляОчереди();
		Если СтатусыДляОчереди.НайтиПоЗначению(Статус) = Неопределено Тогда
			
			Очередь = 0;
			
		Иначе
			
			Если Очередь = 0 Тогда
				Очередь = Документы.ЭтапПроизводства2_2.НовыйНомерОчереди();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПредыдущийСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
	
	Если Не Отказ 
		И Не ЭтоНовый()
		И Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И Не ПредыдущийСтатус = Статус Тогда
		
		Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.КВыполнению")
			Или (Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Начат")
					И ПредыдущийСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Сформирован"))
			Тогда
		
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										   НоменклатураСервер.ПараметрыУказанияСерий(
										   					  ЭтотОбъект, Документы.ЭтапПроизводства2_2));
			ИмяТЧСерии = ПараметрыУказанияСерий.ВыходныеИзделия.ИмяТЧСерии;
			
			ЕстьИзменения = Ложь;
			
			СтрокаССерией = Неопределено;
			Если ЭтотОбъект[ИмяТЧСерии].Количество() = 0 Тогда
			
				Если ИмяТЧСерии = "ВыходныеИзделияСерии"
					И ВыходныеИзделия.Количество() > 0
					Тогда
					
					СозданнаяСерия = Неопределено;
					Для Каждого СтрокаВыходногоИзделия Из ВыходныеИзделия Цикл
					
						ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаВыходногоИзделия.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
						ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаВыходногоИзделия.Номенклатура);
						ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаВыходногоИзделия.Характеристика);
					
						Если ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина Тогда						
							СтрокаССерией = ВыходныеИзделияСерии.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаССерией, СтрокаВыходногоИзделия);
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
							КонецЕсли;
							СтрокаССерией.Серия = СозданнаяСерия;
							ЕстьИзменения = Истина;
						КонецЕсли;
					
					КонецЦикла; 
					
				ИначеЕсли Не ИмяТЧСерии = "ВыходныеИзделияСерии" 
					И ВыходныеИзделия.Количество() > 0 
					Тогда
					
					СозданнаяСерия = Неопределено;
					Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
						
						ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
						ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаССерией.Номенклатура);
						ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаССерией.Характеристика);
						
						Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) 
							И ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина
							Тогда
							
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
							КонецЕсли;
							СтрокаССерией.Серия = СозданнаяСерия;
							ЕстьИзменения = Истина;
						Иначе
							Если СозданнаяСерия = Неопределено Тогда
								СозданнаяСерия = СтрокаССерией.Серия;
							КонецЕсли;	
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
			
			Иначе
				
				СозданнаяСерия = Неопределено;
				Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
				
					ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |ВидНоменклатуры.ИспользоватьСерии,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
					ДанныеПоНоменклатуре.Вставить("Номенклатура", СтрокаССерией.Номенклатура);
					ДанныеПоНоменклатуре.Вставить("Характеристика", СтрокаССерией.Характеристика);
					Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) 
						И ДанныеПоНоменклатуре.ВидНоменклатурыИспользоватьСерии = Истина
						Тогда
						Если СозданнаяСерия = Неопределено Тогда
							СозданнаяСерия = СоздатьСерию(ДанныеПоНоменклатуре);
						КонецЕсли;
						СтрокаССерией.Серия = СозданнаяСерия;	
						ЕстьИзменения = Истина;
					Иначе
						Если СозданнаяСерия = Неопределено Тогда
							СозданнаяСерия = СтрокаССерией.Серия;
						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
			
			КонецЕсли;
			
			Если ЕстьИзменения Тогда
				ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ЭтотОбъект);
				НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий.ВыходныеИзделия);
			КонецЕсли;
			
		ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Начат") Тогда
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
										   НоменклатураСервер.ПараметрыУказанияСерий(
										   					  ЭтотОбъект, Документы.ЭтапПроизводства2_2));
			ИмяТЧСерии = ПараметрыУказанияСерий.ВыходныеИзделия.ИмяТЧСерии;
			Для Каждого СтрокаССерией Из ЭтотОбъект[ИмяТЧСерии] Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаССерией.Серия) Тогда
					Продолжить;					
				КонецЕсли;
				
				ДанныеПоНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаССерией.Номенклатура, 
																	  "ВидНоменклатуры,
																	  |СрокГодности,
																	  |ЕдиницаИзмеренияСрокаГодности");
				
				ОбъектСерия = СтрокаССерией.Серия.ПолучитьОбъект();
				ОбъектСерия.ДатаПроизводства = ФактическоеНачалоЭтапа;
				ОбъектСерия.ГоденДо = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ОбъектСерия.ДатаПроизводства,
																	 ДанныеПоНоменклатуре.СрокГодности,
																	 ДанныеПоНоменклатуре.ЕдиницаИзмеренияСрокаГодности);
																	 
				ОбъектСерия.Записать();
	
				
			КонецЦикла;
				
		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	
	
	//++АшаеваАН 10.02.26 ПРЗ.13
	Если ДополнительныеСвойства.Свойство("cbr_МассивЭтапов") Тогда
		Для каждого ЭтапСсылка Из ДополнительныеСвойства.cbr_МассивЭтапов Цикл
			ЭтапОбъект = ЭтапСсылка.ПолучитьОбъект();
	        Если ЭтапОбъект.Проведен Тогда
	            ЭтапОбъект.ПометкаУдаления = Истина;
	            ЭтапОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	        Иначе    
	            ЭтапОбъект.УстановитьПометкуУдаления(Истина);
	        КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	//--АшаеваАН 10.02.26 ПРЗ.13
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьДействияПоСпецификации(ДокументОбъект)
	
	//КоличествоУпаковокПлан - из этапа
	//ВыходныеИзделия.КоличествоУпаковок - первая строка из ресурсной спецификации
	Если Спецификация.ВыходныеИзделия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Спецификация.ВыходныеИзделия[0].КоличествоУпаковок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериалов = ОбеспечениеМатериаламиИРаботами.Выгрузить( , "Номенклатура,Характеристика,Упаковка,КоличествоУпаковок");
	ТаблицаМатериалов.Свернуть("Номенклатура,Характеристика,Упаковка", "КоличествоУпаковок");
	
	ТаблицаДобавленныхДействий = ТаблицаМатериалов.Скопировать();
	ТаблицаДобавленныхДействий.Колонки.Добавить("КоличествоВДействиях", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	КоэффициентПересчета = КоличествоУпаковокПлан / Спецификация.ВыходныеИзделия[0].КоличествоУпаковок;
	
	ОтборПоЭтапу = Новый Структура("Этап", Этап);
	ТаблицаДействий = Спецификация.Действия.Выгрузить(ОтборПоЭтапу);
	Для Каждого ДействиеСпецификации Из ТаблицаДействий Цикл
		
		НоваяСтрокаДействий = Действия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДействий, ДействиеСпецификации);
		НоваяСтрокаДействий.ВнесеноПлан = ДействиеСпецификации.КоличествоУпаковок * КоэффициентПересчета;

		ОтборПоДобавленнымДействиям = Новый Структура("Номенклатура,Характеристика,Упаковка");
		ЗаполнитьЗначенияСвойств(ОтборПоДобавленнымДействиям, ДействиеСпецификации);
		НайденнаяСтрокаДобавленныхДействий = ТаблицаДобавленныхДействий.НайтиСтроки(ОтборПоДобавленнымДействиям);
		Если НайденнаяСтрокаДобавленныхДействий.Количество() > 0 Тогда
			
			СтрокаДействия = НайденнаяСтрокаДобавленныхДействий[0];
			Если СтрокаДействия.КоличествоВДействиях + НоваяСтрокаДействий.ВнесеноПлан > СтрокаДействия.КоличествоУпаковок Тогда
				НоваяСтрокаДействий.ВнесеноПлан = СтрокаДействия.КоличествоУпаковок - СтрокаДействия.КоличествоВДействиях; 
			КонецЕсли;
			
			СтрокаДействия.КоличествоВДействиях = СтрокаДействия.КоличествоВДействиях + НоваяСтрокаДействий.ВнесеноПлан;
			
		КонецЕсли;			
		
		НоваяСтрокаДействий.Продолжительность = ДействиеСпецификации.Время;
		НоваяСтрокаДействий.ТемператураПлан = ДействиеСпецификации.Температура;
		НоваяСтрокаДействий.ДавлениеПлан = ДействиеСпецификации.Давление;
		НоваяСтрокаДействий.СкоростьВращенияПлан = ДействиеСпецификации.СкоростьВращения;
		
	КонецЦикла;
	
	Для Каждого СтрокаДобавленныхДействий Из ТаблицаДобавленныхДействий Цикл
		Если СтрокаДобавленныхДействий.КоличествоУпаковок > СтрокаДобавленныхДействий.КоличествоВДействиях Тогда 
			ОтборПоДействиям = Новый Структура("Номенклатура,Характеристика,Упаковка");
			ЗаполнитьЗначенияСвойств(ОтборПоДействиям, СтрокаДобавленныхДействий);
			НайденныеСтрокиДействий = Действия.НайтиСтроки(ОтборПоДействиям);
			Если НайденныеСтрокиДействий.Количество() > 0 Тогда
				СтрокаДействия = НайденныеСтрокиДействий[НайденныеСтрокиДействий.Количество() - 1];
				СтрокаДействия.ВнесеноПлан = СтрокаДействия.ВнесеноПлан + 
											СтрокаДобавленныхДействий.КоличествоУпаковок -
											СтрокаДобавленныхДействий.КоличествоВДействиях; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьСерию(ДанныеПоНоменклатуре)
	
	НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	НоваяСерия.Номер = РегистрыСведений.НомераСерийПоВидам.СледущийНомерСерии(ДанныеПоНоменклатуре.ВидНоменклатуры);
	НоваяСерия.ВидНоменклатуры = ДанныеПоНоменклатуре.ВидНоменклатуры;
	НоваяСерия.ДатаПроизводства = ТекущаяДатаСеанса();
	НоваяСерия.ГоденДо = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(НоваяСерия.ДатаПроизводства,
																		   ДанныеПоНоменклатуре.СрокГодности,
																		   ДанныеПоНоменклатуре.ЕдиницаИзмеренияСрокаГодности);
																		   
	НоваяСерия.ЗаполнитьСтатусГодностиВСерии(ДанныеПоНоменклатуре);
	
	НоваяСерия.Записать();
	
	Возврат НоваяСерия.Ссылка;
	
КонецФункции

//++ Мохов ПРЗ.19
//Процедура создания документа "Заявка на контроль" на основании данных этапа
Процедура cbr_СоздатьДокументЛимсЗаявкаНаКонтроль()
	ЗаявкаНаКонтрольОбъект = Документы.лимсЗаявкаНаКонтроль.СоздатьДокумент();
	ЗаявкаНаКонтрольОбъект.Заполнить(Ссылка);
	Если ЗаявкаНаКонтрольОбъект.ПроверитьЗаполнение() Тогда
		Попытка
			ЗаявкаНаКонтрольОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана!" + Символы.ПС + 
			ОписаниеОшибки());
			ЗаписьЖурналаРегистрации("Заявка на контроль не создана!" + Символы.ПС + 
			ОписаниеОшибки(),УровеньЖурналаРегистрации.Предупреждение,,,,);
		КонецПопытки;
	КонецЕсли;			
КонецПроцедуры	//-- Мохов ПРЗ.19


&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	//++ Мохов ПРЗ.19 05.03.26
	ЗаявкаНаКонтрольОтказ = Ложь;		
	ОсновноеИзделиеЭтап = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация,"ОсновноеИзделиеЭтап");	
	лимсОперативныйКонтроль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеИзделиеЭтап,"лимсОперативныйКонтроль");
	лимсВидыПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеИзделиеЭтап,"ЛимсВидыПроверки").Выгрузить();

	Если Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат И НЕ ВыходныеИзделия.Количество() = 0 Тогда
		Если ВыходныеИзделия.Найти(Ложь,"Произведено") = Неопределено Тогда				
			Если НЕ ЗначениеЗаполнено(Спецификация) Тогда	
				ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Спецификация");
				ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Спецификация",
				УровеньЖурналаРегистрации.Предупреждение,,,,);					
				ЗаявкаНаКонтрольОтказ =  Истина;	
			ИначеЕсли НЕ ЗначениеЗаполнено(лимсОперативныйКонтроль) Тогда
				ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение реквизита Оперативный контроль в Основное изделие");
				ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения реквизита Оперативный контроль в Основное изделие",
				УровеньЖурналаРегистрации.Предупреждение,,,,);					
				ЗаявкаНаКонтрольОтказ =  Истина;				
			ИначеЕсли лимсВидыПроверки.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Заявка на контроль не создана! Проверьте заполнение таблицы Виды проверки в Основное изделие");
				ЗаписьЖурналаРегистрации("Заявка на контроль не создана! Ошибка заполнения таблицы Виды проверки в Основное изделие",
				УровеньЖурналаРегистрации.Предупреждение,,,,);					
				ЗаявкаНаКонтрольОтказ =  Истина;
			КонецЕсли;
			
			ЛимсВидПроверкиСсылка	= Справочники.cbr_ПредопределенныеЗначенияКонстант.ВыходнойКонтроль;
			ЛимсВидПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛимсВидПроверкиСсылка,"Значение");
					
			Если НЕ ЗаявкаНаКонтрольОтказ 
				И лимсОперативныйКонтроль = истина
				И ЛимсВидыПроверки[0].ВидПроверки = ЛимсВидПроверки	Тогда				
					Запрос = новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					|	лимсЗаявкаНаКонтроль.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.лимсЗаявкаНаКонтроль КАК лимсЗаявкаНаКонтроль
					|ГДЕ
					|	НЕ лимсЗаявкаНаКонтроль.ПометкаУдаления 
					|	И лимсЗаявкаНаКонтроль.Проведен
					|	И лимсЗаявкаНаКонтроль.ДокументОснование = &ДокументОснование";
					Запрос.Установитьпараметры("ДокументОснование",Ссылка);
					РезультатЗапрос = Запрос.Выполнить().Выбрать();
					Если РезультатЗапрос.Следующий() Тогда
						ОбщегоНазначения.СообщитьПользователю("По данному этапу производства уже создана заявка на контроль:"
						 + РезультатЗапрос.Ссылка);
					Иначе					
						cbr_СоздатьДокументЛимсЗаявкаНаКонтроль();							
					КонецЕсли;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	//-- Мохов 05.03.2026 ПРЗ.19
	
	НовыеДокументыРасходныхОрдеров = Документы.РасходныйОрдерНаТовары.СоздатьРасходныеОрдераИзЭтапа(ЭтотОбъект);
	Для Каждого ДокументРасходныйОрдер Из НовыеДокументыРасходныхОрдеров Цикл
		Документы.ОтборРазмещениеТоваров.СоздатьОтборРазмещениеИзРасходногоОрдера(ДокументРасходныйОрдер);
	КонецЦикла; 
	
	Если Не Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда 
		Возврат;
	КонецЕсли;	
	
	//Мохов ПРЗ.19
	//Если тпсКонтролиЭтапов.ЕстьЗаявкаНаКонтрольПоЭтапуПроизводства(Ссылка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ВидНоменклатуры = Неопределено;
	
	Если Не ВыходныеИзделия.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Номенклатура = ВыходныеИзделия[0].Номенклатура;
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	
	Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат;			
	КонецЕсли;
	
	ЭтоПолуфабрикат = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
	
	Если Не (ЭтоПолуфабрикат = Ложь Или ЭтоПолуфабрикат = Неопределено) Тогда
		Возврат;	
	КонецЕсли; 
	
	//ЗаявкаНаКонтрольОбъект = Документы.лимсЗаявкаНаКонтроль.СоздатьДокумент();
	//ЗаявкаНаКонтрольОбъект.Заполнить(Ссылка);
	//ЗаявкаНаКонтрольОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее 

//++ ШмелевР 04.03.2026 ПРЗ.3
&ИзменениеИКонтроль("ОтразитьКоличествоОтмененоВТЧ")
Процедура cbr_ОтразитьКоличествоОтмененоВТЧ(ПричинаОтмены)
	
	Если КоличествоУпаковокПлан = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Расчет коэффициента
	Коэффициент = 0;
	Если УпаковкаПлан = УпаковкаОтменено Тогда
		Коэффициент = КоличествоУпаковокОтменено/КоличествоУпаковокПлан;
	Иначе
		Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПартияПроизводства, "ОсновноеИзделиеНоменклатура");
		КоэффициентПлан = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(УпаковкаПлан, Номенклатура);
		КоэффициентОтменено = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(УпаковкаОтменено, Номенклатура);
		Коэффициент = (КоличествоУпаковокОтменено * КоэффициентОтменено) / (КоличествоУпаковокПлан * КоэффициентПлан);
	КонецЕсли;
	
	// Описание переменных
	СтруктураПоиска = Новый Структура("Подразделение, Номенклатура, Характеристика");
	СтруктураПоискаСерии = Новый Структура("Подразделение, Номенклатура, Характеристика, Получатель, Назначение, Произведено, ДатаПроизводства");
	СтрокиКОбработке = Новый Массив;
	СтруктураДействий = Новый Структура("ПересчитатьКоличествоУпаковок");
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ЭтотОбъект);
	КолонкиИсключения = "КодСтроки, ИдентификаторСтроки, КлючНоменклатура";
	
	// Обеспечение материалами и работами
	ТаблицаИтоги = ОбеспечениеМатериаламиИРаботами.Выгрузить(, "Подразделение, Номенклатура, Характеристика, Количество, Отменено");
	ТаблицаИтоги.Колонки.Добавить("КоличествоОтменено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	
	Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Отменено", Истина)) Цикл
		Строка.КоличествоОтменено = Строка.Количество;
	КонецЦикла;
	ТаблицаИтоги.Свернуть("Подразделение, Номенклатура, Характеристика", "Количество, КоличествоОтменено, Распределить");
	Для каждого Строка Из ТаблицаИтоги Цикл
		Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоОтменено;
	КонецЦикла;
	ТаблицаИтоги.Индексы.Добавить("Подразделение, Номенклатура, Характеристика");
	#Вставка
	//++ ШмелевР 04.03.2026 ПРЗ.3
	ОбеспечениеМатериаламиИРаботамиКопия = ОбеспечениеМатериаламиИРаботами.Выгрузить();
	//-- ШмелевР 04.03.2026 ПРЗ.3
	#КонецВставки
	Индекс = 0;
	
	Пока Индекс < ОбеспечениеМатериаламиИРаботами.Количество() Цикл
		
		Строка = ОбеспечениеМатериаламиИРаботами[Индекс];
		Индекс = Индекс + 1;
		Если Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить
			ИЛИ Строка.Отменено
			ИЛИ Строка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
		СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
		Если СтрокаИтоги.Распределить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОтменено = Строка;
		
		Если СтрокаИтоги.Распределить < Строка.Количество Тогда
			
			НоваяСтрока = ОбеспечениеМатериаламиИРаботами.Вставить(Индекс);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, КолонкиИсключения);
			НоваяСтрока.Количество = СтрокаИтоги.Распределить;
			СтрокиКОбработке.Добавить(НоваяСтрока);
			
			Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;
			СтрокиКОбработке.Добавить(Строка);
			
			СтрокаОтменено = НоваяСтрока;
			Индекс = Индекс + 1;
			
		КонецЕсли;
		
		СтрокаОтменено.Отменено = Истина;
		СтрокаОтменено.ПричинаОтмены = ПричинаОтмены;
			
		СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаОтменено.Количество;
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		СтрокиКОбработке,
		СтруктураДействий,
		ОбеспечениеМатериаламиИРаботами,
		КэшированныеЗначения);
	СтрокиКОбработке.Очистить();
	
	ЗаполнитьСтатусыУказанияСерийВТЧ("ОбеспечениеМатериаламиИРаботами", ПараметрыУказанияСерий);
	
	// Выходные и побочные изделия
	Для Сч = 1 По 2 Цикл
		
		ИмяТЧ = ?(Сч = 1, "ВыходныеИзделия", "ПобочныеИзделия");
		
		ТаблицаИтоги = ТабличнаяЧастьПоИмени(ИмяТЧ).Выгрузить(, "Подразделение, Номенклатура, Характеристика, Количество, Отменено");
		ТаблицаИтоги.Колонки.Добавить("КоличествоОтменено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
		ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
		
		Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Отменено", Истина)) Цикл
			Строка.КоличествоОтменено = Строка.Количество;
		КонецЦикла;
		ТаблицаИтоги.Свернуть("Подразделение, Номенклатура, Характеристика", "Количество, КоличествоОтменено, Распределить");
		Для каждого Строка Из ТаблицаИтоги Цикл
			Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоОтменено;
		КонецЦикла;
		ТаблицаИтоги.Индексы.Добавить("Подразделение, Номенклатура, Характеристика");
		
		Индекс = 0;
		Пока Индекс < ЭтотОбъект[ИмяТЧ].Количество() Цикл
			
			Строка = ЭтотОбъект[ИмяТЧ][Индекс];
			Индекс = Индекс + 1;
			Если Строка.Произведено
				ИЛИ Строка.Отменено
				ИЛИ Строка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
			СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
			Если СтрокаИтоги.Распределить <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОтменено = Строка;
			Если СтрокаИтоги.Распределить < Строка.Количество Тогда
				
				НоваяСтрока = ЭтотОбъект[ИмяТЧ].Вставить(Индекс);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, КолонкиИсключения);
				НоваяСтрока.Количество = СтрокаИтоги.Распределить;
				СтрокиКОбработке.Добавить(НоваяСтрока);
				
				Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;
				СтрокиКОбработке.Добавить(Строка);
				
				Если ИмяТЧ = "ВыходныеИзделия" Тогда
					ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
						НоваяСтрока,
						Строка,
						СпособРаспределенияЗатратНаВыходныеИзделия);
				КонецЕсли;
				
				СтрокаОтменено = НоваяСтрока;
				Индекс = Индекс + 1;
				
			КонецЕсли;
			СтрокаОтменено.Отменено = Истина;
			СтрокаОтменено.ПричинаОтмены = ПричинаОтмены;
				
			СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаОтменено.Количество;

		КонецЦикла;
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
			СтрокиКОбработке,
			СтруктураДействий,
			ЭтотОбъект[ИмяТЧ],
			КэшированныеЗначения);
		СтрокиКОбработке.Очистить();
	
		ЗаполнитьСтатусыУказанияСерийВТЧ(ИмяТЧ, ПараметрыУказанияСерий);
		
	КонецЦикла;
	
	// Трудозатраты
	СтруктураПоиска = Новый Структура("Подразделение, ВидРабот");
	
	ТаблицаИтоги = Трудозатраты.Выгрузить(, "Подразделение, ВидРабот, Количество, Отменено");
	ТаблицаИтоги.Колонки.Добавить("КоличествоОтменено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	
	Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Отменено", Истина)) Цикл
		Строка.КоличествоОтменено = Строка.Количество;
	КонецЦикла;
	ТаблицаИтоги.Свернуть("Подразделение, ВидРабот", "Количество, КоличествоОтменено, Распределить");
	Для каждого Строка Из ТаблицаИтоги Цикл
		Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоОтменено;
	КонецЦикла;
	ТаблицаИтоги.Индексы.Добавить("Подразделение, ВидРабот");
	
	Индекс = 0;
	Пока Индекс < Трудозатраты.Количество() Цикл
		
		Строка = Трудозатраты[Индекс];
		Индекс = Индекс + 1;
		Если Строка.Выполнено
			ИЛИ Строка.Отменено
			ИЛИ Строка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
		СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
		Если СтрокаИтоги.Распределить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОтменено = Строка;
		Если СтрокаИтоги.Распределить < Строка.Количество Тогда
			
			НоваяСтрока = Трудозатраты.Вставить(Индекс);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , "КодСтроки,КлючВидРабот");
			НоваяСтрока.Количество = СтрокаИтоги.Распределить;
			
			Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;
			
			СтрокаОтменено = НоваяСтрока;
			Индекс = Индекс + 1;
			
		КонецЕсли;
		СтрокаОтменено.Отменено = Истина;
		СтрокаОтменено.ПричинаОтмены = ПричинаОтмены;
		
		СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаОтменено.Количество;
		
	КонецЦикла;
	#Вставка
	//++ ШмелевР 04.03.2026 ПРЗ.3
	ОбеспечениеМатериаламиИРаботами.Загрузить(ОбеспечениеМатериаламиИРаботамиКопия);
	//-- ШмелевР 04.03.2026 ПРЗ.3
	#КонецВставки
КонецПроцедуры //++ ШмелевР 04.03.2026 ПРЗ.3

&ИзменениеИКонтроль("ОтразитьКоличествоФактВТЧ")
Процедура cbr_ОтразитьКоличествоФактВТЧ(Исполнитель)

	Если КоличествоУпаковокПлан = 0 Тогда
		Возврат;
	КонецЕсли;

	ДанныеПартии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПартияПроизводства,
	"ОсновноеИзделиеНоменклатура, ОсновноеИзделиеХарактеристика");

	// Расчет коэффициента
	Коэффициент = 0;
	Если УпаковкаПлан = УпаковкаФакт Тогда
		Коэффициент = КоличествоУпаковокФакт/КоличествоУпаковокПлан;
	Иначе
		КоэффициентПлан = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(
		УпаковкаПлан, ДанныеПартии.ОсновноеИзделиеНоменклатура);
		КоэффициентФакт = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(
		УпаковкаФакт, ДанныеПартии.ОсновноеИзделиеНоменклатура);
		Коэффициент = (КоличествоУпаковокФакт * КоэффициентФакт) / (КоличествоУпаковокПлан * КоэффициентПлан);
	КонецЕсли;

	// Описание переменных
	СтруктураПоиска = Новый Структура("Подразделение, Номенклатура, Характеристика");
	СтруктураПоискаСерии = Новый Структура("Подразделение, Номенклатура, Характеристика, Получатель, Назначение, Произведено, ДатаПроизводства");
	СтрокиКОбработке = Новый Массив;
	СтруктураДействий = Новый Структура("ПересчитатьКоличествоУпаковок");
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ЭтотОбъект);

	// Расход материалов и работ
	ТаблицаИтоги = ОбеспечениеМатериаламиИРаботами.Выгрузить(, "Подразделение, Номенклатура, Характеристика, Количество");
	ТаблицаИтоги.Свернуть("Подразделение, Номенклатура, Характеристика", "Количество");
	Для каждого Строка Из ТаблицаИтоги Цикл
		Строка.Количество = Строка.Количество * Коэффициент;
	КонецЦикла;
	ТаблицаИтоги.Индексы.Добавить("Подразделение, Номенклатура, Характеристика");

	ТаблицаРасход = РасходМатериаловИРабот.Выгрузить(, "Подразделение, Номенклатура, Характеристика, Количество");
	ВычестьСтрокиИзТаблицы(ТаблицаИтоги, ТаблицаРасход, Новый Структура("Подразделение, Номенклатура, Характеристика"), Ложь);

	ТаблицаОстатки = ОбеспечениеМатериаламиИРаботами.Выгрузить(
	Новый Структура("Отменено", Ложь),
	"Подразделение, Номенклатура, Характеристика, Серия, Упаковка, Количество, СтатьяКалькуляции");
	ТаблицаОстатки.Сортировать("Номенклатура, Характеристика, Серия, Упаковка, СтатьяКалькуляции, Подразделение");
	ТаблицаОстатки.Индексы.Добавить("Подразделение, Номенклатура, Характеристика, Серия");
	ТаблицаОстатки.Индексы.Добавить("Подразделение, Номенклатура, Характеристика");

	ТаблицаРасход = РасходМатериаловИРабот.Выгрузить(, "Подразделение, Номенклатура, Характеристика, Серия, Количество");
	ТаблицаЭкономия = ЭкономияМатериалов.Выгрузить(, "Подразделение, Номенклатура, Характеристика, Серия, Количество");
    #Удаление
	ОбщегоНазначенияУТ.ДобавитьВТаблицуПорядковыйНомерСтрок(ТаблицаОстатки);
	ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаРасход, Новый Структура("Подразделение, Номенклатура, Характеристика, Серия"));
	ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаЭкономия, Новый Структура("Подразделение, Номенклатура, Характеристика, Серия"));
	ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаЭкономия, Новый Структура("Подразделение, Номенклатура, Характеристика"));
	ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаРасход, Новый Структура("Подразделение, Номенклатура, Характеристика"));
	#КонецУдаления
	
	#Вставка
	//++ ШмелевР 11.03.2026 ПРЗ.3
	ПроверкаЭтоПолуфабрикат = Истина;	
	ПроверкаЭтоПолуфабрикат = РаботаСПроизводствомСервер.ЭтоПолуфабрикат(ЭтотОбъект.ПартияПроизводства);
	
	Если НЕ ПроверкаЭтоПолуфабрикат Тогда
		ОбщегоНазначенияУТ.ДобавитьВТаблицуПорядковыйНомерСтрок(ТаблицаОстатки);
		
		ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаРасход, Новый Структура("Подразделение, Номенклатура, Характеристика, Серия"));
		ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаЭкономия, Новый Структура("Подразделение, Номенклатура, Характеристика, Серия"));
		ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаЭкономия, Новый Структура("Подразделение, Номенклатура, Характеристика"));
		ВычестьСтрокиИзТаблицы(ТаблицаОстатки, ТаблицаРасход, Новый Структура("Подразделение, Номенклатура, Характеристика"));	
	Иначе
		ОбщегоНазначенияУТ.ДобавитьВТаблицуПорядковыйНомерСтрок(ТаблицаОстатки);
		ЭтотОбъект.РасходМатериаловИРабот.Очистить();
	КонецЕсли;
	//-- ШмелевР 11.03.2026 ПРЗ.3
	#КонецВставки
	Если РасходОднойДатой Тогда
		ДатаОперации = ДатаРасхода;
	ИначеЕсли ФактическоеОкончаниеЭтапа <> '000101010000'
		И Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
		ДатаОперации = НачалоДня(ФактическоеОкончаниеЭтапа);
	Иначе
		ДатаОперации = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	СтруктураОтбора = Новый Структура("Номенклатура, Характеристика, Серия, Упаковка, СтатьяКалькуляции, Подразделение");
	СтруктураСравнения = Новый Структура("Номенклатура, Характеристика, Серия, Упаковка, СтатьяКалькуляции, Подразделение");

	Для Индекс = 0 По ТаблицаОстатки.Количество()-1 Цикл

		СтрокаОстатки = ТаблицаОстатки[Индекс];
		Если СтрокаОстатки.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаОстатки);
		ДанныеСовпадают = ОбщегоНазначения.ДанныеСовпадают(СтруктураОтбора, СтруктураСравнения);
		ЗаполнитьЗначенияСвойств(СтруктураСравнения, СтруктураОтбора);

		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаОстатки);
		НайденныеСтроки = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска);
		#Удаление
		Если НайденныеСтроки.ВГраница() = -1 
			ИЛИ НайденныеСтроки[0].Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаИтоги = НайденныеСтроки[0];
		
		КоличествоЗаполнить = Мин(СтрокаОстатки.Количество, СтрокаИтоги.Количество);
        #КонецУдаления
		
		#Вставка
		//++ ШмелевР 11.03.2026 ПРЗ.3
		Если НЕ ПроверкаЭтоПолуфабрикат Тогда
			Если НайденныеСтроки.ВГраница() = -1 
				ИЛИ НайденныеСтроки[0].Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаИтоги = НайденныеСтроки[0];
			
			КоличествоЗаполнить = Мин(СтрокаОстатки.Количество, СтрокаИтоги.Количество);	
		Иначе
			КоличествоЗаполнить = СтрокаОстатки.Количество;
			СтрокаИтоги = НайденныеСтроки[0];
		КонецЕсли;
		//-- ШмелевР 11.03.2026 ПРЗ.3
		#КонецВставки
		Если Не ДанныеСовпадают Тогда
			НоваяСтрока = РасходМатериаловИРабот.Добавить();
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатки,, "Количество");
		НоваяСтрока.Количество = НоваяСтрока.Количество + КоличествоЗаполнить;
		НоваяСтрока.ДатаРасхода = ДатаОперации;

		Если Не ДанныеСовпадают Тогда
			СтрокиКОбработке.Добавить(НоваяСтрока);
		КонецЕсли;

		СтрокаИтоги.Количество = СтрокаИтоги.Количество - КоличествоЗаполнить;

	КонецЦикла;

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
	СтрокиКОбработке,
	СтруктураДействий,
	РасходМатериаловИРабот,
	КэшированныеЗначения);
	СтрокиКОбработке.Очистить();

	ЗаполнитьСтатусыУказанияСерийВТЧ("РасходМатериаловИРабот", ПараметрыУказанияСерий);

	// Выходные и побочные изделия
	Если ПроизводствоОднойДатой Тогда
		ДатаОперации = ДатаПроизводства;
	ИначеЕсли ФактическоеОкончаниеЭтапа <> '000101010000'
		И Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
		ДатаОперации = НачалоДня(ФактическоеОкончаниеЭтапа);
	Иначе
		ДатаОперации = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	КолонкиИсключения = "КодСтроки, ИдентификаторСтроки, КлючНоменклатура";

	Для Сч = 1 По 2 Цикл

		Если Сч = 1 Тогда
			ИмяТЧ      = "ВыходныеИзделия";
			ИмяТЧСерии = "ВыходныеИзделияСерии";
		Иначе
			ИмяТЧ      = "ПобочныеИзделия";
			ИмяТЧСерии = "ПобочныеИзделияСерии";
		КонецЕсли;

		ТаблицаИтоги = ТабличнаяЧастьПоИмени(ИмяТЧ).Выгрузить(, "Подразделение, Номенклатура, Характеристика, Количество, Произведено");
		ТаблицаИтоги.Колонки.Добавить("КоличествоПроизведено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
		ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));

		Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Произведено", Истина)) Цикл
			Строка.КоличествоПроизведено = Строка.Количество;
		КонецЦикла;
		ТаблицаИтоги.Свернуть("Подразделение, Номенклатура, Характеристика", "Количество, КоличествоПроизведено, Распределить");
		Для каждого Строка Из ТаблицаИтоги Цикл
			Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоПроизведено;
		КонецЦикла;
		ТаблицаИтоги.Индексы.Добавить("Подразделение, Номенклатура, Характеристика");

		Индекс = 0;
		Пока Индекс < ЭтотОбъект[ИмяТЧ].Количество() Цикл

			Строка = ЭтотОбъект[ИмяТЧ][Индекс];
			Индекс = Индекс + 1;
			Если Строка.Произведено
				ИЛИ Строка.Отменено
				ИЛИ Строка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
			СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
			Если СтрокаИтоги.Распределить <= 0 Тогда
				Продолжить;
			КонецЕсли;

			СтрокаПроизведено = Строка;
			Если СтрокаИтоги.Распределить < Строка.Количество Тогда

				НоваяСтрока = ЭтотОбъект[ИмяТЧ].Вставить(Индекс);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, КолонкиИсключения);
				НоваяСтрока.Количество = СтрокаИтоги.Распределить;
				СтрокиКОбработке.Добавить(НоваяСтрока);

				Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;
				СтрокиКОбработке.Добавить(Строка);

				Если ИмяТЧ = "ВыходныеИзделия" Тогда
					ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(
					НоваяСтрока,
					Строка,
					СпособРаспределенияЗатратНаВыходныеИзделия);
				КонецЕсли;

				СтрокаПроизведено = НоваяСтрока;
				Индекс = Индекс + 1;

			КонецЕсли;

			Если СтрокаПроизведено.СтатусУказанияСерий <> 0 Тогда

				Распределить = СтрокаПроизведено.Количество;

				ЗаполнитьЗначенияСвойств(СтруктураПоискаСерии, СтрокаПроизведено);
				Для каждого СтрокаСерии Из ЭтотОбъект[ИмяТЧСерии].НайтиСтроки(СтруктураПоискаСерии) Цикл

					Если Распределить >= СтрокаСерии.Количество Тогда
						СтрокаСерии.Произведено = Истина;
						СтрокаСерии.ДатаПроизводства = ДатаОперации;
						Распределить = Распределить - СтрокаСерии.Количество;
					Иначе
						НоваяСтрокаСерии = ЭтотОбъект[ИмяТЧСерии].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаСерии, СтрокаСерии);
						НоваяСтрокаСерии.Количество = Распределить;
						НоваяСтрокаСерии.Произведено = Истина;
						НоваяСтрокаСерии.ДатаПроизводства = ДатаОперации;

						СтрокаСерии.Количество = СтрокаСерии.Количество - Распределить;
						Распределить = 0;
					КонецЕсли;

					Если Распределить = 0 Тогда
						Прервать;
					КонецЕсли;

				КонецЦикла;

			КонецЕсли;

			СтрокаПроизведено.Произведено = Истина;
			СтрокаПроизведено.ДатаПроизводства = ДатаОперации;

			СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаПроизведено.Количество;

		КонецЦикла;

		Если ИмяТЧ = "ВыходныеИзделия"
			И Коэффициент > 1 Тогда
			КоэффициентФакт = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(
			УпаковкаФакт, ДанныеПартии.ОсновноеИзделиеНоменклатура);
			КоличествоФакт = КоличествоУпаковокФакт * КоэффициентФакт;

			СтруктураПоискаИзделия = Новый Структура;
			СтруктураПоискаИзделия.Вставить("Номенклатура", ДанныеПартии.ОсновноеИзделиеНоменклатура);
			СтруктураПоискаИзделия.Вставить("Характеристика", ДанныеПартии.ОсновноеИзделиеХарактеристика);

			КоличествоВТаблице = ВыходныеИзделия.Выгрузить(СтруктураПоискаИзделия, "Количество").Итог("Количество");

			Если КоличествоФакт > КоличествоВТаблице Тогда
				СтруктураПоискаИзделия.Вставить("Произведено", Истина);
				СтруктураПоискаИзделия.Вставить("ДатаПроизводства", ДатаОперации);
				НайденныеСтроки = ВыходныеИзделия.НайтиСтроки(СтруктураПоискаИзделия);
				Если НайденныеСтроки.ВГраница() <> -1 Тогда
					Строка = НайденныеСтроки[0];
					Строка.Количество = Строка.Количество + (КоличествоФакт - КоличествоВТаблице);
					СтрокиКОбработке.Добавить(Строка);

					Если Строка.СтатусУказанияСерий <> 0 Тогда
						ЗаполнитьЗначенияСвойств(СтруктураПоискаСерии, Строка);
						НайденныеСтрокиСерии = ВыходныеИзделияСерии.НайтиСтроки(СтруктураПоискаСерии);
						Если НайденныеСтрокиСерии.ВГраница() <> -1 Тогда
							НайденныеСтрокиСерии[0].Количество = НайденныеСтрокиСерии[0].Количество
							+ (КоличествоФакт - КоличествоВТаблице);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ИмяТЧ = "ПобочныеИзделия" Тогда
			Документы.ЭтапПроизводства2_2.ЗаполнитьЦеныПоВидуЦен(ЭтотОбъект);
		КонецЕсли;

		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		СтрокиКОбработке,
		СтруктураДействий,
		ЭтотОбъект[ИмяТЧ],
		КэшированныеЗначения);
		СтрокиКОбработке.Очистить();

		ЗаполнитьСтатусыУказанияСерийВТЧ(ИмяТЧ, ПараметрыУказанияСерий);

	КонецЦикла;

	// Трудозатраты
	СтруктураПоиска = Новый Структура("Подразделение, ВидРабот");
	Если Документы.ЭтапПроизводства2_2.ИспользуетсяОтметкаВыполненныхТрудозатрат(ЭтотОбъект) Тогда

		ТаблицаИтоги = Трудозатраты.Выгрузить(, "Подразделение, ВидРабот, Количество, Выполнено");
		ТаблицаИтоги.Колонки.Добавить("КоличествоВыполнено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
		ТаблицаИтоги.Колонки.Добавить("Распределить", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));

		Для каждого Строка Из ТаблицаИтоги.НайтиСтроки(Новый Структура("Выполнено", Истина)) Цикл
			Строка.КоличествоВыполнено = Строка.Количество;
		КонецЦикла;
		ТаблицаИтоги.Свернуть("Подразделение, ВидРабот", "Количество, КоличествоВыполнено, Распределить");
		Для каждого Строка Из ТаблицаИтоги Цикл
			Строка.Распределить = Строка.Количество * Коэффициент - Строка.КоличествоВыполнено;
		КонецЦикла;
		ТаблицаИтоги.Индексы.Добавить("Подразделение, ВидРабот");

		Если ВыполнениеРаботОднойДатой Тогда
			ДатаОперации = ДатаВыполненияРабот;
		ИначеЕсли ФактическоеОкончаниеЭтапа <> '000101010000'
			И Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
			ДатаОперации = НачалоДня(ФактическоеОкончаниеЭтапа);
		Иначе
			ДатаОперации = НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;

		Индекс = 0;
		Пока Индекс < Трудозатраты.Количество() Цикл

			Строка = Трудозатраты[Индекс];
			Индекс = Индекс + 1;

			Если Строка.Выполнено
				И Не ЗначениеЗаполнено(Строка.Исполнитель)
				И ЗначениеЗаполнено(Исполнитель) Тогда
				Строка.Исполнитель = Исполнитель;
			КонецЕсли;

			Если Строка.Выполнено
				ИЛИ Строка.Отменено
				ИЛИ Строка.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
			СтрокаИтоги = ТаблицаИтоги.НайтиСтроки(СтруктураПоиска)[0];
			Если СтрокаИтоги.Распределить <= 0 Тогда
				Продолжить;
			КонецЕсли;

			СтрокаВыполнено = Строка;
			Если СтрокаИтоги.Распределить < Строка.Количество Тогда

				НоваяСтрока = Трудозатраты.Вставить(Индекс);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , "КодСтроки,КлючВидРабот");
				НоваяСтрока.Количество = СтрокаИтоги.Распределить;

				Строка.Количество = Строка.Количество - СтрокаИтоги.Распределить;

				СтрокаВыполнено = НоваяСтрока;
				Индекс = Индекс + 1;

			КонецЕсли;
			СтрокаВыполнено.Выполнено = Истина;
			СтрокаВыполнено.ДатаВыполнения = ДатаОперации;
			Если ЗначениеЗаполнено(Исполнитель)
				И НЕ ЗначениеЗаполнено(СтрокаВыполнено.Исполнитель) Тогда
				СтрокаВыполнено.Исполнитель = Исполнитель;
			КонецЕсли;

			СтрокаИтоги.Распределить = СтрокаИтоги.Распределить - СтрокаВыполнено.Количество;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли