#Область ОбработчикиСобытий
&ИзменениеИКонтроль("ОбработкаКоманды")
&НаКлиенте
Процедура cbr_ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	#Удаление
	ОткрытьФорму("Документ.ЗаказНаПроизводство2_2.Форма.Очередь",
		,
		ПараметрыВыполненияКоманды.Источник,ПараметрыВыполненияКоманды.Уникальность,ПараметрыВыполненияКоманды.Окно,ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	#КонецУдаления
	
	#Вставка
	//++ ШмелевР 10.02.2026 ПРЗ.2
	ОткрытьФорму("Документ.ЗаказНаПроизводство2_2.Форма.ОчередьАРМ",
	,
	ПараметрыВыполненияКоманды.Источник,ПараметрыВыполненияКоманды.Уникальность,ПараметрыВыполненияКоманды.Окно,ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//-- ШмелевР 10.02.2026 ПРЗ.2
	#КонецВставки
	
КонецПроцедуры
#КонецОбласти
