#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//++AlopinAS 28.01.2026 ПРД.20
&После("ПриЗаписи")
Процедура cbr_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	ФормированиеДокументаОперацияСоглашение();	

КонецПроцедуры
//--AlopinAS 28.01.2026 ПРД.20

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ФормированиеДокументаОперацияСоглашение()
	
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Количество КАК Количество,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания,
	|	НоменклатураСписок.ЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТЧ
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСписок
	|		ПО СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура = НоменклатураСписок.Ссылка
	|ГДЕ
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Количество,
	|	НоменклатураСписок.ЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТЧ.ДатаНачала КАК ДатаНачала,
	|	ВТТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ВТТЧ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТГруппировка
	|ИЗ
	|	ВТТЧ КАК ВТТЧ
	|СГРУППИРОВАТЬ ПО
	|	ВТТЧ.ДатаНачала,
	|	ВТТЧ.ДатаОкончания,
	|	ВТТЧ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГруппировка.ДатаНачала КАК ДатаНачала,
	|	ВТГруппировка.ДатаОкончания КАК ДатаОкончания,
	|	cbr_ОперацияСоглашения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТДокументы
	|ИЗ
	|	ВТГруппировка КАК ВТГруппировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_ОперацияСоглашения КАК cbr_ОперацияСоглашения
	|		ПО ВТГруппировка.ДатаНачала = cbr_ОперацияСоглашения.Дата
	|		И ВТГруппировка.ДатаОкончания = cbr_ОперацияСоглашения.ДатаОкончания
	|		И cbr_ОперацияСоглашения.Соглашение = ВТГруппировка.Ссылка
	|ГДЕ
	|	cbr_ОперацияСоглашения.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТЧ.Номенклатура КАК Номенклатура,
	|	ВТТЧ.Характеристика КАК Характеристика,
	|	ВТТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТТЧ.Количество КАК Количество,
	|	ВТТЧ.ДатаНачала КАК ДатаНачала,
	|	ВТТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ВТТЧ.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
	|	ВТДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТТЧ КАК ВТТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
	|		ПО ВТТЧ.ДатаНачала = ВТДокументы.ДатаНачала
	|		И ВТТЧ.ДатаОкончания = ВТДокументы.ДатаОкончания
	|ИТОГИ
	|	МАКСИМУМ(Ссылка) КАК Ссылка
	|ПО
	|	ДатаНачала,
	|	ДатаОкончания";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДатаНачала = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивДокументовДляПроведения = Новый Массив();
	МассивСтарыхДокументовДляПроведения = Новый Массив();
	
	Пока ВыборкаДатаНачала.Следующий() Цикл
		
		ВыборкаДатаОкончания = ВыборкаДатаНачала.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, );
		Пока ВыборкаДатаОкончания.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДатаОкончания.Ссылка) Тогда
				ДокументОбъект = ВыборкаДатаОкончания.Ссылка.ПолучитьОбъект();
				ДокументОбъект.СписокНоменклатура.Очистить();
				ДанныеДляФормирования = ВыборкаДатаОкончания.Выбрать();
				Пока ДанныеДляФормирования.Следующий() Цикл
					Новаястрока = ДокументОбъект.СписокНоменклатура.Добавить();
					ЗаполнитьЗначенияСвойств(Новаястрока, ДанныеДляФормирования);
				
					Коэфициент = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ДанныеДляФормирования.ЕдиницаИзмерения, ДанныеДляФормирования.Номенклатура);
					КоличетсвоВЭлементарныхЕдиницах = ДанныеДляФормирования.Количество * Коэфициент;
					Новаястрока.Количество = КоличетсвоВЭлементарныхЕдиницах;
					
				КонецЦикла;
				
				МассивСтарыхДокументовДляПроведения.Добавить(ВыборкаДатаОкончания.Ссылка);
			Иначе
				НовыйДокумент = Документы.cbr_ОперацияСоглашения.СоздатьДокумент();
				НовыйДокумент.Дата = ВыборкаДатаОкончания.ДатаНачала;
				НовыйДокумент.Соглашение = Ссылка;
				НовыйДокумент.Действие = ПредопределенноеЗначение("Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Приход");
			
				НовыйДокумент.ДатаОкончания = ВыборкаДатаОкончания.ДатаОкончания;
			
				ДанныеДляФормирования = ВыборкаДатаОкончания.Выбрать();
			
				Пока ДанныеДляФормирования.Следующий() Цикл
				
					Новаястрока = НовыйДокумент.СписокНоменклатура.Добавить();
					ЗаполнитьЗначенияСвойств(Новаястрока, ДанныеДляФормирования);
				
					Коэфициент = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ДанныеДляФормирования.ЕдиницаИзмерения, ДанныеДляФормирования.Номенклатура);
					КоличетсвоВЭлементарныхЕдиницах = ДанныеДляФормирования.Количество * Коэфициент;
					Новаястрока.Количество = КоличетсвоВЭлементарныхЕдиницах;
				КонецЦикла;	
				
				МассивДокументовДляПроведения.Добавить(НовыйДокумент);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Попытка

		Для Каждого Документ Из МассивСтарыхДокументовДляПроведения Цикл
			ДокументОбъект = Документ.ПолучитьОбъект();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;

		Для Каждого Документ Из МассивДокументовДляПроведения Цикл
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;

	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка создания документа операции по соглашению!'");
		ЗаписьЖурналаРегистрации("ОшибкаСозданияОперацииСоглашения", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.cbr_ОперацияСоглашения, , ТекстСообщения,
			РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли