#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//++AlopinAS 28.01.2026 ПРД.20
&После("ПриЗаписи")
Процедура cbr_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	ФормированиеДокументаОперацияСоглашение();	

КонецПроцедуры
//--AlopinAS 28.01.2026 ПРД.20


&После("ОбработкаПроверкиЗаполнения")
Процедура cbr_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПрверитьКореектностьЗаполнения() Тогда
		Отказ = Истина;
		Возврат
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ)
		
	ОбработатьИзменениеДатыНачала();	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИзменениеДатыНачала()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Тз.Номенклатура КАК Номенклатура,
		|	Тз.Характеристика КАК Характеристика,
		|	Тз.ДатаНачала КАК ДатаНачала,
		|	Тз.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТТЧАктуал
		|ИЗ
		|	&Тз КАК Тз
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТТЧИстор
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|ГДЕ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Ссылка
		|	И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧИстор.Номенклатура КАК Номенклатура,
		|	ВТТЧИстор.Характеристика КАК Характеристика,
		|	ВТТЧИстор.ДатаНачала КАК ДатаНачала,
		|	ВТТЧИстор.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТИсторИзмененнаяНоменклатура
		|ИЗ
		|	ВТТЧАктуал КАК ВТТЧАктуал
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТЧИстор КАК ВТТЧИстор
		|		ПО ВТТЧИстор.Номенклатура = ВТТЧАктуал.Номенклатура
		|		И ВТТЧИстор.Характеристика = ВТТЧАктуал.Характеристика
		|		И ВТТЧИстор.ДатаНачала <> ВТТЧАктуал.ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Ссылка КАК Ссылка,
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Номенклатура КАК Номенклатура,
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.cbr_ОперацияСоглашения.СписокНоменклатура КАК cbr_ОперацияСоглашенияСписокНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсторИзмененнаяНоменклатура КАК ВТИсторИзмененнаяНоменклатура
		|		ПО ВТИсторИзмененнаяНоменклатура.Номенклатура = cbr_ОперацияСоглашенияСписокНоменклатура.Номенклатура
		|		И ВТИсторИзмененнаяНоменклатура.Характеристика = cbr_ОперацияСоглашенияСписокНоменклатура.Характеристика
		|		И ВТИсторИзмененнаяНоменклатура.ДатаНачала = cbr_ОперацияСоглашенияСписокНоменклатура.Ссылка.Дата
		|		И ВТИсторИзмененнаяНоменклатура.ДатаОкончания = cbr_ОперацияСоглашенияСписокНоменклатура.Ссылка.ДатаОкончания
		|ГДЕ
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Тз", cbr_ЦеныПоТоварам.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивДокументовДляИзменения = Новый Массив;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтруктураОтбора = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		СтруктураОтбора.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
		МассивСтрок = ДокументОбъект.СписокНоменклатура.НайтиСтроки(СтруктураОтбора);
		СтрокаДляУдаления = МассивСтрок[0];
		ДокументОбъект.СписокНоменклатура.Удалить(СтрокаДляУдаления);
		МассивДокументовДляИзменения.Добавить(ДокументОбъект); 
	КонецЦикла;
	
	Попытка

		Для Каждого Документ Из МассивДокументовДляИзменения Цикл
			Если Не ЗначениеЗаполнено(Документ.СписокНоменклатура) тогда
				Документ.УстановитьПометкуУдаления(Истина);
				Документ.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;

	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка изменения документа операции по соглашению!'");
		ЗаписьЖурналаРегистрации("ОшибкаСозданияОперацииСоглашения", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.cbr_ОперацияСоглашения, , ТекстСообщения,
			РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура ФормированиеДокументаОперацияСоглашение()
	
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Количество КАК Количество,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания,
	|	НоменклатураСписок.ЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТЧ
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСписок
	|		ПО СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура = НоменклатураСписок.Ссылка
	|ГДЕ
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Количество,
	|	НоменклатураСписок.ЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТЧ.ДатаНачала КАК ДатаНачала,
	|	ВТТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ВТТЧ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТГруппировка
	|ИЗ
	|	ВТТЧ КАК ВТТЧ
	|СГРУППИРОВАТЬ ПО
	|	ВТТЧ.ДатаНачала,
	|	ВТТЧ.ДатаОкончания,
	|	ВТТЧ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГруппировка.ДатаНачала КАК ДатаНачала,
	|	ВТГруппировка.ДатаОкончания КАК ДатаОкончания,
	|	cbr_ОперацияСоглашения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТДокументы
	|ИЗ
	|	ВТГруппировка КАК ВТГруппировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_ОперацияСоглашения КАК cbr_ОперацияСоглашения
	|		ПО ВТГруппировка.ДатаНачала = cbr_ОперацияСоглашения.Дата
	|		И ВТГруппировка.ДатаОкончания = cbr_ОперацияСоглашения.ДатаОкончания
	|		И cbr_ОперацияСоглашения.Соглашение = ВТГруппировка.Ссылка
	|ГДЕ
	|	cbr_ОперацияСоглашения.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТЧ.Номенклатура КАК Номенклатура,
	|	ВТТЧ.Характеристика КАК Характеристика,
	|	ВТТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТТЧ.Количество КАК Количество,
	|	ВТТЧ.ДатаНачала КАК ДатаНачала,
	|	ВТТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ВТТЧ.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
	|	ВТДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТТЧ КАК ВТТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
	|		ПО ВТТЧ.ДатаНачала = ВТДокументы.ДатаНачала
	|		И ВТТЧ.ДатаОкончания = ВТДокументы.ДатаОкончания
	|ИТОГИ
	|	МАКСИМУМ(Ссылка) КАК Ссылка
	|ПО
	|	ДатаНачала,
	|	ДатаОкончания";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДатаНачала = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивДокументовДляПроведения = Новый Массив();
	МассивСтарыхДокументовДляПроведения = Новый Массив();
	
	Пока ВыборкаДатаНачала.Следующий() Цикл
		
		ВыборкаДатаОкончания = ВыборкаДатаНачала.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, );
		Пока ВыборкаДатаОкончания.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДатаОкончания.Ссылка) Тогда
				ДокументОбъект = ВыборкаДатаОкончания.Ссылка.ПолучитьОбъект();
				ДокументОбъект.СписокНоменклатура.Очистить();
				ДанныеДляФормирования = ВыборкаДатаОкончания.Выбрать();
				Пока ДанныеДляФормирования.Следующий() Цикл
					Новаястрока = ДокументОбъект.СписокНоменклатура.Добавить();
					ЗаполнитьЗначенияСвойств(Новаястрока, ДанныеДляФормирования);
				
					Коэфициент = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ДанныеДляФормирования.ЕдиницаИзмерения, ДанныеДляФормирования.Номенклатура);
					КоличетсвоВЭлементарныхЕдиницах = ДанныеДляФормирования.Количество * Коэфициент;
					Новаястрока.Количество = КоличетсвоВЭлементарныхЕдиницах;
					
				КонецЦикла;
				
				МассивСтарыхДокументовДляПроведения.Добавить(ДокументОбъект);
			Иначе
				НовыйДокумент = Документы.cbr_ОперацияСоглашения.СоздатьДокумент();
				НовыйДокумент.Дата = ВыборкаДатаОкончания.ДатаНачала;
				НовыйДокумент.Соглашение = Ссылка;
				НовыйДокумент.Действие = ПредопределенноеЗначение("Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Приход");
			
				НовыйДокумент.ДатаОкончания = ВыборкаДатаОкончания.ДатаОкончания;
			
				ДанныеДляФормирования = ВыборкаДатаОкончания.Выбрать();
			
				Пока ДанныеДляФормирования.Следующий() Цикл
				
					Новаястрока = НовыйДокумент.СписокНоменклатура.Добавить();
					ЗаполнитьЗначенияСвойств(Новаястрока, ДанныеДляФормирования);
				
					Коэфициент = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ДанныеДляФормирования.ЕдиницаИзмерения, ДанныеДляФормирования.Номенклатура);
					КоличетсвоВЭлементарныхЕдиницах = ДанныеДляФормирования.Количество * Коэфициент;
					Новаястрока.Количество = КоличетсвоВЭлементарныхЕдиницах;
				КонецЦикла;	
				
				МассивДокументовДляПроведения.Добавить(НовыйДокумент);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Попытка

		Для Каждого Документ Из МассивСтарыхДокументовДляПроведения Цикл
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;

		Для Каждого Документ Из МассивДокументовДляПроведения Цикл
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;

	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка создания документа операции по соглашению!'");
		ЗаписьЖурналаРегистрации("ОшибкаСозданияОперацииСоглашения", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.cbr_ОперацияСоглашения, , ТекстСообщения,
			РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Функция ПрверитьКореектностьЗаполнения()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.НомерСтроки КАК НомерСтроки,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	&Тз КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТЧ.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТГруппировка
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|СГРУППИРОВАТЬ ПО
		|	ВТТЧ.Номенклатура,
		|	ВТТЧ.Характеристика
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТЧ.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика,
		|	ВТТЧ.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГруппировка КАК ВТГруппировка
		|		ПО ВТТЧ.Номенклатура = ВТГруппировка.Номенклатура
		|		И ВТТЧ.Характеристика = ВТГруппировка.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТЧ.Номенклатура КАК Номенклатура,
		|	ВТТЧ.Характеристика КАК Характеристика
		|ИЗ
		|	ВТТЧ КАК ВТТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТЧ КАК ВТТЧ1
		|		ПО ВТТЧ.Номенклатура = ВТТЧ1.Номенклатура
		|		И ВТТЧ.Характеристика = ВТТЧ1.Характеристика
		|		И (ВТТЧ.ДатаНачала <> ВТТЧ1.ДатаНачала
		|		ИЛИ ВТТЧ.ДатаОкончания <> ВТТЧ1.ДатаОкончания)
		|		И НЕ (ВТТЧ.ДатаОкончания < ВТТЧ1.ДатаНачала
		|		ИЛИ ВТТЧ.ДатаНачала > ВТТЧ1.ДатаОкончания)";
	
	
	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЗ", cbr_ЦеныПоТоварам.Выгрузить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[2].Пустой() и РезультатЗапроса[3].Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборкаДубли = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаДубли.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Обнаружны дубли по номенклатуре ""%1"", характеристике ""%2"" на строке ""%3""'"),
			ВыборкаДубли.Номенклатура, ВыборкаДубли.Характеристика, ВыборкаДубли.НомерСтроки));	
	КонецЦикла;
	
	ВыборкаВхождениеДиапазонаДат = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаВхождениеДиапазонаДат.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Обнаружны пересечения промежутков дат по номенклатуре ""%1"", характеристике ""%2""'"),
			ВыборкаДубли.Номенклатура, ВыборкаДубли.Характеристика));
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#КонецЕсли