
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);		
	КонецЕсли;
	
	//++AlopinAS 28.01.2026 ПРД.20
	Если ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда

		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма,
		"СтраницаУточнениеЦенПоТоварам",
		НСтр("ru='Уточнение цен по товарам'"),
		Форма.Элементы.ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма,
		"ГруппаУточнениеЦенПоТоварам",
		 Неопределено,
		 Форма.Элементы.СтраницаУточнениеЦенПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма,
		"ЦеныПоТоварам",
		"Объект.cbr_ЦеныПоТоварам",
		Форма.Элементы.ГруппаУточнениеЦенПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамНоменклатура",
		"Объект.cbr_ЦеныПоТоварам.Номенклатура",
		НСтр("ru='Номенклатура'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамХарактеристика",
		"Объект.cbr_ЦеныПоТоварам.Характеристика",
		НСтр("ru='Характеристика'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамЕдиницаИзмерения",
		"Объект.cbr_ЦеныПоТоварам.ЕдиницаИзмерения",
		НСтр("ru='Ед. изм.'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамКоличество",
		"Объект.cbr_ЦеныПоТоварам.Количество",
		НСтр("ru='Количество'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамВидЦены",
		"Объект.cbr_ЦеныПоТоварам.ВидЦены",
		НСтр("ru='Вид цены'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамЦена",
		"Объект.cbr_ЦеныПоТоварам.Цена",
		НСтр("ru='Цена'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамПрцентРучнаяСкидка",
		"Объект.cbr_ЦеныПоТоварам.ПрцентРучнаяСкидка",
		НСтр("ru='% руч.'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамСуммаРучнаяСкидка",
		"Объект.cbr_ЦеныПоТоварам.СуммаРучнаяСкидка",
		НСтр("ru='Сумма руч.'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамЦенаСоСкидкой",
		"Объект.cbr_ЦеныПоТоварам.ЦенаСоСкидкой",
		НСтр("ru=' Цена со скидкой'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамСумма",
		"Объект.cbr_ЦеныПоТоварам.Сумма",
		НСтр("ru='Сумма'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамДатаНачала",
		"Объект.cbr_ЦеныПоТоварам.ДатаНачала",
		НСтр("ru='Дата начала'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамДатаОкончания",
		"Объект.cbr_ЦеныПоТоварам.ДатаОкончания",
		НСтр("ru='Дата окончания'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамДатаОкончания",
		"Объект.cbr_ЦеныПоТоварам.ДатаОкончания",
		НСтр("ru='Дата окончания'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамХарактеристикиИспользуются",
		"Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются",
		НСтр("ru='Характеристики используются'"),
		ВидПоляФормы.ПолеФлажка,
		Форма.Элементы.ЦеныПоТоварам,);
		
	КонецЕсли;
	//--AlopinAS 28.01.2026 ПРД.20
КонецПроцедуры