Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);
	//++ Тусеев Н.Ю. 27.01.2026 ПРД24
	ИначеЕсли ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда	
	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЦенаСоСкидкой", "Цена со скидкой, без НДС", 
	"Объект.Товары.cbr_ЦенаСоСкидкой", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, Форма.Элементы.ТоварыПроцентАвтоматическойСкидки); 	
	Для Каждого Стр Из Форма.Объект.Товары Цикл
		Стр.cbr_ЦенаСоСкидкой = Стр.Сумма / Стр.КоличествоУпаковок;
	КонецЦикла
	//-- Тусеев Н.Ю. 27.01.2026 ПРД24			
	КонецЕсли;
КонецПроцедуры