Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);		
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда 
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТранспортныйТариф",
		 "Объект.cbr_ТранспортныйТариф",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
		 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
		 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_СтоимостьДоставкиСНДС",
		 "Объект.cbr_СтоимостьДоставкиСНДС",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
		 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
		 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_СтоимостьДоставкиБезНДС",
		 "Объект.cbr_СтоимостьДоставкиБезНДС",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
		 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
		 		
	КонецЕсли;
		
КонецПроцедуры