
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);		
	КонецЕсли;
	
	//++AlopinAS 28.01.2026 ПРД.20
	Если ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда

		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма,
		"СтраницаУточнениеЦенПоТоварам",
		НСтр("ru='Уточнение цен по товарам'"),
		Форма.Элементы.ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма,
		"ГруппаУточнениеЦенПоТоварам",
		 Неопределено,
		 Форма.Элементы.СтраницаУточнениеЦенПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма,
		"ЦеныПоТоварам",
		"Объект.cbr_ЦеныПоТоварам",
		Форма.Элементы.ГруппаУточнениеЦенПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамНоменклатура",
		"Объект.cbr_ЦеныПоТоварам.Номенклатура",
		НСтр("ru='Номенклатура'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамХарактеристика",
		"Объект.cbr_ЦеныПоТоварам.Характеристика",
		НСтр("ru='Характеристика'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамЕдиницаИзмерения",
		"Объект.cbr_ЦеныПоТоварам.ЕдиницаИзмерения",
		НСтр("ru='Ед. изм.'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамКоличество",
		"Объект.cbr_ЦеныПоТоварам.Количество",
		НСтр("ru='Количество'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамВидЦены",
		"Объект.cbr_ЦеныПоТоварам.ВидЦены",
		НСтр("ru='Вид цены'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамЦена",
		"Объект.cbr_ЦеныПоТоварам.Цена",
		НСтр("ru='Цена'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,, "ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамПрцентРучнаяСкидка",
		"Объект.cbr_ЦеныПоТоварам.ПрцентРучнаяСкидка",
		НСтр("ru='% руч.'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамСуммаРучнаяСкидка",
		"Объект.cbr_ЦеныПоТоварам.СуммаРучнаяСкидка",
		НСтр("ru='Сумма руч.'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамЦенаСоСкидкой",
		"Объект.cbr_ЦеныПоТоварам.ЦенаСоСкидкой",
		НСтр("ru=' Цена со скидкой'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам,,"ПриИзменении");
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамСумма",
		"Объект.cbr_ЦеныПоТоварам.Сумма",
		НСтр("ru='Сумма'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамДатаНачала",
		"Объект.cbr_ЦеныПоТоварам.ДатаНачала",
		НСтр("ru='Дата начала'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамДатаОкончания",
		"Объект.cbr_ЦеныПоТоварам.ДатаОкончания",
		НСтр("ru='Дата окончания'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ЦеныПоТоварам);
			
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЦеныПоТоварамХарактеристикиИспользуются",
		"Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются",
		НСтр("ru='Характеристики используются'"),
		ВидПоляФормы.ПолеФлажка,
		Форма.Элементы.ЦеныПоТоварам);
		
		ДополнитьУсловноеОформление(Форма);
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		cbr_РаботаСФормами.ДобавитьРеквизитФормы(форма,
		"СтрокаИзСоглашенияСКлиентом",
		"",
		"Объект.Товары",
		НСтр("ru='СтрокаИзСоглашенияСКлиентом'"),
		Истина);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ТоварыСтрокаИзСоглашенияСКлиентом",
		"Объект.Товары.СтрокаИзСоглашенияСКлиентом",
		НСтр("ru='Это строка из соглашения с клиентом'"),
		ВидПоляФормы.ПолеФлажка,
		Форма.Элементы.Товары);
		
		ДополнитьУсловноеОформление(Форма);
	КонецЕсли;
	
	//--AlopinAS 28.01.2026 ПРД.20
КонецПроцедуры

//++AlopinAS 28.01.2026 ПРД.20
Процедура ДополнитьУсловноеОформление(Форма) 
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристикиИспользуются");
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость",  Ложь);
	
	
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристика");
	
   		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются");
    	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
		ОтборЭлемента.ПравоеЗначение = Ложь; 
    
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Не используются>");
	
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамСумма");
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
	
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамСуммаРучнаяСкидка");
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
		
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристикиИспользуются");
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость",  Ложь);
		
		
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамДатаНачала");
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
		
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамДатаОкончания");
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыПроцентРучнойСкидки");
	
   		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.СтрокаИзСоглашенияСКлиентом");
    	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
		ОтборЭлемента.ПравоеЗначение = Истина; 
    
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);	
		
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыСтрокаИзСоглашенияСКлиентом");
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость",  Ложь);
		
	КонецЕсли;
КонецПроцедуры
//--AlopinAS 28.01.2026 ПРД.20