
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);		
	КонецЕсли;
	
	//++ cba AlopinAS 27.01.26
	Если ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлементаРеквизитыКонтрагента" Тогда
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ОтрасльКонтрагента",
		"Объект.cbr_ОтрасльКонтрагента",
		НСтр("ru='Отрасль контрагента'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ГруппаАтрибутыНаименования);
		
		cbr_РаботаСФормами.ДобавитьДействияЭлементаФормы(Форма.Элементы.ОтрасльКонтрагента, "НачалоВыбора"); 
	КонецЕсли;
	//-- cba AlopinAS 27.01.26
	
КонецПроцедуры
