#Область СобытияФормСервер

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);
	ИначеЕсли ИмяФормы = "Справочник.СпособыОбеспеченияПотребностей.Форма.ФормаЭлемента" Тогда 
		//++ ШмелевР 27.01.2026 ЗКП.1
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ПроцентКЗакупке",
		 "Объект.cbr_ПроцентКЗакупке",
		 НСтр("ru='Процент к закупке'"),
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.ГруппаКолонкиОбеспечиваемыйПериод);
		
		//-- ШмелевР 27.01.2026 ЗКП.1		
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти