Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);		
	КонецЕсли;
	
	//++ cba AlopinAS 27.01.26
	Если ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"Проект",
		"Объект.cbr_Проект",
		НСтр("ru='Проект'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ГруппаШапкаЛево);
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"Проект",
		"Объект.cbr_Проект",
		НСтр("ru='Проект'"),
		ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ГруппаШапкаЛево);
		cbr_РаботаСФормами.ДобавитьДействияЭлементаФормы(Форма.Элементы.Соглашение, "ПриИзменении");
	КонецЕсли;
	//-- cba AlopinAS 27.01.26
	
КонецПроцедуры