#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	Элементы = Форма.Элементы;

	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда

	ИначеЕсли ИмяФормы = "Документ.ЭтапПроизводства2_2.Форма.Диспетчирование" Тогда
				
		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "НоваяПозицияВОчереди", Новый ОписаниеТипов);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	ИначеЕсли ИмяФормы = "Документ.ЭтапПроизводства2_2.Форма.ФормаДокумента" Тогда 
		//++ ПРЗ.18 Мохов
		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_ВремяКонтроляДата",
			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(8)));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ВремяКонтроляДата",
			"Время контроля (на момент открытия документа)", "cbr_ВремяКонтроляДата", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.Группа11, , Новый Структура("ТолькоПросмотр", Истина));
			
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СтатусКонтроля",
			"Статус контроля", "Объект.cbr_СтатусКонтроля", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаШапкаПраво, Элементы.ГруппаСообщенияКоманды,,);
		Форма.Элементы.cbr_СтатусКонтроля.УстановитьДействие("ПриИзменении", "cbr_СтатусКонтроляПриИзменении");					
		//-- ПРЗ.18 Мохов
			
		//++АшаеваАН 06.02.26 ПРЗ.13
		ФормыУХ.СоздатьКоманду(Форма, "cbr_УвеличитьВыпуск", "Увеличить выпуск", "cbr_УвеличитьВыпуск");

		ФормыУХ.СоздатьКнопкуФормы(Форма.Элементы, "cbr_УвеличитьВыпуск", , "cbr_УвеличитьВыпуск",
			ВидКнопкиФормы.КнопкаКоманднойПанели, Форма.Элементы.ОбеспечениеМатериаламиИРаботами.КоманднаяПанель);

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_МассивЭтапов",
			Новый ОписаниеТипов("СписокЗначений"));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		//--АшаеваАН 06.02.26 ПРЗ.13
		
		//++ ШмелевР 04.03.2026 ПРЗ.3

		ГруппаРасходыПроизводства = ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_ГруппаРасходыПроизводства", 
		" ", ВидГруппыФормы.ОбычнаяГруппа, Элементы.ГруппаВыполнениеЛево);

		ЗаполнитьЗначенияСвойств(ГруппаРасходыПроизводства, Форма.Элементы.ГруппаЗапланировано, "Группировка, Поведение, Отображение"); 
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТехПотери",, "Объект.cbr_ТехПотери", ВидПоляФормы.ПолеВвода,
			ГруппаРасходыПроизводства);
			
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_Брак",, "Объект.cbr_Брак", ВидПоляФормы.ПолеВвода,
			ГруппаРасходыПроизводства);
			
        ФормыУХ.СоздатьКоманду(Форма, "cbr_ПерерасчетРасходов", "cbr_ПерерасчетРасходов", "cbr_ПерерасчетРасходов");
		ФормыУХ.СоздатьКнопкуФормы(Форма.Элементы, "cbr_ПерерасчетРасходов", , "cbr_ПерерасчетРасходов",
			ВидКнопкиФормы.ОбычнаяКнопка, ГруппаРасходыПроизводства);			

        ЗаполнитьЗначенияСвойств(Форма.Команды.cbr_ПерерасчетРасходов, Форма.Команды.ОтразитьКоличествоФактВТЧ, "Картинка, Отображение");
        
		//-- ШмелевР 04.03.2026 ПРЗ.3

	ИначеЕсли ИмяФормы = "Документ.ПриобретениеУслугПрочихАктивов.Форма.ФормаДокумента" Тогда 
		
		//++АшаеваАН 03.02.26 СКЛ.9
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ЗаданиеНаПеревозку",, "Объект.cbr_ЗаданиеНаПеревозку", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ГруппаПараметрыПраво, , Новый Структура("ТолькоПросмотр", Истина));	
		Форма.Элементы.cbr_ЗаданиеНаПеревозку.УстановитьДействие("ПриИзменении", "cbr_ЗаданиеНаПеревозкуПриИзменении");
				
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_ГруппаПараметрыЗаданиеНаПеревозку",,, Форма.Элементы.ГруппаОсновное);
			
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_Транспорт",, "Объект.cbr_Транспорт", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_ГруппаПараметрыЗаданиеНаПеревозку);	
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_Марка",, "Объект.cbr_Марка", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_ГруппаПараметрыЗаданиеНаПеревозку);
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерМашины",, "Объект.cbr_НомерМашины", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_ГруппаПараметрыЗаданиеНаПеревозку);
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерПрицепа",, "Объект.cbr_НомерПрицепа", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_ГруппаПараметрыЗаданиеНаПеревозку);
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерЗаявкиПоДаннымПеревозчика",, "Объект.cbr_НомерЗаявкиПоДаннымПеревозчика", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_ГруппаПараметрыЗаданиеНаПеревозку);
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерПеревозкиAtrucks",, "Объект.cbr_НомерПеревозкиAtrucks", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_ГруппаПараметрыЗаданиеНаПеревозку);
		//--АшаеваАН 03.02.26 СКЛ.9

	ИначеЕсли ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда 
		
		//++ Мохов 19/02/2026 ПРЗ.17	
		ПараметрыЭлемента = Новый Структура;
		ПараметрыЭлемента.Вставить("ТолькоПросмотр", Истина);
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыАктуальность", "Актуальность",
			"Объект.Товары.cbr_Актуальность", ВидПоляФормы.ПолеФлажка, Форма.Элементы.Товары,
			Форма.Элементы.ТоварыОбособленно, ПараметрыЭлемента);
		//-- Мохов 19/02/2026 ПРЗ.17	
		
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Объект = Форма.Объект;

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПересечениеМенеджеров","Пересечение менеджеров", "Объект.cbr_ПересечениеМенеджеров", 
		ВидПоляФормы.ПолеФлажка, Элементы.ГруппаОсновное, Элементы.ГруппаЭтапыОплатыРасчеты, 
		Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево));
		Форма.Элементы.cbr_ПересечениеМенеджеров.УстановитьДействие("ПриИзменении", "cbr_ПересечениеМенеджеровПриИзменении");

		Страница_ПересечениеМенеджеров = ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ПересечениеМенеджеров", 
		"Пересечение менеджеров", ВидГруппыФормы.Страница, Элементы.ГруппаСтраницы,, Новый Структура("Видимость", Объект.cbr_ПересечениеМенеджеров));

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаПересечениеМенеджеров",,, Страница_ПересечениеМенеджеров);

		Таблица_ПересечениеМенеджеров = ФормыУХ.СоздатьТаблицуФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеров",,
		"Объект.cbr_ТЧПересечениеМенеджеров", Форма.Элементы.ГруппаПересечениеМенеджеров);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеровНомерСтроки",, "Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_ТЧПересечениеМенеджеров);
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо",, "Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_ТЧПересечениеМенеджеров);
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеровПроцент",, "Объект.cbr_ТЧПересечениеМенеджеров.Процент", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_ТЧПересечениеМенеджеров);

		//-- БаженоваЕО 27.01.2026
		
		//++ Тусеев Н.Ю. 27.01.2026 ПРД24
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЦенаСоСкидкой", "Цена со скидкой, без НДС",
			"Объект.Товары.cbr_ЦенаСоСкидкой", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,
			Форма.Элементы.ТоварыПроцентАвтоматическойСкидки);
		Форма.Элементы.ТоварыЦенаСоСкидкой.УстановитьДействие("ПриИзменении", "ТоварыЦенаСоСкидкойПриИзменении");
		Для Каждого Стр Из Форма.Объект.Товары Цикл
			Если Стр.КоличествоУпаковок <> 0 Тогда
				Стр.cbr_ЦенаСоСкидкой = Стр.Сумма / Стр.КоличествоУпаковок;
			КонецЕсли;
		КонецЦикла;
		//-- Тусеев Н.Ю. 27.01.2026 ПРД24
		
		//++ Тусеев Н.Ю. 27.01.2026 ПРД7
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаОбщийВес", "Общий вес", ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ГруппаИтого, , Новый Структура("ОтображатьЗаголовок", Ложь));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ОбщийВесДокумента",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "Вес", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "Объем", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ЕдиницаИзмеренияВеса",
			Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ЕдиницаИзмеренияОбъема",
			Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ВесУпаковки", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ОбъемУпаковки", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ОбщийВесДокумента", "Общий вес по документу, кг",
			"ОбщийВесДокумента", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаОбщийВес, ,
			Новый Структура("ТолькоПросмотр", Истина));

		ПараметрыЭлемента = Новый Структура("Видимость", Ложь);
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыВес", "Вес", "Объект.Товары.Вес", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЕдиницаИзмеренияВеса", "Единица измерения веса",
			"Объект.Товары.ЕдиницаИзмеренияВеса", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыОбъем", "Объем", "Объект.Товары.Объем", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЕдиницаИзмеренияОбъема", "Единица измерения объема",
			"Объект.Товары.ЕдиницаИзмеренияОбъема", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыВесУпаковки", "Вес упаковки", "Объект.Товары.ВесУпаковки",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыОбъемУпаковки", "Объем упаковки",
			"Объект.Товары.ОбъемУпаковки", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьВесУпаковки", Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
		СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки", Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса", Новый Структура("Номенклатура, Упаковка",
			"ЕдиницаИзмеренияВеса"));
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема", Новый Структура("Номенклатура, Упаковка",
			"ЕдиницаИзмеренияОбъема"));
		СтруктураДействий.Вставить("ПересчитатьВесОбъем");

		Для Каждого Стр Из Форма.Объект.Товары Цикл
			//++ cbr-larkovgeorg 09.02.2026 ПРД7
			ВесУпаковки = 0;
			РеквизитыЕдИзм = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Стр.Упаковка, "Числитель, Знаменатель, ТипИзмеряемойВеличины");
			
			Если ЗначениеЗаполнено(Стр.Упаковка) И РеквизитыЕдИзм.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
				ВесУпаковки = РеквизитыЕдИзм.Числитель;	
			ИначеЕсли ЗначениеЗаполнено(Стр.Упаковка) И РеквизитыЕдИзм.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Вес Тогда
				
				ВесУпаковки = РеквизитыЕдИзм.Знаменатель/РеквизитыЕдИзм.Числитель;
				
			ИначеЕсли Не ЗначениеЗаполнено(Стр.Упаковка) Тогда
				
				ВесУпаковки = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВесЧислитель");

			КонецЕсли;

			Форма.ОбщийВесДокумента = Форма.ОбщийВесДокумента + (ВесУпаковки * Стр.КоличествоУпаковок);
			//-- cbr-larkovgeorg 09.02.2026 ПРД7

		КонецЦикла;

	//-- Тусеев Н.Ю. 27.01.2026 ПРД7 
		
		//++АшаеваАН 29.01.26 ПРД.5
		СоздатьЭлементыСпециальныхТребований(Форма);
	    //--АшаеваАН 29.01.26 ПРД.5
	    
	    //++АшаеваАН 29.01.26 ПРД.11
	    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТранспортныйТариф",, "Объект.cbr_ТранспортныйТариф", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаСпособДоставкиПеревозчик, Форма.Элементы.СтраницыПеревозчик);
		Форма.Элементы.cbr_ТранспортныйТариф.УстановитьДействие("ПриИзменении", "cbr_ТранспортныйТарифПриИзменении");
		
	    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СтоимостьДоставкиСНДС",, "Объект.cbr_СтоимостьДоставкиСНДС", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаСпособДоставкиПеревозчик, Форма.Элементы.СтраницыПеревозчик);
		Форма.Элементы.cbr_СтоимостьДоставкиСНДС.УстановитьДействие("ПриИзменении", "cbr_СтоимостьДоставкиСНДСПриИзменении");
		
	    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СтоимостьДоставкиБезНДС",, "Объект.cbr_СтоимостьДоставкиБезНДС", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаСпособДоставкиПеревозчик, Форма.Элементы.СтраницыПеревозчик);
		Форма.Элементы.cbr_СтоимостьДоставкиБезНДС.УстановитьДействие("ПриИзменении", "cbr_СтоимостьДоставкиБезНДСПриИзменении");   
	    //--АшаеваАН 29.01.26 ПРД.11
	    
	    //++ AlopinAS 27.01.26 ПРД.22
	    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "Проект", НСтр("ru='Проект'"), "Объект.cbr_Проект", ВидПоляФормы.ПолеВвода,
		Форма.Элементы.ГруппаПараметрыПраво);
		//-- AlopinAS 27.01.26 ПРД.22
		
		//++ AlopinAS 27.01.26 ПРД.20
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыСтрокаИзСоглашенияСКлиентом", НСтр("ru='Это строка из соглашения с клиентом'"), 
		"Объект.Товары.cbr_СтрокаИзСоглашенияСКлиентом", ВидПоляФормы.ПолеФлажка, Форма.Элементы.Товары);
		//++ AlopinAS 27.01.26 ПРД.20

		//++ БаженоваЕО 10.03.2026 ПРД.21
		Элементcbr_МаксимальнаяРучнаяСкидка = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_МаксимальнаяРучнаяСкидка",
			, "Объект.cbr_МаксимальнаяРучнаяСкидка", , Элементы.ГруппаДополнительно);

		Элементcbr_ПроцентТУ = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПроцентТУ", , "Объект.cbr_ПроцентТУ", ,
			Элементы.ГруппаДополнительно);

		Элементcbr_МаксимальнаяРучная = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_МаксимальнаяРучная", ,
			"Объект.cbr_МаксимальнаяРучная", , Элементы.ГруппаДополнительно);

		Элементcbr_ПроцентАВ = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПроцентАВ", , "Объект.cbr_ПроцентАВ", ,
			Элементы.ГруппаДополнительно);

		Элементcbr_ПоСоглашению = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПоСоглашению", ,
			"Объект.Товары.cbr_ПоСоглашению", ВидПоляФормы.ПолеФлажка, Элементы.Товары, Элементы.ТоварыИндексНабора);
		Элементcbr_ПоСоглашению.Видимость = Ложь;

		Элементcbr_СовпадениеСуммПроцентаАВ = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СовпадениеСуммПроцентаАВ",
			, "Объект.cbr_СовпадениеСуммПроцентаАВ", , Элементы.ГруппаДополнительно);
		Элементcbr_СовпадениеСуммПроцентаАВ.Видимость = Ложь;
        //-- БаженоваЕО 10.03.2026
        
        //++ СкребковЮМ 11.03.26
        ЭлементДатаПостановкиВПлан = ФормыУХ.СоздатьПолеФормы(Элементы, "cbr_ЭлементДатаПостановкиВПлан",
			, "Объект.cbr_ДатаПостановкиВПлан", ВидПоляФормы.ПолеВвода, Элементы.ГруппаДатаОтгрузкиНеОтгружатьЧастями);
		//-- СкребковЮМ 11.03.26

		ДополнитьУсловноеОформление(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Страница_ПересечениеМенеджеров = ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ПересечениеМенеджеров",
			"Пересечение менеджеров", ВидГруппыФормы.Страница, Форма.Элементы.ГруппаСтраницы);

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаПересечениеМенеджеров", , , Страница_ПересечениеМенеджеров);

		Таблица_ПересечениеМенеджеров = ФормыУХ.СоздатьТаблицуФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеров", ,
			"Объект.cbr_ТЧПересечениеМенеджеров", Форма.Элементы.ГруппаПересечениеМенеджеров);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеровНомерСтроки", "Пересечение менеджеров",
			"Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки", ВидПоляФормы.ПолеВвода, Таблица_ПересечениеМенеджеров);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо", ,
			"Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо", ВидПоляФормы.ПолеВвода, Таблица_ПересечениеМенеджеров);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТЧПересечениеМенеджеровПроцент", ,
			"Объект.cbr_ТЧПересечениеМенеджеров.Процент", ВидПоляФормы.ПолеВвода, Таблица_ПересечениеМенеджеров);
		Форма.Элементы.cbr_ТЧПересечениеМенеджеровПроцент.УстановитьДействие("ПриИзменении",
			"cbr_ТЧПересечениеМенеджеровПроцентПриИзменении");			
		//-- БаженоваЕО 27.01.2026
		
		//++ cbr-larkovgeorg 17.02.2026 ПРД24
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЦенаСоСкидкой", "Цена со скидкой, без НДС",
			"Объект.Товары.cbr_ЦенаСоСкидкой", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,
			Форма.Элементы.ТоварыПроцентАвтоматическойСкидки);
		Форма.Элементы.ТоварыЦенаСоСкидкой.УстановитьДействие("ПриИзменении", "ТоварыЦенаСоСкидкойПриИзменении");
		Для Каждого Стр Из Форма.Объект.Товары Цикл
			Если Стр.КоличествоУпаковок <> 0 Тогда
				Стр.cbr_ЦенаСоСкидкой = Стр.Сумма / Стр.КоличествоУпаковок;
			КонецЕсли;
		КонецЦикла;
		//-- cbr-larkovgeorg 17.02.2026 ПРД24	
		
	//++ Тусеев Н.Ю. 27.01.2026 ПРД2
	ИначеЕсли ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаКодFOBitrix", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.СтраницаОсновное, Форма.Элементы.ГруппаПартнерНаименование,
			Новый Структура("ОтображатьЗаголовок", Ложь));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодFO", "Код FO", "Объект.cbr_КодFO", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаКодFOBitrix);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодBitrix", "Код Bitrix", "Объект.cbr_КодBitrix",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаКодFOBitrix);

	ИначеЕсли ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлементаРеквизитыКонтрагента" Тогда
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаКодFOBitrix", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ГруппаОбщаяИнформация, Форма.Элементы.ГруппаЮрФизЛицоДанныеФизЛица,
			Новый Структура("ОтображатьЗаголовок", Ложь));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодFO", Новый ОписаниеТипов("Строка",
			Новый КвалификаторыСтроки(25)));

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодBitrix",
			Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));

		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодFO", "Код FO", "cbr_КодFO", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаКодFOBitrix);
		Форма.Элементы.cbr_КодFO.УстановитьДействие("ПриИзменении", "cbr_КодFOПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодBitrix", "Код Bitrix", "cbr_КодBitrix",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаКодFOBitrix);
		Форма.Элементы.cbr_КодBitrix.УстановитьДействие("ПриИзменении", "cbr_КодBitrixПриИзменении");

		Контрагент = НайтиСсылкуПоРеквизиту("Справочники", "Контрагенты", "Партнер", Форма.Объект.Ссылка);
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "cbr_КодFO, cbr_КодBitrix");
			ЗаполнитьЗначенияСвойств(Форма, ДанныеКонтрагента);
		КонецЕсли;
	//-- Тусеев Н.Ю. 27.01.2026 ПРД2	
	
	//++ cba AlopinAS 27.01.26
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ОтрасльКонтрагента", НСтр("ru='Отрасль контрагента'"), 
		"Объект.cbr_ОтрасльКонтрагента", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаАтрибутыНаименования);
		Форма.Элементы.ОтрасльКонтрагента.УстановитьДействие("НачалоВыбора", "ОтрасльКонтрагентаНачалоВыбора");
	//-- cba AlopinAS 27.01.26	
		
	ИначеЕсли ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлемента" Тогда 
	
	//++ cba AlopinAS 27.01.26
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ОтрасльКонтрагента", НСтр("ru='Отрасль контрагента'"), 
		"Объект.cbr_ОтрасльКонтрагента", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаРодительБизнесРегион);
		Форма.Элементы.ОтрасльКонтрагента.УстановитьДействие("НачалоВыбора", "ОтрасльКонтрагентаНачалоВыбора");
	//-- cba AlopinAS 27.01.26
	
	ИначеЕсли ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		
	//++АшаеваАН 29.01.26 ПРД.5		
		СоздатьЭлементыСпециальныхТребований(Форма);
	//--АшаеваАН 29.01.26 ПРД.5
	
	//++ БаженоваЕО 27.02.2026 ПРД.21
		Элементcbr_МаксимальнаяРучнаяСкидка = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_МаксимальнаяРучнаяСкидка",
			, "Объект.cbr_МаксимальнаяРучнаяСкидка", , Элементы.СтраницаОсновное);
		Элементcbr_МаксимальнаяРучнаяСкидка.Видимость = Ложь;

		Элементcbr_ПроцентТУ = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "Элементcbr_ПроцентТУ", ,
			"Объект.cbr_ПроцентТУ", , Элементы.СтраницаОсновное);
		Элементcbr_ПроцентТУ.Видимость = Ложь;

		Элементcbr_МаксимальнаяРучная = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "Элементcbr_МаксимальнаяРучная", ,
			"Объект.cbr_МаксимальнаяРучная", , Элементы.СтраницаОсновное);
		Элементcbr_МаксимальнаяРучная.Видимость = Ложь;

		Элементcbr_ПроцентАВ = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "Элементcbr_ПроцентАВ", ,
			"Объект.cbr_ПроцентАВ", , Элементы.СтраницаОсновное);
		Элементcbr_ПроцентАВ.Видимость = Ложь;
		
		#Область УХ_УниверсальныеПроцессыСогласование
		ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(Форма);
		МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(Форма);
		#КонецОбласти
    //-- БаженоваЕО 27.02.2026
	
	//++ AlopinAS 27.01.26 ПРД.22	
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "Проект", НСтр("ru='Проект'"), 
		"Объект.cbr_Проект", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаШапкаПраво);
	//-- AlopinAS 27.01.26 ПРД.22
	
	//++ Zhiend 11.02.2026 ПРЗ.30
	
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_СтраницаПроизводство",
        "Производство", ВидГруппыФормы.Страница, Элементы.cbr_ГруппаСтраницы);

		ТЧ_РесурсныеСпецификации = Метаданные.Справочники.СоглашенияСКлиентами.ТабличныеЧасти.cbr_РесурсныеСпецификации;

		ФормыУХ.СоздатьТаблицуФормы(Форма.Элементы, "cbr_РесурсныеСпецификации",,
		"Объект.cbr_РесурсныеСпецификации", Форма.Элементы.cbr_СтраницаПроизводство);

		Для Каждого ЭлемТч Из ТЧ_РесурсныеСпецификации.Реквизиты Цикл
			
			ФормыУХ.СоздатьПолеФормы(Форма.Элементы, ЭлемТч.Имя, ЭлемТч.Синоним, 
			"Объект.cbr_РесурсныеСпецификации." + ЭлемТч.Имя, ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_РесурсныеСпецификации);

		КонецЦикла;	
	//-- Zhiend 11.02.2026 ПРЗ.30

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "СтраницаУточнениеЦенПоТоварам",
        НСтр("ru='Уточнение цен по товарам'"), ВидГруппыФормы.Страница, Элементы.ГруппаСтраницы);

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаУточнениеЦенПоТоварам",,, Форма.Элементы.СтраницаУточнениеЦенПоТоварам);

		ФормыУХ.СоздатьТаблицуФормы(Форма.Элементы, "ЦеныПоТоварам",,
		"Объект.cbr_ЦеныПоТоварам", Форма.Элементы.ГруппаУточнениеЦенПоТоварам);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамНоменклатура", НСтр("ru='Номенклатура'"), 
		"Объект.cbr_ЦеныПоТоварам.Номенклатура", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамНоменклатура.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамНоменклатураПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамХарактеристика", НСтр("ru='Характеристика'"), 
		"Объект.cbr_ЦеныПоТоварам.Характеристика", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамХарактеристика.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамХарактеристикаПриИзменении");
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамЕдиницаИзмерения", НСтр("ru='Ед. изм.'"), 
		"Объект.cbr_ЦеныПоТоварам.ЕдиницаИзмерения", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамЕдиницаИзмерения.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамЕдиницаИзмеренияПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамКоличество", НСтр("ru='Количество'"), 
		"Объект.cbr_ЦеныПоТоварам.Количество", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамКоличество.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамКоличествоПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамВидЦены", НСтр("ru='Вид цены'"), 
		"Объект.cbr_ЦеныПоТоварам.ВидЦены", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамВидЦены.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамВидЦеныПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамЦена", НСтр("ru='Цена'"), 
		"Объект.cbr_ЦеныПоТоварам.Цена", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамЦена.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамЦенаПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамПрцентРучнаяСкидка", НСтр("ru='% руч.'"), 
		"Объект.cbr_ЦеныПоТоварам.ПрцентРучнаяСкидка", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамПрцентРучнаяСкидка.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамПрцентРучнаяСкидкаПриИзменении");
		ОбщегоНазначенияБЗККлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, "ЦеныПоТоварамЦена", "ТолькоПросмотр", Истина);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамСуммаРучнаяСкидка", НСтр("ru='Сумма руч.'"), 
		"Объект.cbr_ЦеныПоТоварам.СуммаРучнаяСкидка", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамСуммаРучнаяСкидка.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамСуммаРучнаяСкидкаПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамЦенаСоСкидкой", НСтр("ru='Цена со скидкой'"), 
		"Объект.cbr_ЦеныПоТоварам.ЦенаСоСкидкой", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
		Форма.Элементы.ЦеныПоТоварамЦенаСоСкидкой.УстановитьДействие("ПриИзменении", "ЦеныПоТоварамЦенаСоСкидкойПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамСумма", НСтр("ru='Сумма'"), 
		"Объект.cbr_ЦеныПоТоварам.Сумма", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);
	
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамДатаНачала", НСтр("ru='Дата начала'"), 
		"Объект.cbr_ЦеныПоТоварам.ДатаНачала", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамДатаОкончания", НСтр("ru='Дата окончания'"), 
		"Объект.cbr_ЦеныПоТоварам.ДатаОкончания", ВидПоляФормы.ПолеВвода, Форма.Элементы.ЦеныПоТоварам);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЦеныПоТоварамХарактеристикиИспользуются", НСтр("ru='Характеристики используются'"), 
		"Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются", ВидПоляФормы.ПолеФлажка, Форма.Элементы.ЦеныПоТоварам);

		ДополнитьУсловноеОформление(Форма);
	ИначеЕсли ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" Тогда

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаОтрасльКонтрагента", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.СтраницаДополнительныеСведения, , Новый Структура("ОтображатьЗаголовок", Ложь));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_ОтрасльКонтрагента",
			Новый ОписаниеТипов("СправочникСсылка.cbr_ОтраслиКонтрагентов"));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ОтрасльКонтрагента", "Отрасль контрагента",
			"cbr_ОтрасльКонтрагента", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаСегментПервичныйИнтересКомпания);
		Форма.Элементы.cbr_ОтрасльКонтрагента.УстановитьДействие("НачалоВыбора", "cbr_ОтрасльКонтрагентаНачалоВыбора");		
		//-- cba AlopinAS 27.01.26

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаКодFOBitrix", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.СтраницаПервичнаяИнформация, , Новый Структура("ОтображатьЗаголовок", Ложь));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодFO", Новый ОписаниеТипов("Строка",
			Новый КвалификаторыСтроки(25)));

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодBitrix",
			Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));

		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодFO", "Код FO", "cbr_КодFO", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаКодFOBitrix);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодBitrix", "Код Bitrix", "cbr_КодBitrix",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаКодFOBitrix);
			
	ИначеЕсли ИмяФормы = "Справочник.СпособыОбеспеченияПотребностей.Форма.ФормаЭлемента" Тогда 
		
		//++ ШмелевР 27.01.2026 ЗКП.1
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПроцентКЗакупке", НСтр("ru='Процент к закупке'"), "Объект.cbr_ПроцентКЗакупке", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.ГруппаКолонкиОбеспечиваемыйПериод);  
		//-- ШмелевР 27.01.2026 ЗКП.1	
		
	ИначеЕсли ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		//++ cba AlopinAS 27.01.26 ЗКП.4
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЭтоТендер", НСтр("ru='Тендер'"), "Объект.cbr_ЭтоТендер", ВидПоляФормы.ПолеФлажка,
        Форма.Элементы.ГруппаДополнительныеРеквизиты); 	
		//-- cba AlopinAS 27.01.26 ЗКП.4
		
		//++ ШмелевР  06.02.2026 ЗКП.1
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ОптимальнаяПартияЗаказа", НСтр("ru='Оптимальная партия заказа'"), "Объект.cbr_ОптимальнаяПартияЗаказа", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.СворачиваемаяГруппаОбеспечение, Форма.Элементы.ГиперссылкаПерейтиВариантыКомплектации); 
		//-- ШмелевР  06.02.2026 ЗКП.1

		//++ cbr-georglarkov 06.02.26 ПРЗ.24
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "Округление", НСтр("ru='Округлять номенклатуру'"), "Объект.cbr_Округление", ВидПоляФормы.ПолеФлажка,
        Форма.Элементы.ГруппаДополнительныеРеквизиты);

		Если Не УправлениеДоступом.ЕстьРоль("cbr_ОкруглятьНоменклатуру") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Округление", "Доступность", Ложь);
		КонецЕсли;	
		//-- cbr-georglarkov 06.02.26 ПРЗ.24
		
	ИначеЕсли ИмяФормы = "Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента" Тогда
		
		//++ СкребковЮМ 04.02.26 СКЛ.6 	
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_ГруппаИнтеграцияAtrucks", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ГруппаОсновное, Форма.Элементы.ГруппаДополнительныеРеквизиты,
			Новый Структура("ОтображатьЗаголовок, Группировка", Ложь,
			ГруппировкаПодчиненныхЭлементовФормы.Вертикальная));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерЗаявкиПоДаннымПеревозчика",
			"Номер заявки по данным перевозчика", "Объект.cbr_НомерЗаявкиПоДаннымПеревозчика", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.cbr_ГруппаИнтеграцияAtrucks);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерПеревозкиAtrucks", "Номер перевозки Atrucks",
			"Объект.cbr_НомерПеревозкиAtrucks", ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_ГруппаИнтеграцияAtrucks);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ФактическаяСтоимостьПеревозки",
			"Фактическая стоимость перевозки (без НДС), руб.", "Объект.cbr_ФактическаяСтоимостьПеревозки",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_ГруппаИнтеграцияAtrucks);
		//-- СкребковЮМ 04.02.26 СКЛ.6
		
		//++ БаженоваЕО 03.02.2026 СКЛ.4
		Элементы.ЗаданиеВыполняет.СписокВыбора.Добавить(
			Перечисления.ТипыИсполнителейЗаданийНаПеревозку["cbr_НеУчаствуемВДоставке"]);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КоличествоПаллет",, "Объект.cbr_КоличествоПаллет", ВидПоляФормы.ПолеВвода, 
		Форма.Элементы.ГруппаОсновное, Форма.Элементы.ДополнительнаяИнформация , Новый Структура("ТолькоПросмотр", Истина));  
		//-- БаженоваЕО 03.02.2026

	ИначеЕсли ИмяФормы = "Обработка.ФормированиеЭтаповПроизводства.Форма.Форма" Тогда
		
		//++АшаеваАН 06.02.26 ПРЗ.7
		ФормыУХ.СоздатьКоманду(Форма, "cbr_РазбитьСтроку", "Разбить строку", "cbr_РазбитьСтроку");

		ФормыУХ.СоздатьКнопкуФормы(Форма.Элементы, "cbr_РазбитьСтроку", , "cbr_РазбитьСтроку",
			ВидКнопкиФормы.КнопкаКоманднойПанели, Форма.Элементы.ГруппаДействияНоменклатурныйПлан,
			Форма.Элементы.Группа9);

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_ЭтоКопия", Новый ОписаниеТипов("Булево"),
			"Объект.ПланИтоги");
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		НовыйЭлемент = ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ЭтоКопия", "Копия", "Объект.ПланИтоги.cbr_ЭтоКопия",
			ВидПоляФормы.ПолеФлажка, Форма.Элементы.ПланИтоги, Форма.Элементы.ПланИтогиГруппа1);
		НовыйЭлемент.ТолькоПросмотр = Истина;
		НовыйЭлемент.ВидФлажка = ВидФлажка.Флажок;
		//--АшаеваАН 06.02.26 ПРЗ.7

	ИначеЕсли ИмяФормы = "Справочник.Склады.Форма.ФормаЭлемента" Тогда
		
		//++ СкребковЮМ 10.02.26 СКЛ.19
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_ГруппаВидСклада", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ОсновноеПраво, , Новый Структура("ОтображатьЗаголовок, Группировка", Ложь,
			ГруппировкаПодчиненныхЭлементовФормы.Вертикальная));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СкладГотовойПродукции", "Склад готовой продукции",
			"Объект.cbr_СкладГотовойПродукции", ВидПоляФормы.ПолеФлажка, Форма.Элементы.cbr_ГруппаВидСклада);
		//-- СкребковЮМ 10.02.26 СКЛ.19
		
		//++АшаеваАН 13.02.26 СКЛ.3
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СкладРаспределения", "Склад распределения",
			"Объект.cbr_СкладРаспределения", ВидПоляФормы.ПолеФлажка, Форма.Элементы.cbr_ГруппаВидСклада);
		//--АшаеваАН 13.02.26 СКЛ.3
		
	ИначеЕсли ИмяФормы = "Обработка.РабочееМестоМенеджераПоДоставке.Форма.Форма" Тогда
		
		//++ БаженоваЕО 05.02.2026 СКЛ.4
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ЗаданиеВыполняет",, "Объект.cbr_ЗаданиеВыполняет", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.ЗаданияНаПеревозкуВРаботеОтбор, Форма.Элементы.КоманднаяПанельЗаданияНаПеревозкуВРаботе);    
        Форма.Элементы.cbr_ЗаданиеВыполняет.УстановитьДействие("ПриИзменении", "cbr_ЗаданиеВыполняетПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ЗаданиеВыполняет",, "ЗаданияНаПеревозкуВРаботе.ЗаданиеВыполняет", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.ЗаданияНаПеревозкуВРаботе, Форма.Элементы.ЗаданияНаПеревозкуВРаботеСтатус);
		//-- БаженоваЕО 05.02.2026

	ИначеЕсли ИмяФормы = "Справочник.СкладскиеЯчейки.Форма.ФормаЭлемента" Тогда
		
		//++ СкребковЮМ 16.02.26 СКЛ.13
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_ГруппаСборка", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ГруппаОсновное, , Новый Структура("ОтображатьЗаголовок, Группировка", Ложь,
			ГруппировкаПодчиненныхЭлементовФормы.Вертикальная));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СборкаСухих", "Сборка сухих", "Объект.cbr_СборкаСухих",
			ВидПоляФормы.ПолеФлажка, Форма.Элементы.cbr_ГруппаСборка);
		//-- СкребковЮМ 16.02.26 СКЛ.13
		
	ИначеЕсли ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда
		
		//++АшаеваАН 13.02.26 СКЛ.3
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ЗаказПоставщику",,"Объект.Товары.cbr_ЗаказПоставщику", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, Форма.Элементы.ТоварыДоступно, Новый Структура("ТолькоПросмотр", Истина));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПТУ", , "Объект.Товары.cbr_ПТУ",
		ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, Форма.Элементы.ТоварыДоступно, Новый Структура("ТолькоПросмотр", Истина));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_СкладРаспределения",
			Новый ОписаниеТипов("Булево"));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		Если ЗначениеЗаполнено(Форма.Объект.СкладОтправитель) Тогда
			Форма.cbr_СкладРаспределения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.СкладОтправитель, 
			"cbr_СкладРаспределения");
		КонецЕсли;

		Элемент =  Форма.УсловноеОформление.Элементы.Добавить();

		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("cbr_ЗаказПоставщику");
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("cbr_ПТУ");

		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("cbr_СкладРаспределения");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ТоварыВариантОбеспечения",
			"ТолькоПросмотр", Истина);
		//--АшаеваАН 13.02.26 СКЛ.3

	ИначеЕсли ИмяФормы = "Документ.ПеремещениеТоваров.Форма.ФормаДокумента" Тогда
		
		//++АшаеваАН 13.02.26 СКЛ.3
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ЗаказПоставщику",,"Объект.Товары.cbr_ЗаказПоставщику", 
		ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, Форма.Элементы.ТоварыГруппаЗаказНаПеремещение, 
		Новый Структура("ТолькоПросмотр", Истина));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПТУ", , "Объект.Товары.cbr_ПТУ",
		ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, Форма.Элементы.ТоварыГруппаЗаказНаПеремещение, 
		Новый Структура("ТолькоПросмотр", Истина));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_СкладРаспределения",
			Новый ОписаниеТипов("Булево"));
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		Если ЗначениеЗаполнено(Форма.Объект.СкладОтправитель) Тогда
			Форма.cbr_СкладРаспределения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.СкладОтправитель,
				"cbr_СкладРаспределения");
		КонецЕсли;

		Элемент =  Форма.УсловноеОформление.Элементы.Добавить();

		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("cbr_ЗаказПоставщику");
		ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("cbr_ПТУ");

		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("cbr_СкладРаспределения");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		//--АшаеваАН 13.02.26 СКЛ.3

	ИначеЕсли ИмяФормы = "Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаЭлементаУпаковки" Тогда
		
		//++ cbr-larkovgeorg 10.02.26 СКЛ.12
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СвойствоУпаковки", "Свойство упаковки",
			"Объект.cbr_СвойствоУпаковки", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаШапка,
			Элементы.ЕдиницаИзмерения);
		//-- cbr-larkovgeorg 10.02.26 СКЛ.12
		
	ИначеЕсли ИмяФормы = "Документ.УпаковочныйЛист.Форма.ФормаДокумента" Тогда
		
		//++ cbr-larkovgeorg 10.02.26 СКЛ.12
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КоличествоПаллет", "Количество паллет",
			"Объект.cbr_КоличествоПаллет", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаОснованиеИтог);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "cbr_КоличествоПаллет",
			"Доступность", Ложь);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерПаллета", "Номер паллета", "Объект.Товары.cbr_НомерПаллета",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары);
		Форма.Элементы.cbr_НомерПаллета.УстановитьДействие("ПриИзменении", "cbr_НомерПаллетаПриИзменении");
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_Уровень", "Уровень", "Объект.Товары.cbr_Уровень",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары);

		ФормыУХ.СоздатьКоманду(Форма, "cbr_РасставитьПродукциюПоПаллетам", "Расставить продукцию по паллетам",
			"cbr_РасставитьПродукциюПоПаллетам");
			
		ФормыУХ.СоздатьКнопкуФормы(Форма.Элементы, "cbr_РасставитьПродукциюПоПаллетам",
			"Расставить продукцию по паллетам", "cbr_РасставитьПродукциюПоПаллетам", ,
			Форма.Элементы.ТоварыКоманднаяПанель, Форма.Элементы.ТоварыСортироватьПоВозрастанию);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_Паллет", "Паллет", "Объект.Товары.cbr_Паллет",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "cbr_Паллет", "Доступность", Ложь);

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ШапкаНиз", , , , Форма.Элементы.СтраницыОсновные);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_Контрагент", "Контрагент", "Объект.cbr_Контрагент",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ШапкаНиз);

		ПроверкаЗаполненностиНомеровПаллет = Форма.Объект.Товары.Итог("cbr_НомерПаллета");

		Если ПроверкаЗаполненностиНомеровПаллет > 0 Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ТоварыРаспаковать",
				"Доступность", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ТоварыУпаковать",
				"Доступность", Ложь);

		Иначе

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ТоварыРаспаковать",
				"Доступность", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ТоварыУпаковать",
				"Доступность", Истина);

		КонецЕсли;

		ДополнитьУсловноеОформление(Форма);													
		//-- cbr-larkovgeorg 10.02.26 СКЛ.12
		
	КонецЕсли;

КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	Элементы = Форма.Элементы;

	Если ИмяФормы = "Документ.ДвижениеПродукцииИМатериалов.Форма.ФормаДокумента" Тогда
		
		//++ СкребковЮМ 10.02.26 СКЛ.19
		cbr_СоздатьДокументыИзДвиженияПродукции(ТекущийОбъект);
		//-- СкребковЮМ 10.02.26 СКЛ.19

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++AlopinAS ПРД.20 12.02.2026
Процедура ДополнитьУсловноеОформление(Форма)
	ИмяФормы = Форма.ИмяФормы;

	Если ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристикиИспользуются");
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристика");

		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;

		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Не используются>");

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамСумма");
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамСуммаРучнаяСкидка");
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристикиИспользуются");
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамДатаНачала");
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамДатаОкончания");
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	КонецЕсли;

	Если ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыПроцентРучнойСкидки");

		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СтрокаИзСоглашенияСКлиентом");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыСуммаРучнойСкидки");

		ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СтрокаИзСоглашенияСКлиентом");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыСтрокаИзСоглашенияСКлиентом");
		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	КонецЕсли;

	Если ИмяФормы = "Документ.УпаковочныйЛист.Форма.ФормаДокумента" Тогда
		//++ cbr-larkovgeorg 10.02.26 СКЛ.12

		УпаковкиСЗаполненнымСвойством = Новый СписокЗначений;
		УпаковкиСЗаполненнымСвойствомТЗ =  Справочники.УпаковкиЕдиницыИзмерения.cbr_ПолучениеУпаковокСЗаполненнымСвойством();
		Если УпаковкиСЗаполненнымСвойствомТЗ <> Неопределено Тогда
			УпаковкиСЗаполненнымСвойством.ЗагрузитьЗначения(УпаковкиСЗаполненнымСвойствомТЗ.ВыгрузитьКолонку(
				"Упаковка"));
		КонецЕсли;

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы.Товары.Имя);

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Упаковка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		ОтборЭлемента.ПравоеЗначение = УпаковкиСЗаполненнымСвойством;

		ОтборЭлемента.Использование = Истина;
		Элемент.Представление = "СвойстваУпаковок";
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы.Товары.Имя);

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Упаковка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента.ПравоеЗначение = УпаковкиСЗаполненнымСвойством;
		ОтборЭлемента.Использование = Истина;
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Черный);

		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Форма.Элементы.cbr_Уровень.Имя);

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.cbr_НомерПаллета");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		ОтборЭлемента.Использование = Истина;

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.cbr_Уровень");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		ОтборЭлемента.Использование = Истина;
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	КонецЕсли;
	//-- cbr-larkovgeorg 10.02.26 СКЛ.12
КонецПроцедуры //--AlopinAS ПРД.20 12.02.2026

Процедура СоздатьЭлементыСпециальныхТребований(Форма)
	
	//++АшаеваАН 29.01.26 ПРД.5
	 ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_СпециальныеТребования",
        "Специальные требования", ВидГруппыФормы.Страница, Форма.Элементы.ГруппаСтраницы);
	
	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_ГруппаСтраницы",, 
	ВидГруппыФормы.Страницы, Форма.Элементы.cbr_СпециальныеТребования);
        	
	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_Логистические", "Логистические", 
	ВидГруппыФормы.Страница, Форма.Элементы.cbr_ГруппаСтраницы,, Новый Структура("РастягиватьПоГоризонтали", Истина));

	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ДокументыДляВодителя",, "Объект.cbr_ДокументыДляВодителя", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_Логистические); 

	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТаможенноеСопровождение",, "Объект.cbr_ТаможенноеСопровождение", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_Логистические,, Новый Структура("ПоложениеЗаголовка,МногострочныйРежим", ПоложениеЗаголовкаЭлементаФормы.Лево, Истина)); 
    
    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_УсловияДоставки",, "Объект.cbr_УсловияДоставки", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_Логистические);     

	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_ТребованияКУпаковкеИКомплектации",
        "Требования к упаковке и комплектации", ВидГруппыФормы.Страница, Форма.Элементы.cbr_ГруппаСтраницы);
        
	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТребованияКУпаковке",, "Объект.cbr_ТребованияКУпаковке", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации,, Новый Структура("МногострочныйРежим", Истина)); 

	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТребованияКЭтикетке",, "Объект.cbr_ТребованияКЭтикетке", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации,, Новый Структура("МногострочныйРежим", Истина)); 
    
    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ТребованиеККомплектации",, "Объект.cbr_ТребованиеККомплектации", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации,, Новый Структура("МногострочныйРежим", Истина)); 
        
	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_УсловияГСХПриПоставке", "Условия ГСХ при поставке", 
	ВидГруппыФормы.Страница, Форма.Элементы.cbr_ГруппаСтраницы);

	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НеБолееДатыПроизводства",, "Объект.cbr_НеБолееДатыПроизводства", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_УсловияГСХПриПоставке); 

	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НеБолееДатыПроизводства",, "Объект.cbr_НеБолееДатыПроизводства", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_УсловияГСХПриПоставке); 
    
    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ДопустимыйОстатокГСХНеМенееПроцент",, "Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_УсловияГСХПриПоставке); 
 
 	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ДопустимыйОстатокГСХНеМенееМес",, "Объект.cbr_ДопустимыйОстатокГСХНеМенееМес", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_УсловияГСХПриПоставке); 

	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "cbr_СтраницаПрочиеТребования", "Прочие требования", 
	ВидГруппыФормы.Страница, Форма.Элементы.cbr_ГруппаСтраницы);

    ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ПрочиеТребования",, "Объект.cbr_ПрочиеТребования", ВидПоляФормы.ПолеВвода,
        Форма.Элементы.cbr_СтраницаПрочиеТребования,, Новый Структура("МногострочныйРежим", Истина)); 
   	//--АшаеваАН 29.01.26 ПРД.5

	//++ Тусеев Н.Ю. 04.02.2026 ПРД12 
	Если Форма.ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		ТЧ = Метаданные.Справочники.СоглашенияСКлиентами.ТабличныеЧасти.cbr_АгентскиеВознаграждения;
		РодительАгентскоеВознагрождение = Форма.Элементы.ГруппаШапкаПраво;
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		ТЧ = Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.cbr_АгентскиеВознаграждения;
		РодительАгентскоеВознагрождение = Форма.Элементы.ГруппаОсновное;
		ПоложениеПеред = Форма.Элементы.ГруппаЭтапыОплатыРасчеты;
	КонецЕсли;

	ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_АгентскоеВознаграждение", "Агентское вознаграждение",
		"Объект.cbr_АгентскоеВознаграждение", ВидПоляФормы.ПолеФлажка, РодительАгентскоеВознагрождение, ПоложениеПеред,
		Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево));
	ВыводАгентскогоСоглашения(Форма, ТЧ);		
	//-- Тусеев Н.Ю. 04.02.2026 ПРД12

КонецПроцедуры

//++ Тусеев Н.Ю. 27.01.2026 ПРД2
Функция НайтиСсылкуПоРеквизиту(ТипМетаданных, ОбъектМетаданныхИмя, ИмяРеквизита, ЗначениеРеквизита)

	ТипОбъектаМетаданных = Метаданные[ТипМетаданных];
	ОбъектМетаданных =  ТипОбъектаМетаданных[ОбъектМетаданныхИмя];
	Запрос = Новый Запрос;
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Ссылка ИЗ %1 ГДЕ %2 = &П", ОбъектМетаданных.ПолноеИмя(),
		ИмяРеквизита);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("П", ЗначениеРеквизита);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка[0];
	КонецЕсли;

КонецФункции //-- Тусеев Н.Ю. 27.01.2026 ПРД2

//++ Тусеев Н.Ю. 04.02.2026 ПРД12
Процедура ВыводАгентскогоСоглашения(Форма, ТЧ)

	Форма.Элементы.cbr_АгентскоеВознаграждение.УстановитьДействие("ПриИзменении",
		"cbr_АгентскоеВознаграждениеПриИзменении");

	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "СтраницаАгентскоеВознаграждение", "Агентское вознаграждение",
		ВидГруппыФормы.Страница, Форма.Элементы.ГруппаСтраницы, , Новый Структура("Видимость",
		Форма.Объект.cbr_АгентскоеВознаграждение));

	ФормыУХ.СоздатьТаблицуФормы(Форма.Элементы, "cbr_АгентскиеВознаграждения", "Агентские вознаграждения",
		"Объект.cbr_АгентскиеВознаграждения", Форма.Элементы.СтраницаАгентскоеВознаграждение);

	Для Каждого ЭлемТч Из ТЧ.Реквизиты Цикл
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, ЭлемТч.Имя, ЭлемТч.Синоним, "Объект.cbr_АгентскиеВознаграждения."
			+ ЭлемТч.Имя, ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_АгентскиеВознаграждения);
		//++ cbr-larkovgeorg 12.02.2026 ПРД12
		Если ЭлемТч.Имя = "ДоговорАгента" Тогда
			Форма.Элементы.cbr_АгентскиеВознаграждения.ПодчиненныеЭлементы.ДоговорАгента.УстановитьДействие(
				"НачалоВыбора", "cbr_АгентскоеВознаграждениеДоговорАгентаНачалоВыбора");
		КонецЕсли; //-- cbr-larkovgeorg 12.02.2026 ПРД12	
	КонецЦикла;

КонецПроцедуры //-- Тусеев Н.Ю. 04.02.2026 ПРД12

//++ СкребковЮМ 10.02.26 СКЛ.19
Процедура cbr_СоздатьДокументыИзДвиженияПродукции(Объект)
	
	БылПроведен = ?(Объект.ДополнительныеСвойства.Свойство("cbr_БылПроведен"), Объект.ДополнительныеСвойства.cbr_БылПроведен, Ложь);
	
	Если Не Объект.Проведен Или (Объект.Проведен И БылПроведен) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства Тогда

		Если Объект.Получатель <> Неопределено И ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Склады") Тогда
			СкладГотовойПродукции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Получатель,
				"cbr_СкладГотовойПродукции");

			Если СкладГотовойПродукции Тогда

				ДанныеПродукции = cbr_ПолучитьДанныеПродукции(Объект.Ссылка);

				Для Каждого СтрПродукция Из ДанныеПродукции Цикл

					ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.cbr_СоздатьПриходныйОрдерИзДвиженияПродукцииИМатериалов(
						Объект.Ссылка, СтрПродукция.Распоряжение, СтрПродукция.Помещение);
						
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //-- СкребковЮМ 10.02.26 СКЛ.19

//++ СкребковЮМ 10.02.26 СКЛ.19
Функция cbr_ПолучитьДанныеПродукции(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДвижениеПродукцииИМатериаловТовары.Распоряжение КАК Распоряжение,
	|	Номенклатура.СкладскаяГруппа КАК СкладскаяГруппа,
	|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель КАК Склад
	|ПОМЕСТИТЬ втДанныеПродукции
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ДвижениеПродукцииИМатериаловТовары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеПродукции.Распоряжение КАК Распоряжение,
	|	ЕСТЬNULL(ПравилаРазмещенияТоваровВЯчейках.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) КАК
	|		Помещение,
	|	МАКСИМУМ(ЕСТЬNULL(ПравилаРазмещенияТоваровВЯчейках.Приоритет, -1)) КАК Приоритет
	|ИЗ
	|	втДанныеПродукции КАК втДанныеПродукции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаРазмещенияТоваровВЯчейках КАК ПравилаРазмещенияТоваровВЯчейках
	|		ПО втДанныеПродукции.СкладскаяГруппа = ПравилаРазмещенияТоваровВЯчейках.СкладскаяГруппаНоменклатуры
	|		И втДанныеПродукции.Склад = ПравилаРазмещенияТоваровВЯчейках.Склад
	|СГРУППИРОВАТЬ ПО
	|	втДанныеПродукции.Распоряжение,
	|	ЕСТЬNULL(ПравилаРазмещенияТоваровВЯчейках.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка))";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

#КонецОбласти