Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Элементы = Форма.Элементы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);	
	ИначеЕсли ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда 
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Объект = Форма.Объект;
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ПересечениеМенеджеров", "Объект.cbr_ПересечениеМенеджеров", 
		"Пересечение менеджеров", ВидПоляФормы.ПолеФлажка, Элементы.ГруппаОсновное, Элементы.ГруппаЭтапыОплатыРасчеты, 
		"ПриИзменении");			
		
		Страница_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "ПересечениеМенеджеров",
		"Пересечение менеджеров", Элементы.ГруппаСтраницы);
		Страница_ПересечениеМенеджеров.Видимость = Объект.cbr_ПересечениеМенеджеров;
		
		Группа_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма, "ГруппаПересечениеМенеджеров",, 
		Страница_ПересечениеМенеджеров);
		
		Таблица_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма, "cbr_ТЧПересечениеМенеджеров", 
		"Объект.cbr_ТЧПересечениеМенеджеров", Группа_ПересечениеМенеджеров);		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровНомерСтроки", 
		"Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо", 
		"Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровПроцент", 
		"Объект.cbr_ТЧПересечениеМенеджеров.Процент",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		
		Если ЗначениеЗаполнено(Объект.Менеджер) Тогда
			Объект.cbr_ТЧПересечениеМенеджеров.Очистить();
			НоваяСтрока = Объект.cbr_ТЧПересечениеМенеджеров.Добавить();
			НоваяСтрока.ФизическоеЛицо = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Менеджер,"ФизическоеЛицо");
			НоваяСтрока.Процент = 100;			
		КонецЕсли;
		//-- БаженоваЕО 27.01.2026
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Страница_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "ПересечениеМенеджеров",
		"Пересечение менеджеров", Элементы.ГруппаСтраницы);
		
		Группа_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма, "ГруппаПересечениеМенеджеров",, 
		Страница_ПересечениеМенеджеров);
		
		Таблица_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма, "cbr_ТЧПересечениеМенеджеров", 
		"Объект.cbr_ТЧПересечениеМенеджеров", Группа_ПересечениеМенеджеров);		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровНомерСтроки", 
		"Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо", 
		"Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровПроцент", 
		"Объект.cbr_ТЧПересечениеМенеджеров.Процент",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		//-- БаженоваЕО 27.01.2026	
	КонецЕсли;
	
КонецПроцедуры