Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);		
	КонецЕсли;
	
	//++ cba AlopinAS 27.01.26
	Если ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		"ЭтоТендер",
		"Объект.cbr_ЭтоТендер",
		НСтр("ru='Тендер'"),
		ВидПоляФормы.ПолеФлажка,
		Форма.Элементы.ГруппаДополнительныеРеквизиты);		
	КонецЕсли;
	//++ cba AlopinAS 27.01.26
	
КонецПроцедуры