#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	Элементы = Форма.Элементы;

	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "НеПоддерживаетсяОстаток",
			"Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток", НСтр("ru='Не поддерживается остаток'"),
			ВидПоляФормы.ПолеФлажка, Форма.Элементы.ЗаказыКОбеспечению, Форма.Элементы.СпособОбеспеченияЗаказы);
	ИначеЕсли ИмяФормы = "Документ.ЭтапПроизводства2_2.Форма.Диспетчирование" Тогда 
		cbr_РаботаСФормами.ДобавитьРеквизитФормы(Форма, "НоваяПозицияВОчереди", Новый ОписаниеТипов());			
	
	ИначеЕсли ИмяФормы = "Документ.ПриобретениеУслугПрочихАктивов.Форма.ФормаДокумента" Тогда 
		
		//++АшаеваАН 03.02.26 СКЛ.9

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ЗаданиеНаПеревозку", "Объект.cbr_ЗаданиеНаПеревозку", ,
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаПараметрыПраво, , "ПриИзменении");

		ГруппаПараметрыЗаданиеНаПеревозку = cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма,
			"cbr_ГруппаПараметрыЗаданиеНаПеревозку", , Форма.Элементы.ГруппаОсновное);

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_Транспорт", "Объект.cbr_Транспорт", , ВидПоляФормы.ПолеВвода,
			ГруппаПараметрыЗаданиеНаПеревозку);

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_Марка", "Объект.cbr_Марка", , ВидПоляФормы.ПолеВвода,
			ГруппаПараметрыЗаданиеНаПеревозку);

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_НомерМашины", "Объект.cbr_НомерМашины", ,
			ВидПоляФормы.ПолеВвода, ГруппаПараметрыЗаданиеНаПеревозку);

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_НомерПрицепа", "Объект.cbr_НомерПрицепа", ,
			ВидПоляФормы.ПолеВвода, ГруппаПараметрыЗаданиеНаПеревозку);

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_НомерЗаявкиПоДаннымПеревозчика",
			"Объект.cbr_НомерЗаявкиПоДаннымПеревозчика", , ВидПоляФормы.ПолеВвода, ГруппаПараметрыЗаданиеНаПеревозку);

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_НомерПеревозкиAtrucks", "Объект.cbr_НомерПеревозкиAtrucks", ,
			ВидПоляФормы.ПолеВвода, ГруппаПараметрыЗаданиеНаПеревозку);
		
	//--АшаеваАН 03.02.26 СКЛ.9

	ИначеЕсли ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда 
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Объект = Форма.Объект;

		ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ПересечениеМенеджеров", 
		"Объект.cbr_ПересечениеМенеджеров", "Пересечение менеджеров", ВидПоляФормы.ПолеФлажка, Элементы.ГруппаОсновное,
			Элементы.ГруппаЭтапыОплатыРасчеты, "ПриИзменении");
		ПересечениеМенеджеров.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;

		Страница_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "ПересечениеМенеджеров",
			"Пересечение менеджеров", Элементы.ГруппаСтраницы);
		Страница_ПересечениеМенеджеров.Видимость = Объект.cbr_ПересечениеМенеджеров;

		Группа_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма, "ГруппаПересечениеМенеджеров", ,
			Страница_ПересечениеМенеджеров);

		Таблица_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма, "cbr_ТЧПересечениеМенеджеров",
			"Объект.cbr_ТЧПересечениеМенеджеров", Группа_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровНомерСтроки",
			"Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки", , ВидПоляФормы.ПолеВвода, Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо",
			"Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо", , ВидПоляФормы.ПолеВвода,
			Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровПроцент",
			"Объект.cbr_ТЧПересечениеМенеджеров.Процент", , ВидПоляФормы.ПолеВвода, Таблица_ПересечениеМенеджеров, ,
			"ПриИзменении");

		Если ЗначениеЗаполнено(Объект.Менеджер) Тогда
			Объект.cbr_ТЧПересечениеМенеджеров.Очистить();
			НоваяСтрока = Объект.cbr_ТЧПересечениеМенеджеров.Добавить();
			НоваяСтрока.ФизическоеЛицо = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Менеджер,
				"ФизическоеЛицо");
			НоваяСтрока.Процент = 100;
		КонецЕсли;
		//-- БаженоваЕО 27.01.2026
		
		//++ Тусеев Н.Ю. 27.01.2026 ПРД24
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЦенаСоСкидкой", "Цена со скидкой, без НДС",
			"Объект.Товары.cbr_ЦенаСоСкидкой", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,
			Форма.Элементы.ТоварыПроцентАвтоматическойСкидки);
		Форма.Элементы.ТоварыЦенаСоСкидкой.УстановитьДействие("ПриИзменении", "ТоварыЦенаСоСкидкойПриИзменении");
		Для Каждого Стр Из Форма.Объект.Товары Цикл
			Стр.cbr_ЦенаСоСкидкой = Стр.Сумма / Стр.КоличествоУпаковок;
		КонецЦикла;
		//-- Тусеев Н.Ю. 27.01.2026 ПРД24
		
		//++ Тусеев Н.Ю. 27.01.2026 ПРД7
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаОбщийВес", "Общий вес", ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ГруппаИтого, , Новый Структура("ОтображатьЗаголовок", Ложь));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ОбщийВесДокумента",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "Вес", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "Объем", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ЕдиницаИзмеренияВеса",
			Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ЕдиницаИзмеренияОбъема",
			Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ВесУпаковки", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "ОбъемУпаковки", Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");

		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ОбщийВесДокумента", "Общий вес по документу, кг",
			"ОбщийВесДокумента", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаОбщийВес, ,
			Новый Структура("ТолькоПросмотр", Истина));

		ПараметрыЭлемента = Новый Структура("Видимость", Ложь);
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыВес", "Вес", "Объект.Товары.Вес", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЕдиницаИзмеренияВеса", "Единица измерения веса",
			"Объект.Товары.ЕдиницаИзмеренияВеса", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыОбъем", "Объем", "Объект.Товары.Объем", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЕдиницаИзмеренияОбъема", "Единица измерения объема",
			"Объект.Товары.ЕдиницаИзмеренияОбъема", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыВесУпаковки", "Вес упаковки", "Объект.Товары.ВесУпаковки",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыОбъемУпаковки", "Объем упаковки",
			"Объект.Товары.ОбъемУпаковки", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары, , ПараметрыЭлемента);

		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьВесУпаковки", Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
		СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки", Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса", Новый Структура("Номенклатура, Упаковка",
			"ЕдиницаИзмеренияВеса"));
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема", Новый Структура("Номенклатура, Упаковка",
			"ЕдиницаИзмеренияОбъема"));
		СтруктураДействий.Вставить("ПересчитатьВесОбъем");

		Для Каждого Стр Из Форма.Объект.Товары Цикл
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, Неопределено);
			ВесЧислитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Упаковка, "Числитель");
			Стр.ВесУпаковки = ВесЧислитель;
			Форма.ОбщийВесДокумента = Форма.ОбщийВесДокумента + Стр.ВесУпаковки * Стр.КоличествоУпаковок;
		КонецЦикла;

	//-- Тусеев Н.Ю. 27.01.2026 ПРД7 
		
		//++АшаеваАН 29.01.26 ПРД.5
		СоздатьЭлементыСпециальныхТребований(Форма);
	    //--АшаеваАН 29.01.26 ПРД.5
	    
	    //++АшаеваАН 29.01.26 ПРД.11
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТранспортныйТариф", "Объект.cbr_ТранспортныйТариф", ,
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаСпособДоставкиПеревозчик, Форма.Элементы.СтраницыПеревозчик,
			"ПриИзменении");

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_СтоимостьДоставкиСНДС", "Объект.cbr_СтоимостьДоставкиСНДС", ,
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаСпособДоставкиПеревозчик, Форма.Элементы.СтраницыПеревозчик,
			"ПриИзменении");

		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_СтоимостьДоставкиБезНДС",
			"Объект.cbr_СтоимостьДоставкиБезНДС", , ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаСпособДоставкиПеревозчик, Форма.Элементы.СтраницыПеревозчик, "ПриИзменении");    
	    //--АшаеваАН 29.01.26 ПРД.11
	    
	    //++ AlopinAS 27.01.26 ПРД.22
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "Проект", "Объект.cbr_Проект", НСтр("ru='Проект'"),
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаШапкаЛево);
		cbr_РаботаСФормами.ДобавитьДействияЭлементаФормы(Форма.Элементы.Соглашение, "ПриИзменении");
		//-- AlopinAS 27.01.26 ПРД.22
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Страница_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "ПересечениеМенеджеров",
			"Пересечение менеджеров", Элементы.ГруппаСтраницы);

		Группа_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма, "ГруппаПересечениеМенеджеров", ,
			Страница_ПересечениеМенеджеров);

		Таблица_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма, "cbr_ТЧПересечениеМенеджеров",
			"Объект.cbr_ТЧПересечениеМенеджеров", Группа_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровНомерСтроки",
			"Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки", , ВидПоляФормы.ПолеВвода, Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо",
			"Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо", , ВидПоляФормы.ПолеВвода,
			Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровПроцент",
			"Объект.cbr_ТЧПересечениеМенеджеров.Процент", , ВидПоляФормы.ПолеВвода, Таблица_ПересечениеМенеджеров, ,
			"ПриИзменении");
		//-- БаженоваЕО 27.01.2026	
		
	//++ Тусеев Н.Ю. 27.01.2026 ПРД2
	ИначеЕсли ИмяФормы = "Справочник.Контрагенты.Форма.Форма" Тогда
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаКодFOBitrix", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.СтраницаОсновное, Форма.Элементы.ГруппаПартнерНаименование,
			Новый Структура("ОтображатьЗаголовок", Ложь));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодFO", "Код FO", "Объект.cbr_КодFO", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаКодFOBitrix);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодBitrix", "Код Bitrix", "Объект.cbr_КодBitrix",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаКодFOBitrix);

	ИначеЕсли ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлементаРеквизитыКонтрагента" Тогда
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаКодFOBitrix", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ГруппаОбщаяИнформация, Форма.Элементы.ГруппаЮрФизЛицоДанныеФизЛица,
			Новый Структура("ОтображатьЗаголовок", Ложь));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодFO", Новый ОписаниеТипов("Строка",
			Новый КвалификаторыСтроки(25)));

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодBitrix",
			Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));

		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодFO", "Код FO", "cbr_КодFO", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаКодFOBitrix);
		Форма.Элементы.cbr_КодFO.УстановитьДействие("ПриИзменении", "cbr_КодFOПриИзменении");

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодBitrix", "Код Bitrix", "cbr_КодBitrix",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаКодFOBitrix);
        Форма.Элементы.cbr_КодBitrix.УстановитьДействие("ПриИзменении", "cbr_КодBitrixПриИзменении");
        
		Контрагент = НайтиСсылкуПоРеквизиту("Справочники", "Контрагенты", "Партнер", Форма.Объект.Ссылка);
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "cbr_КодFO, cbr_КодBitrix");
			ЗаполнитьЗначенияСвойств(Форма, ДанныеКонтрагента);
		КонецЕсли;
	//-- Тусеев Н.Ю. 27.01.2026 ПРД2	
	
	//++ cba AlopinAS 27.01.26
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "ОтрасльКонтрагента", "Объект.cbr_ОтрасльКонтрагента", НСтр(
			"ru='Отрасль контрагента'"), ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаАтрибутыНаименования);

		cbr_РаботаСФормами.ДобавитьДействияЭлементаФормы(Форма.Элементы.ОтрасльКонтрагента, "НачалоВыбора"); 
	//-- cba AlopinAS 27.01.26	
	//++АшаеваАН 29.01.26 ПРД.5		
	ИначеЕсли ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
		СоздатьЭлементыСпециальныхТребований(Форма);
	//--АшаеваАН 29.01.26 ПРД.5
	
	//++ AlopinAS 27.01.26 ПРД.22	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "Проект", "Объект.cbr_Проект", НСтр("ru='Проект'"),
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаШапкаЛево);
	//-- AlopinAS 27.01.26 ПРД.22
	ИначеЕсли ИмяФормы = "Справочник.Партнеры.Форма.ПомощникНового" Тогда

		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаКодFOBitrix", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.СтраницаПервичнаяИнформация, , Новый Структура("ОтображатьЗаголовок", Ложь));

		ДобавляемыеРеквизиты = Новый Массив;
		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодFO", Новый ОписаниеТипов("Строка",
			Новый КвалификаторыСтроки(25)));

		ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, "cbr_КодBitrix",
			Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));

		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодFO", "Код FO", "cbr_КодFO", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаКодFOBitrix);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КодBitrix", "Код Bitrix", "cbr_КодBitrix",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаКодFOBitrix);
	ИначеЕсли ИмяФормы = "Справочник.СпособыОбеспеченияПотребностей.Форма.ФормаЭлемента" Тогда 
		//++ ШмелевР 27.01.2026 ЗКП.1
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ПроцентКЗакупке", "Объект.cbr_ПроцентКЗакупке", НСтр(
			"ru='Процент к закупке'"), ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаКолонкиОбеспечиваемыйПериод);
		
		//-- ШмелевР 27.01.2026 ЗКП.1	
	ИначеЕсли ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		//++ cba AlopinAS 27.01.26 ЗКП.4
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "ЭтоТендер", "Объект.cbr_ЭтоТендер", НСтр("ru='Тендер'"),
			ВидПоляФормы.ПолеФлажка, Форма.Элементы.ГруппаДополнительныеРеквизиты);	
		//-- cba AlopinAS 27.01.26 ЗКП.4
		
		//++ ШмелевР  06.02.2026 ЗКП.1
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "ОптимальнаяПартияЗаказа", "Объект.cbr_ОптимальнаяПартияЗаказа", НСтр("ru='Оптимальная партия заказа'"),
			ВидПоляФормы.ПолеВвода, Форма.Элементы.СворачиваемаяГруппаОбеспечение, Форма.Элементы.ГиперссылкаПерейтиВариантыКомплектации);
		//-- ШмелевР  06.02.2026 ЗКП.1

		//++ cbr-larkovgeorg 06.02.26 ПРЗ.24
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "Округление", "Объект.cbr_Округление", НСтр("ru='Округлять номенклатуру'"),
			ВидПоляФормы.ПолеФлажка, Форма.Элементы.ГруппаДополнительныеРеквизиты);
			
		Если НЕ УправлениеДоступом.ЕстьРоль("cbr_ОкруглятьНоменклатуру") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Округление", "Доступность", Ложь);
		КонецЕсли;	
		//-- cbr-larkovgeorg 06.02.26 ПРЗ.24
	ИначеЕсли ИмяФормы = "Документ.ЗаданиеНаПеревозку.Форма.ФормаДокумента" Тогда
		
		//++ СкребковЮМ 04.02.26 СКЛ.6 	
		ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаИнтеграцияAtrucks", , ВидГруппыФормы.ОбычнаяГруппа,
			Форма.Элементы.ГруппаОсновное, Форма.Элементы.ГруппаДополнительныеРеквизиты,
			Новый Структура("ОтображатьЗаголовок, Группировка", Ложь,
			ГруппировкаПодчиненныхЭлементовФормы.Вертикальная));

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерЗаявкиПоДаннымПеревозчика",
			"Номер заявки по данным перевозчика", "Объект.cbr_НомерЗаявкиПоДаннымПеревозчика", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.ГруппаИнтеграцияAtrucks);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерПеревозкиAtrucks", "Номер перевозки Atrucks",
			"Объект.cbr_НомерПеревозкиAtrucks", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаИнтеграцияAtrucks);

		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_ФактическаяСтоимостьПеревозки",
			"Фактическая стоимость перевозки (без НДС), руб.", "Объект.cbr_ФактическаяСтоимостьПеревозки",
			ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаИнтеграцияAtrucks);
		//-- СкребковЮМ 04.02.26 СКЛ.6
		
	ИначеЕсли ИмяФормы = "Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаЭлементаУпаковки" Тогда
		
		//++ cbr-larkovgeorg 10.02.26 СКЛ.12
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_СвойствоУпаковки", "Свойство упаковки",
			"Объект.cbr_СвойствоУпаковки", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаШапка, Элементы.ЕдиницаИзмерения);
		//-- cbr-larkovgeorg 10.02.26 СКЛ.12
		
	ИначеЕсли ИмяФормы = "Документ.УпаковочныйЛист.Форма.ФормаДокумента" Тогда
		
		//++ cbr-larkovgeorg 10.02.26 СКЛ.12
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_КоличествоПаллет", "Количество паллет",
			"Объект.cbr_КоличествоПаллет", ВидПоляФормы.ПолеВвода, Форма.Элементы.ГруппаПодвал);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "cbr_КоличествоПаллет", "Доступность", Ложь);
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_НомерПаллета", "Номер паллета", "Объект.Товары.cbr_НомерПаллета", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.Товары);
		Форма.Элементы.cbr_НомерПаллета.УстановитьДействие("ПриИзменении", "cbr_НомерПаллетаПриИзменении");
		
			
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_Уровень", "Уровень", "Объект.Товары.cbr_Уровень", ВидПоляФормы.ПолеВвода,
			Форма.Элементы.Товары);	
			
		ФормыУХ.СоздатьКоманду(Форма, "cbr_РасставитьПродукциюПоПаллетам", "Расставить продукцию по паллетам", "cbr_РасставитьПродукциюПоПаллетам");
		ФормыУХ.СоздатьКнопкуФормы(Форма.Элементы, "cbr_РасставитьПродукциюПоПаллетам", "Расставить продукцию по паллетам", 
									"cbr_РасставитьПродукциюПоПаллетам", , Форма.Элементы.ТоварыКоманднаяПанель, Форма.Элементы.ТоварыСортироватьПоВозрастанию);
									
		//ДополнитьУсловноеОформление(Форма, ИмяФормы, Элементы);
//		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
//		
//		ПолеОформления = Элемент.Поля.Элементы.Добавить();       
//        ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");
//        ПолеОформления.Использование = Истина;
//		
//		ГруппаЭлементовОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
//		ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
//        ГруппаЭлементовОтбора.Использование = Истина;
//		
//		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//        ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.cbr_НомерПаллета");  
//        ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;   
//        ЭлементОтбора.ПравоеЗначение = 0;   
//        ЭлементОтбора.Использование  = Истина;
//               
//        ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//        ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.cbr_Уровень");  
//        ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
//        ЭлементОтбора.ПравоеЗначение = 0;      
//        ЭлементОтбора.Использование  = Истина;
//
//		Элемент.УсловноеОформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);							
		//-- cbr-larkovgeorg 10.02.26 СКЛ.12

	КонецЕсли;
	
	ДополнитьУсловноеОформление(Форма, ИмяФормы, Элементы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьУсловноеОформление(Форма, ИмяФормы, Элементы)
	Если ИмяФормы = "Документ.УпаковочныйЛист.Форма.ФормаДокумента" Тогда
		//++ cbr-larkovgeorg 10.02.26 СКЛ.12
		
		Элемент = Форма.УсловноеОформление.Элементы.Добавить();
        ОформляемоеПоле     = Элемент.Поля.Элементы.Добавить();
        ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Товары");
    
        ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Упаковка.cbr_СвойствоУпаковки");
        ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
        ОтборЭлемента.ПравоеЗначение = Истина;
    
        Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);

		//-- cbr-larkovgeorg 10.02.26 СКЛ.12
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьЭлементыСпециальныхТребований(Форма)
	
		//++АшаеваАН 29.01.26 ПРД.5
	cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_СпециальныеТребования", "Специальные требования",
		Форма.Элементы.ГруппаСтраницы);

	cbr_РаботаСФормами.ДобавитьСтраницыФормы(Форма, "cbr_ГруппаСтраницы", , Форма.Элементы.cbr_СпециальныеТребования);

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_Логистические", "Логистические",
		Форма.Элементы.cbr_ГруппаСтраницы);

	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ДокументыДляВодителя",
		"Объект.cbr_ДокументыДляВодителя", , ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_Логистические);

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТаможенноеСопровождение",
		"Объект.cbr_ТаможенноеСопровождение", , ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_Логистические);

	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлемент.МногострочныйРежим = Истина;

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_УсловияДоставки", "Объект.cbr_УсловияДоставки", ,
		ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_Логистические);

	cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_ТребованияКУпаковкеИКомплектации",
		"Требования к упаковке и комплектации", Форма.Элементы.cbr_ГруппаСтраницы);

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТребованияКУпаковке",
		"Объект.cbr_ТребованияКУпаковке", , ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);
	НовыйЭлемент.МногострочныйРежим = Истина;

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТребованияКЭтикетке",
		"Объект.cbr_ТребованияКЭтикетке", , ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);
	НовыйЭлемент.МногострочныйРежим = Истина;

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТребованиеККомплектации",
		"Объект.cbr_ТребованиеККомплектации", , ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);
	НовыйЭлемент.МногострочныйРежим = Истина;

	cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_УсловияГСХПриПоставке", "Условия ГСХ при поставке",
		Форма.Элементы.cbr_ГруппаСтраницы);

	cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_НеБолееДатыПроизводства", "Объект.cbr_НеБолееДатыПроизводства", ,
		ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_УсловияГСХПриПоставке);

	cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ДопустимыйОстатокГСХНеМенееПроцент",
		"Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент", , ВидПоляФормы.ПолеВвода,
		Форма.Элементы.cbr_УсловияГСХПриПоставке);

	cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ДопустимыйОстатокГСХНеМенееМес",
		"Объект.cbr_ДопустимыйОстатокГСХНеМенееМес", , ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_УсловияГСХПриПоставке);

	cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_СтраницаПрочиеТребования", "Прочие требования",
		Форма.Элементы.cbr_ГруппаСтраницы);

	НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ПрочиеТребования", "Объект.cbr_ПрочиеТребования", ,
		ВидПоляФормы.ПолеВвода, Форма.Элементы.cbr_СтраницаПрочиеТребования);
	НовыйЭлемент.МногострочныйРежим = Истина;	
		 //--АшаеваАН 29.01.26 ПРД.5

	//++ Тусеев Н.Ю. 04.02.2026 ПРД12 
		Если Форма.ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда
			ТЧ = Метаданные.Справочники.СоглашенияСКлиентами.ТабличныеЧасти.cbr_АгентскиеВознаграждения;
			РодительАгентскоеВознагрождение = Форма.Элементы.ГруппаШапкаПраво;
		ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
			ТЧ = Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.cbr_АгентскиеВознаграждения;
			РодительАгентскоеВознагрождение = Форма.Элементы.ГруппаОсновное;
			ПоложениеПеред = Форма.Элементы.ГруппаЭтапыОплатыРасчеты;
		КонецЕсли;
		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "cbr_АгентскоеВознаграждение", "Агентское вознаграждение", 
		"Объект.cbr_АгентскоеВознаграждение", ВидПоляФормы.ПолеФлажка, РодительАгентскоеВознагрождение, 
		ПоложениеПеред, Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево)); 		
		ВыводАгентскогоСоглашения(Форма, ТЧ);		
	//-- Тусеев Н.Ю. 04.02.2026 ПРД12

КонецПроцедуры

//++ Тусеев Н.Ю. 27.01.2026 ПРД2
Функция НайтиСсылкуПоРеквизиту(ТипМетаданных, ОбъектМетаданныхИмя, ИмяРеквизита, ЗначениеРеквизита)

	ТипОбъектаМетаданных = Метаданные[ТипМетаданных];
	ОбъектМетаданных =  ТипОбъектаМетаданных[ОбъектМетаданныхИмя];
	Запрос = Новый Запрос;
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Ссылка ИЗ %1 ГДЕ %2 = &П", ОбъектМетаданных.ПолноеИмя(),
		ИмяРеквизита);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("П", ЗначениеРеквизита);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка[0];
	КонецЕсли;

КонецФункции //-- Тусеев Н.Ю. 27.01.2026 ПРД2

//++ Тусеев Н.Ю. 04.02.2026 ПРД12
Процедура ВыводАгентскогоСоглашения(Форма, ТЧ)
	
	Форма.Элементы.cbr_АгентскоеВознаграждение.УстановитьДействие("ПриИзменении", "cbr_АгентскоеВознаграждениеПриИзменении");
	
	ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "СтраницаАгентскоеВознаграждение", "Агентское вознаграждение", 
	ВидГруппыФормы.Страница, Форма.Элементы.ГруппаСтраницы,, Новый Структура("Видимость", Форма.Объект.cbr_АгентскоеВознаграждение));
	
	ФормыУХ.СоздатьТаблицуФормы(Форма.Элементы, "cbr_АгентскиеВознаграждения", 
	"Агентские вознаграждения", "Объект.cbr_АгентскиеВознаграждения", Форма.Элементы.СтраницаАгентскоеВознаграждение); 
	
	Для Каждого ЭлемТч Из ТЧ.Реквизиты Цикл		
		ФормыУХ.СоздатьПолеФормы(Форма.Элементы, ЭлемТч.Имя, ЭлемТч.Синоним,
		"Объект.cbr_АгентскиеВознаграждения." + ЭлемТч.Имя, ВидПоляФормы.ПолеВвода, 
		Форма.Элементы.cbr_АгентскиеВознаграждения); 		
	КонецЦикла; 
		
КонецПроцедуры //-- Тусеев Н.Ю. 04.02.2026 ПРД12

#КонецОбласти