Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Элементы = Форма.Элементы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);	
	ИначеЕсли ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда 
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Объект = Форма.Объект;
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ПересечениеМенеджеров", "Объект.cbr_ПересечениеМенеджеров", 
		"Пересечение менеджеров", ВидПоляФормы.ПолеФлажка, Элементы.ГруппаОсновное, Элементы.ГруппаЭтапыОплатыРасчеты, 
		"ПриИзменении");			
		
		Страница_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "ПересечениеМенеджеров",
		"Пересечение менеджеров", Элементы.ГруппаСтраницы);
		Страница_ПересечениеМенеджеров.Видимость = Объект.cbr_ПересечениеМенеджеров;
		
		Группа_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма, "ГруппаПересечениеМенеджеров",, 
		Страница_ПересечениеМенеджеров);
		
		Таблица_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма, "cbr_ТЧПересечениеМенеджеров", 
		"Объект.cbr_ТЧПересечениеМенеджеров", Группа_ПересечениеМенеджеров);		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровНомерСтроки", 
		"Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо", 
		"Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровПроцент", 
		"Объект.cbr_ТЧПересечениеМенеджеров.Процент",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		
		Если ЗначениеЗаполнено(Объект.Менеджер) Тогда
			Объект.cbr_ТЧПересечениеМенеджеров.Очистить();
			НоваяСтрока = Объект.cbr_ТЧПересечениеМенеджеров.Добавить();
			НоваяСтрока.ФизическоеЛицо = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Менеджер,"ФизическоеЛицо");
			НоваяСтрока.Процент = 100;			
		КонецЕсли;
		//-- БаженоваЕО 27.01.2026
		
		//++АшаеваАН 29.01.26 ПРД.5
			СоздатьЭлементыСпециальныхТребований(Форма);
	    //--АшаеваАН 29.01.26 ПРД.5
	    
	    //++АшаеваАН 29.01.26 ПРД.11
	    	cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
			 "cbr_ТранспортныйТариф",
			 "Объект.cbr_ТранспортныйТариф",,
			 ВидПоляФормы.ПолеВвода,
			 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
			 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
			 
			cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
			 "cbr_СтоимостьДоставкиСНДС",
			 "Объект.cbr_СтоимостьДоставкиСНДС",,
			 ВидПоляФормы.ПолеВвода,
			 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
			 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
			 
			cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
			 "cbr_СтоимостьДоставкиБезНДС",
			 "Объект.cbr_СтоимостьДоставкиБезНДС",,
			 ВидПоляФормы.ПолеВвода,
			 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
			 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");    
	    //--АшаеваАН 29.01.26 ПРД.11
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		//++ БаженоваЕО 27.01.2026 ПРД.18
		Страница_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "ПересечениеМенеджеров",
		"Пересечение менеджеров", Элементы.ГруппаСтраницы);
		
		Группа_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьГруппуФормы(Форма, "ГруппаПересечениеМенеджеров",, 
		Страница_ПересечениеМенеджеров);
		
		Таблица_ПересечениеМенеджеров = cbr_РаботаСФормами.ДобавитьТаблицуФормы(Форма, "cbr_ТЧПересечениеМенеджеров", 
		"Объект.cbr_ТЧПересечениеМенеджеров", Группа_ПересечениеМенеджеров);		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровНомерСтроки", 
		"Объект.cbr_ТЧПересечениеМенеджеров.НомерСтроки",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровФизическоеЛицо", 
		"Объект.cbr_ТЧПересечениеМенеджеров.ФизическоеЛицо",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма, "cbr_ТЧПересечениеМенеджеровПроцент", 
		"Объект.cbr_ТЧПересечениеМенеджеров.Процент",, ВидПоляФормы.ПолеВвода,Таблица_ПересечениеМенеджеров);
		//-- БаженоваЕО 27.01.2026	
	КонецЕсли;
	
		
	Если ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда 
		
		//++АшаеваАН 29.01.26 ПРД.5
			СоздатьЭлементыСпециальныхТребований(Форма);
	    //--АшаеваАН 29.01.26 ПРД.5
				
	КонецЕсли;
		
КонецПроцедуры

Процедура СоздатьЭлементыСпециальныхТребований(Форма)
	
		//++АшаеваАН 29.01.26 ПРД.5
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_СпециальныеТребования", "Специальные требования", 
		Форма.Элементы.ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьСтраницыФормы(Форма, "cbr_ГруппаСтраницы",, Форма.Элементы.cbr_СпециальныеТребования);
		
		НовыйЭлемент = cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_Логистические", "Логистические", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		
		НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДокументыДляВодителя",
		 "Объект.cbr_ДокументыДляВодителя",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		 		
		НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТаможенноеСопровождение",
		 "Объект.cbr_ТаможенноеСопровождение",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		 
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		НовыйЭлемент.МногострочныйРежим = Истина;
		 
		 НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_УсловияДоставки",
		 "Объект.cbr_УсловияДоставки",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		 	
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_ТребованияКУпаковкеИКомплектации", "Требования к упаковке и комплектации", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованияКУпаковке",
		 "Объект.cbr_ТребованияКУпаковке",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);
		 НовыйЭлемент.МногострочныйРежим = Истина;
		 	
		НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованияКЭтикетке",
		 "Объект.cbr_ТребованияКЭтикетке",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);
		 НовыйЭлемент.МногострочныйРежим = Истина;
		 
		 НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованиеККомплектации",
		 "Объект.cbr_ТребованиеККомплектации",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);
		 НовыйЭлемент.МногострочныйРежим = Истина;	
		 
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_УсловияГСХПриПоставке", "Условия ГСХ при поставке", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_НеБолееДатыПроизводства",
		 "Объект.cbr_НеБолееДатыПроизводства",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДопустимыйОстатокГСХНеМенееПроцент",
		 "Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		 
		 cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДопустимыйОстатокГСХНеМенееМес",
		 "Объект.cbr_ДопустимыйОстатокГСХНеМенееМес",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		 
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_СтраницаПрочиеТребования", "Прочие требования", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ПрочиеТребования",
		 "Объект.cbr_ПрочиеТребования",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_СтраницаПрочиеТребования);	
		 НовыйЭлемент.МногострочныйРежим = Истина;	
		 //--АшаеваАН 29.01.26 ПРД.5
	
КонецПроцедуры
