Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);		
	КонецЕсли;
	
	Если ИмяФормы = "Справочник.СоглашенияСКлиентами.Форма.ФормаЭлемента" Тогда 
		
		//++АшаеваАН 29.01.26 ПРД.5
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_СпециальныеТребования", "Специальные требования", 
		Форма.Элементы.ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьСтраницыФормы(Форма, "cbr_ГруппаСтраницы",, Форма.Элементы.cbr_СпециальныеТребования);
		
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_Логистические", "Логистические", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДокументыДляВодителя",
		 "Объект.cbr_ДокументыДляВодителя",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		
		НовыйЭлемент = cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТаможенноеСопровождение",
		 "Объект.cbr_ТаможенноеСопровождение",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		 
		НовыйЭлемент.АвтоМаксимальнаяВысота = Истина;
		 
		 cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_УсловияДоставки",
		 "Объект.cbr_УсловияДоставки",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_ТребованияКУпаковкеИКомплектации", "Требования к упаковке и комплектации", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованияКУпаковке",
		 "Объект.cbr_ТребованияКУпаковке",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованияКЭтикетке",
		 "Объект.cbr_ТребованияКЭтикетке",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);	
		 cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованиеККомплектации",
		 "Объект.cbr_ТребованиеККомплектации",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);	
		 
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_УсловияГСХПриПоставке", "Условия ГСХ при поставке", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_НеБолееДатыПроизводства",
		 "Объект.cbr_НеБолееДатыПроизводства",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДопустимыйОстатокГСХНеМенееПроцент",
		 "Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		 cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДопустимыйОстатокГСХНеМенееМес",
		 "Объект.cbr_ДопустимыйОстатокГСХНеМенееМес",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		 
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_ПрочиеТребования", "Прочие требования", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ПрочиеТребования",
		 "Объект.cbr_ПрочиеТребования",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ПрочиеТребования);	
		 //--АшаеваАН 29.01.26 ПРД.5
				
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда 
		
		//++АшаеваАН 29.01.26 ПРД.5
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_СпециальныеТребования", "Специальные требования", 
		Форма.Элементы.ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьСтраницыФормы(Форма, "cbr_ГруппаСтраницы",, Форма.Элементы.cbr_СпециальныеТребования);
		
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_Логистические", "Логистические", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДокументыДляВодителя",
		 "Объект.cbr_ДокументыДляВодителя",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТаможенноеСопровождение",
		 "Объект.cbr_ТаможенноеСопровождение",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		 cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_УсловияДоставки",
		 "Объект.cbr_УсловияДоставки",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_Логистические);	
		
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_ТребованияКУпаковкеИКомплектации", "Требования к упаковке и комплектации", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованияКУпаковке",
		 "Объект.cbr_ТребованияКУпаковке",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованияКЭтикетке",
		 "Объект.cbr_ТребованияКЭтикетке",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);	
		 cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТребованиеККомплектации",
		 "Объект.cbr_ТребованиеККомплектации",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ТребованияКУпаковкеИКомплектации);	
		 
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_УсловияГСХПриПоставке", "Условия ГСХ при поставке", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_НеБолееДатыПроизводства",
		 "Объект.cbr_НеБолееДатыПроизводства",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДопустимыйОстатокГСХНеМенееПроцент",
		 "Объект.cbr_ДопустимыйОстатокГСХНеМенееПроцент",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		 cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ДопустимыйОстатокГСХНеМенееМес",
		 "Объект.cbr_ДопустимыйОстатокГСХНеМенееМес",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_УсловияГСХПриПоставке);	
		 
		cbr_РаботаСФормами.ДобавитьСтраницуФормы(Форма, "cbr_ПрочиеТребования", "Прочие требования", 
		Форма.Элементы.cbr_ГруппаСтраницы);
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ПрочиеТребования",
		 "Объект.cbr_ПрочиеТребования",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.cbr_ПрочиеТребования);	
		//--АшаеваАН 29.01.26 ПРД.5
				
	КонецЕсли;
		
КонецПроцедуры