Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	
	
	Если ИмяФормы = "Обработка.ОбеспечениеПотребностей.Форма.Форма" Тогда 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "НеПоддерживаетсяОстаток",
		 "Объект.ЗаказыКОбеспечению.cbr_НеПоддерживаетсяОстаток",
		 НСтр("ru='Не поддерживается остаток'"),
		 ВидПоляФормы.ПолеФлажка,
		 Форма.Элементы.ЗаказыКОбеспечению,
		 Форма.Элементы.СпособОбеспеченияЗаказы);
	//++ Тусеев Н.Ю. 27.01.2026 ПРД7
	ИначеЕсли ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда	 
		 ФормыУХ.СоздатьГруппуФормы(Форма.Элементы, "ГруппаОбщийВес", "Общий вес", 
		 ВидГруппыФормы.ОбычнаяГруппа, Форма.Элементы.ГруппаИтого,, Новый Структура("ОтображатьЗаголовок", Ложь));
		 
		 ДобавляемыеРеквизиты = Новый Массив;	
		 ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, 
		 "ОбщийВесДокумента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3))); 
		 
		 ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, 
		 "Вес", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");
		 
		 ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, 
		 "Объем", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");
		 
		 ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, 
		 "ЕдиницаИзмеренияВеса", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Объект.Товары");
		 
		 ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, 
		 "ЕдиницаИзмеренияОбъема", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Объект.Товары");
		 
		 ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, 
		 "ВесУпаковки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");
		 
		 ФормыУХ.СоздатьДобавитьРеквизитФормы(Форма, ДобавляемыеРеквизиты, 
		 "ОбъемУпаковки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)), "Объект.Товары");
		 
		 Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		 
		 ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ОбщийВесДокумента", 
		 "Общий вес по документу, кг", "ОбщийВесДокумента", ВидПоляФормы.ПолеВвода, 
		 Форма.Элементы.ГруппаОбщийВес, , Новый Структура("ТолькоПросмотр", Истина));
		 
		 ПараметрыЭлемента = Новый Структура("Видимость", Ложь);	
		 ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыВес", "Вес", 
		 "Объект.Товары.Вес", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,,ПараметрыЭлемента);
		 
		 ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЕдиницаИзмеренияВеса", "Единица измерения веса", 
		 "Объект.Товары.ЕдиницаИзмеренияВеса", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,,ПараметрыЭлемента);
		 
		 ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыОбъем", "Объем", 
		 "Объект.Товары.Объем", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,,ПараметрыЭлемента);
		 
		 ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыЕдиницаИзмеренияОбъема", "Единица измерения объема", 
		 "Объект.Товары.ЕдиницаИзмеренияОбъема", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,,ПараметрыЭлемента);
		 
		 ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыВесУпаковки", "Вес упаковки", 
		 "Объект.Товары.ВесУпаковки", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,,ПараметрыЭлемента);
		 
		 ФормыУХ.СоздатьПолеФормы(Форма.Элементы, "ТоварыОбъемУпаковки", "Объем упаковки", 
		 "Объект.Товары.ОбъемУпаковки", ВидПоляФормы.ПолеВвода, Форма.Элементы.Товары,,ПараметрыЭлемента);
		 
		 СтруктураДействий = Новый Структура();
		 СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
		 СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
		 СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
		 СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
		 СтруктураДействий.Вставить("ПересчитатьВесОбъем");
		 Для Каждого Стр Из Форма.Объект.Товары Цикл
			 ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Стр, СтруктураДействий, Неопределено);
			 Форма.ОбщийВесДокумента = Форма.ОбщийВесДокумента + Стр.Вес * Стр.ВесУпаковки;
		 КонецЦикла;
	//-- Тусеев Н.Ю. 27.01.2026 ПРД7 		
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда 
		
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_ТранспортныйТариф",
		 "Объект.cbr_ТранспортныйТариф",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
		 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
		 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_СтоимостьДоставкиСНДС",
		 "Объект.cbr_СтоимостьДоставкиСНДС",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
		 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
		 
		cbr_РаботаСФормами.ДобавитьПолеФормы(Форма,
		 "cbr_СтоимостьДоставкиБезНДС",
		 "Объект.cbr_СтоимостьДоставкиБезНДС",,
		 ВидПоляФормы.ПолеВвода,
		 Форма.Элементы.ГруппаСпособДоставкиПеревозчик,
		 Форма.Элементы.СтраницыПеревозчик,"ПриИзменении");
		 		
	КонецЕсли;
		
КонецПроцедуры
