#Область ОбработчикиСобытийФормы

&НаСервере
Процедура cbr_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	//++ БаженоваЕО 10.03.2026 ПРД.21
	Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Список.ТекстЗапроса =
		"ВЫБРАТЬ
		|	СправочникСоглашенияСКлиентами.Ссылка КАК Ссылка,
		|	СправочникСоглашенияСКлиентами.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникСоглашенияСКлиентами.Номер КАК Номер,
		|	СправочникСоглашенияСКлиентами.Дата КАК Дата,
		|	СправочникСоглашенияСКлиентами.Валюта КАК Валюта,
		|	СправочникСоглашенияСКлиентами.ГрафикОплаты КАК ГрафикОплаты,
		|	СправочникСоглашенияСКлиентами.СуммаДокумента КАК СуммаДокумента,
		|	СправочникСоглашенияСКлиентами.Типовое КАК Типовое,
		|	СправочникСоглашенияСКлиентами.ВидЦен КАК ВидЦен,
		|	СправочникСоглашенияСКлиентами.Статус КАК Статус,
		|	СправочникСоглашенияСКлиентами.Регулярное КАК Регулярное,
		|	СправочникСоглашенияСКлиентами.СегментНоменклатуры КАК СегментНоменклатуры,
		|	СправочникСоглашенияСКлиентами.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	СправочникСоглашенияСКлиентами.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	СправочникСоглашенияСКлиентами.Менеджер КАК Менеджер,
		|	СправочникСоглашенияСКлиентами.Наименование КАК Наименование,
		|	СправочникСоглашенияСКлиентами.Комментарий КАК Комментарий,
		|	СправочникСоглашенияСКлиентами.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СправочникСоглашенияСКлиентами.Организация КАК Организация,
		|	СправочникСоглашенияСКлиентами.Контрагент КАК Контрагент,
		|	ВЫРАЗИТЬ(&Партнер КАК Справочник.Партнеры) КАК ПартнерОтбор,
		|	ВЫБОР
		|		КОГДА СправочникСоглашенияСКлиентами.Типовое
		|			ТОГДА &Типовое
		|		ИНАЧЕ &Индивидуальное
		|	КОНЕЦ КАК ТипСоглашения,
		|	ВЫБОР
		|		КОГДА СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.НеСогласовано)
		|			ТОГДА &НеСогласовано
		|		КОГДА СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|			ТОГДА &Действует
		|		КОГДА СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Закрыто)
		|			ТОГДА &Закрыто
		|	КОНЕЦ КАК Состояние,
		|	ВЫБОР
		|		КОГДА СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.НеСогласовано)
		|		И (СправочникСоглашенияСКлиентами.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|		И СправочникСоглашенияСКлиентами.ДатаНачалаДействия < &ДатаДокумента
		|		ИЛИ СправочникСоглашенияСКлиентами.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|		И СправочникСоглашенияСКлиентами.ДатаОкончанияДействия < &ДатаДокумента)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СогласованиеПросрочено,
		|	ВЫБОР
		|		КОГДА СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|		И (СправочникСоглашенияСКлиентами.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|		И СправочникСоглашенияСКлиентами.ДатаОкончанияДействия < &ДатаДокумента)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СрокДействияИстек,
		|	ВЫБОР
		|		КОГДА СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|		И (СправочникСоглашенияСКлиентами.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|		И СправочникСоглашенияСКлиентами.ДатаНачалаДействия > &ДатаДокумента)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СрокДействияНеНаступил,
		|	ВЫБОР
		|		КОГДА СправочникСоглашенияСКлиентами.Типовое
		|		И СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|			ТОГДА 0
		|		КОГДА НЕ СправочникСоглашенияСКлиентами.Типовое
		|		И СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|			ТОГДА 3
		|	КОНЕЦ КАК КартинкаСостояния,
		|	СправочникСоглашенияСКлиентами.ДоступноВнешнимПользователям КАК ДоступноВнешнимПользователям,
		|	СправочникСоглашенияСКлиентами.СегментПартнеров КАК СегментПартнеров,
		|	СправочникСоглашенияСКлиентами.ИспользуютсяДоговорыКонтрагентов КАК ИспользуютсяДоговорыКонтрагентов,
		|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СправочникСоглашенияСКлиентами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
		|		ПО РегистрСостоянийОбъектовСрезПоследних.Объект = СправочникСоглашенияСКлиентами.Ссылка
		|ГДЕ
		|	(&РазрешитьВыборНедействующих
		|	ИЛИ СправочникСоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует))
		|	И НЕ СправочникСоглашенияСКлиентами.ПометкаУдаления
		|	И ВЫБОР
		|		КОГДА &ТолькоТиповые = ИСТИНА
		|		И &ТолькоИндивидуальные = ЛОЖЬ
		|		И (СправочникСоглашенияСКлиентами.Типовое
		|		И (СправочникСоглашенияСКлиентами.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|		ИЛИ СправочникСоглашенияСКлиентами.СегментПартнеров В
		|			(ВЫБРАТЬ
		|				ПартнерыСегмента.Сегмент
		|			ИЗ
		|				РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|			ГДЕ
		|				ПартнерыСегмента.Партнер = &Партнер)))
		|			ТОГДА ИСТИНА
		|		КОГДА &ТолькоИндивидуальные = ИСТИНА
		|		И НЕ &ТолькоТиповые = ИСТИНА
		|		И (НЕ СправочникСоглашенияСКлиентами.Типовое
		|		И (СправочникСоглашенияСКлиентами.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|		ИЛИ СправочникСоглашенияСКлиентами.СегментПартнеров В
		|			(ВЫБРАТЬ
		|				ПартнерыСегмента.Сегмент
		|			ИЗ
		|				РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|			ГДЕ
		|				ПартнерыСегмента.Партнер = &Партнер)))
		|		И (&Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|		ИЛИ СправочникСоглашенияСКлиентами.Партнер = &Партнер)
		|			ТОГДА ИСТИНА
		|		КОГДА &ТолькоТиповые = ЛОЖЬ
		|		И &ТолькоИндивидуальные = ЛОЖЬ
		|		И (СправочникСоглашенияСКлиентами.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|		ИЛИ СправочникСоглашенияСКлиентами.СегментПартнеров В
		|			(ВЫБРАТЬ
		|				ПартнерыСегмента.Сегмент
		|			ИЗ
		|				РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|			ГДЕ
		|				ПартнерыСегмента.Партнер = &Партнер)
		|		ИЛИ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))
		|		И (&Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|		ИЛИ СправочникСоглашенияСКлиентами.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|		ИЛИ СправочникСоглашенияСКлиентами.Партнер = &Партнер)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ТолькоИспользуемыеВРаботеТП = ИСТИНА
		|		И СправочникСоглашенияСКлиентами.ИспользуетсяВРаботеТорговыхПредставителей
		|			ТОГДА ИСТИНА
		|		КОГДА &ТолькоИспользуемыеВРаботеТП = ЛОЖЬ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";

		Список.ДинамическоеСчитываниеДанных = Истина;
		ЭлементСостояниеОбъекта = Элементы.Вставить("СостояниеОбъекта", Тип("ПолеФормы"), Элементы.Список);
		ЭлементСостояниеОбъекта.Заголовок = "Состояние объекта";
		ЭлементСостояниеОбъекта.ПутьКДанным = "Список.СостояниеОбъекта";
		ЭлементСостояниеОбъекта.Видимость = Ложь;

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "СостояниеОбъекта", Перечисления.СостоянияСогласования.Утверждена,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;	
	//-- БаженоваЕО 10.03.2026

КонецПроцедуры

#КонецОбласти