#Область СлужебныеПроцедурыИФункции
&ИзменениеИКонтроль("СинхронизироватьУпаковочныеЛистыСРасходнымОрдером")
Функция cbr_СинхронизироватьУпаковочныеЛистыСРасходнымОрдером(ОрдерСсылка, ИспользоватьАдресноеХранение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТовары.УпаковочныйЛист КАК УпаковочныйЛист
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.ЭтоУпаковочныйЛист
	|	И ТаблицаТовары.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Упаковка,
	|	1 КАК Количество,
	|	1 КАК КоличествоУпаковок,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ТаблицаТовары.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
	|	ТаблицаТовары.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ТаблицаТовары.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.ЭтоУпаковочныйЛист
	|	И ТаблицаТовары.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Упаковка,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.КоличествоУпаковок,
	|	ТаблицаТовары.Серия,
	|	ТаблицаТовары.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
	|	ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка),
	|	ТаблицаТовары.УпаковочныйЛистРодитель
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.ЭтоУпаковочныйЛист
	|	И ТаблицаТовары.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСоСтрокамиОрдеровНаОтгрузку.НеОтгружать)
	|";

	РеквизитыОрдера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОрдерСсылка, "Статус, Склад");

	Запрос.УстановитьПараметр("Ссылка",ОрдерСсылка);
	Запрос.УстановитьПараметр("Статус",РеквизитыОрдера.Статус);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	УпаковочныеЛисты = МассивРезультатов[0].Выгрузить().ВыгрузитьКолонку("УпаковочныйЛист");
	Результат = МассивРезультатов[1]; // РезультатЗапроса
	Товары = Результат.Выгрузить();
	Товары.Колонки.Добавить("УпаковочныйЛистВерхнегоУровня", Новый ОписаниеТипов("ДокументСсылка.УпаковочныйЛист"));

	ТоварыДляПроверкиИзменений = Товары.СкопироватьКолонки();

	Для Каждого УпаковочныйЛист Из УпаковочныеЛисты Цикл
		СтрокиУпаковочногоЛиста = Новый Массив;
		РекурсивноОбойтиПодчиненныеСтроки(Товары, УпаковочныйЛист, , СтрокиУпаковочногоЛиста);
		ТоварыПоУпаковочномуЛисту = Товары.Скопировать(СтрокиУпаковочногоЛиста);
		ТоварыПоУпаковочномуЛисту.ЗаполнитьЗначения(УпаковочныйЛист, "УпаковочныйЛистВерхнегоУровня");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТоварыПоУпаковочномуЛисту, ТоварыДляПроверкиИзменений);
	КонецЦикла;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.УпаковочныйЛистВерхнегоУровня КАК Ссылка,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Упаковка,
	|	Товары.Количество,
	|	Товары.УпаковочныйЛист,
	|	ВЫБОР
	|		КОГДА Товары.УпаковочныйЛистРодитель = Товары.УпаковочныйЛистВерхнегоУровня
	|			ТОГДА ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|		ИНАЧЕ Товары.УпаковочныйЛистРодитель
	|	КОНЕЦ КАК УпаковочныйЛистРодитель
	|ПОМЕСТИТЬ ТоварыДляПроверкиИзменений
	|ИЗ
	|	&ТоварыДляПроверкиИзменений КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Ссылка
	|ПОМЕСТИТЬ ПерезаполнитьТЧ
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Ссылка КАК Ссылка,
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.Характеристика КАК Характеристика,
	|		Товары.Серия КАК Серия,
	|		Товары.Упаковка КАК Упаковка,
	|		Товары.Количество КАК Количество,
	|		Товары.УпаковочныйЛист КАК УпаковочныйЛист,
	|		Товары.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель
	|	ИЗ
	|		Документ.УпаковочныйЛист.Товары КАК Товары
	|	ГДЕ
	|		Товары.Ссылка В(&УпаковочныеЛисты)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Товары.Ссылка,
	|		Товары.Номенклатура,
	|		Товары.Характеристика,
	|		Товары.Серия,
	|		Товары.Упаковка,
	|		-Товары.Количество,
	|		Товары.УпаковочныйЛист,
	|		Товары.УпаковочныйЛистРодитель
	|	ИЗ
	|		ТоварыДляПроверкиИзменений КАК Товары) КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.УпаковочныйЛистРодитель,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Упаковка,
	|	Товары.УпаковочныйЛист
	|
	|ИМЕЮЩИЕ
	|	СУММА(Товары.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПерезаполнитьТЧ.Ссылка
	|ИЗ
	|	ПерезаполнитьТЧ КАК ПерезаполнитьТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПерезаполнитьОснование.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УпаковочныйЛист КАК ПерезаполнитьОснование
	|ГДЕ
	|	ПерезаполнитьОснование.Ссылка В(&УпаковочныеЛисты)
	|	И ПерезаполнитьОснование.Основание <> &Основание
	|	И НЕ ПерезаполнитьОснование.Ссылка В
	|				(ВЫБРАТЬ
	|					ПерезаполнитьТЧ.Ссылка
	|				ИЗ
	|					ПерезаполнитьТЧ)";

	Основание = ОснованиеУпаковочногоЛистаПоОрдеру(ОрдерСсылка);

	Запрос.УстановитьПараметр("УпаковочныеЛисты",УпаковочныеЛисты);
	Запрос.УстановитьПараметр("ТоварыДляПроверкиИзменений", ТоварыДляПроверкиИзменений);
	Запрос.УстановитьПараметр("Основание", Основание);

	Результат = Запрос.ВыполнитьПакет();

	Выборка = Результат[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Заблокировать();
		ДокОбъект.Основание = Основание;
		ДокОбъект.Записать();
	КонецЦикла;

	УпаковочныеЛисты = Результат[2].Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если Результат[2].Пустой() Тогда
		УпаковочныеЛисты = Новый Массив;
	КонецЕсли;
	#Вставка
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12 
	КонтрагентДляЛиста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрдерСсылка.ТоварыПоРаспоряжениям[0].Распоряжение, "Контрагент");
	//--cbr-larkovgeorg 26.02.2026 СКЛ.12 
	#КонецВставки
	
	Для Каждого Ссылка Из УпаковочныеЛисты Цикл

		ТоварыДляЗагрузки = ТоварыДляПроверкиИзменений.Скопировать(Новый Структура("УпаковочныйЛистВерхнегоУровня",Ссылка));
		Для Каждого Стр Из ТоварыДляЗагрузки Цикл
			Если Стр.УпаковочныйЛистРодитель = Ссылка Тогда
				Стр.УпаковочныйЛистРодитель = Документы.УпаковочныйЛист.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
		ДокОбъект = Ссылка.ПолучитьОбъект();
		ДокОбъект.Заблокировать();
		ДокОбъект.Упаковал = Пользователи.ТекущийПользователь();
		ДокОбъект.СкладУпаковки = РеквизитыОрдера.Склад;
		ДокОбъект.Основание = Основание;
		#Вставка
		//++cbr-larkovgeorg 26.02.2026 СКЛ.12
		Если ЗначениеЗаполнено(КонтрагентДляЛиста) Тогда  
			ДокОбъект.cbr_Контрагент = КонтрагентДляЛиста;
		КонецЕсли;
		//--cbr-larkovgeorg 26.02.2026 СКЛ.12 
		#КонецВставки
		ДокОбъект.Товары.Загрузить(ТоварыДляЗагрузки);
		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокОбъект, Документы.УпаковочныйЛист);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокОбъект, ПараметрыУказанияСерий);
		ДокОбъект.Записать();

	КонецЦикла;

	Возврат УпаковочныеЛисты;

КонецФункции
#КонецОбласти
