#Область СлужебныеПроцедурыИФункции
&После("ПриСозданииНаСервере")
Процедура cbr_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	cbr_ОбщегоНазначенияСобытияФормСервер.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка,
		ДополнительныеПараметры);
КонецПроцедуры

&После("ПослеЗаписиНаСервере")
Процедура cbr_ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры) Экспорт
	cbr_ОбщегоНазначенияСобытияФормСервер.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры);
КонецПроцедуры
#КонецОбласти