#Область СлужебныеПроцедурыИФункции

&После("УстановитьОтборЗаданияНаПеревозкуВРаботе")
&НаСервере
Процедура cbr_УстановитьОтборЗаданияНаПеревозкуВРаботе()
	
	//++ БаженоваЕО 05.02.2026 СКЛ.4	
	Если ЗначениеЗаполнено(Объект.cbr_ЗаданиеВыполняет) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданияНаПеревозкуВРаботе,
			"ЗаданиеВыполняет", Объект.cbr_ЗаданиеВыполняет, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли Не ЗначениеЗаполнено(Объект.cbr_ЗаданиеВыполняет) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданияНаПеревозкуВРаботе,
			"ЗаданиеВыполняет",,,,Ложь);
	КонецЕсли;
	//-- БаженоваЕО 05.02.2026
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//++ БаженоваЕО 05.02.2026 СКЛ.4
&НаКлиенте
Процедура cbr_ЗаданиеВыполняетПриИзменении(Элемент)
	
	УстановитьОтборЗаданияНаПеревозкуВРаботе();

КонецПроцедуры //-- БаженоваЕО 05.02.2026

#КонецОбласти