#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЦеныПоТоварамНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	
	ХарактеристикиИспользуются = ПроверитьИспользованиеХарактеристик(ТекущаяСтрока.Номенклатура);

	Если ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.ХарактеристикиИспользуются = ХарактеристикиИспользуются;
	КонецЕсли;
	
	ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	
	ЦеныПоТоварамНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамКоличествоПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамПрцентРучнаяСкидкаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамСуммаРучнаяСкидкаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамЦенаСоСкидкойПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамСуммаПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ЦеныПоТоварамНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки)
 	ТекущаяСтрокаТЧ = Объект.cbr_ЦеныПоТоварам.НайтиПоИдентификатору(ИдентификаторСтроки);
 	ТекущаяСтрокаТЧ.ВидЦены = Объект.ВидЦен;
 	ТекущаяСтрокаТЧ.Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрокаТЧ.Номенклатура, ТекущаяСтрокаТЧ.ВидЦены);
 	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦены)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(&Дата, Номенклатура = &Номенклатура
		|	И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить()[0].Цена;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьИспользованиеХарактеристик(Номенклатура)
	ХарактеристикиИспользуются = Справочники.Номенклатура.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(Номенклатура, );
	
	Возврат ХарактеристикиИспользуются;
КонецФункции

&После("УстановитьУсловноеОформление")
&НаСервере
Процедура cbr_УстановитьУсловноеОформление()
	ДополнитьУсловноеОформлениеЦеныПоТоварам();
КонецПроцедуры

&НаСервере
Процедура ДополнитьУсловноеОформлениеЦеныПоТоварам() 
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристикиИспользуются");
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость",  Ложь);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристика");
	
    ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются");
    ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ОтборЭлемента.ПравоеЗначение = Ложь; 
    
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Не используются>");
КонецПроцедуры

#КонецОбласти

