#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЦенуНоменклатуры(ИдентификаторСтроки)
	
	Результат = 0;
	ТекущаяСтрокаТЧ = Объект.cbr_ЦеныПоТоварам.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ОсновнаяЕдиницаИзмеренияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрокаТЧ.Номенклатура, "ЕдиницаИзмерения");
	
	Если ТекущаяСтрокаТЧ.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмеренияНоменклатуры Тогда
		ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	Иначе
		ЕдиницаИзмерения = ТекущаяСтрокаТЧ.ЕдиницаИзмерения;
	КонецЕсли;
	
	Характеристика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрокаТЧ.Характеристика, "ХарактеристикаНоменклатурыДляЦенообразования");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(&Дата, Номенклатура = &Номенклатура
		|	И ХарактеристикаЦО = &Характеристика
		|	И УпаковкаЦО = &Упаковка
		|	И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", ТекущаяСтрокаТЧ.ВидЦены);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Упаковка", ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрокаТЧ.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить()[0].Цена;
	КонецЕсли;
	
	ТекущаяСтрокаТЧ.Цена = Результат;
	
	Если ТекущаяСтрокаТЧ.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		ТекущаяСтрокаТЧ.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрокаТЧ.Номенклатура, "ЕдиницаИзмерения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьИспользованиеХарактеристик(Номенклатура)
	ХарактеристикиИспользуются = Справочники.Номенклатура.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(Номенклатура, );
	
	Возврат ХарактеристикиИспользуются;
КонецФункции

&После("УстановитьУсловноеОформление")
&НаСервере
Процедура cbr_УстановитьУсловноеОформление()
	ДополнитьУсловноеОформлениеЦеныПоТоварам();
КонецПроцедуры

&НаСервере
Процедура ДополнитьУсловноеОформлениеЦеныПоТоварам() 
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристикиИспользуются");
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость",  Ложь);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристика");
	
    ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются");
    ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ОтборЭлемента.ПравоеЗначение = Ложь; 
    
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Не используются>");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамСумма");
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамСуммаРучнаяСкидка");
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЦеныПоТоварам
&НаКлиенте
Процедура ЦеныПоТоварамНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ХарактеристикиИспользуются = ПроверитьИспользованиеХарактеристик(ТекущаяСтрока.Номенклатура);

	Если ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.ХарактеристикиИспользуются = ХарактеристикиИспользуются;
	КонецЕсли;
	
	ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	ЦеныПоТоварамНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки);
КонецПроцедуры

&НаСервере
Процедура ЦеныПоТоварамНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки)
	
 	ТекущаяСтрокаТЧ = Объект.cbr_ЦеныПоТоварам.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущаяСтрокаТЧ.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрокаТЧ.Номенклатура, "ЕдиницаИзмерения");
	ТекущаяСтрокаТЧ.ВидЦены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ВидЦен");
 	ЗаполнитьЦенуНоменклатуры(ИдентификаторСтроки);
 	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамХарактеристикаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	ЗаполнитьЦенуНоменклатуры(ИдентификаторСтроки)
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамЕдиницаИзмеренияПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	ЗаполнитьЦенуНоменклатуры(ИдентификаторСтроки)	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамВидЦеныПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();	
	ЗаполнитьЦенуНоменклатуры(ИдентификаторСтроки)
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ТекущаяСтрока.СуммаРучнаяСкидка = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * ТекущаяСтрока.ПрцентРучнаяСкидка / 100;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена - ТекущаяСтрока.СуммаРучнаяСкидка;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ТекущаяСтрока.ЦенаСоСкидкой = ТекущаяСтрока.Цена * (1 - (ТекущаяСтрока.ПрцентРучнаяСкидка / 100));
	ТекущаяСтрока.СуммаРучнаяСкидка = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * ТекущаяСтрока.ПрцентРучнаяСкидка / 100;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена - ТекущаяСтрока.СуммаРучнаяСкидка;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамПрцентРучнаяСкидкаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ТекущаяСтрока.ЦенаСоСкидкой = ТекущаяСтрока.Цена * (1 - (ТекущаяСтрока.ПрцентРучнаяСкидка / 100));
	ТекущаяСтрока.СуммаРучнаяСкидка = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * ТекущаяСтрока.ПрцентРучнаяСкидка / 100;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена - ТекущаяСтрока.СуммаРучнаяСкидка;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамЦенаСоСкидкойПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	ТекущаяСтрока.ПрцентРучнаяСкидка = ТекущаяСтрока.ЦенаСоСкидкой / ТекущаяСтрока.Цена * 100;
	ТекущаяСтрока.СуммаРучнаяСкидка = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена * ТекущаяСтрока.ПрцентРучнаяСкидка / 100;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена - ТекущаяСтрока.СуммаРучнаяСкидка;
КонецПроцедуры

#КонецОбласти