#Область ОбработчикиСобытийЭлементовШапкиФормы

//++ Тусеев Н.Ю. 04.02.2026 ПРД12
&НаКлиенте
Процедура cbr_АгентскоеВознаграждениеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
	"СтраницаАгентскоеВознаграждение", "Видимость", 
	Объект.cbr_АгентскоеВознаграждение);
	
КонецПроцедуры //++ Тусеев Н.Ю. 04.02.2026 ПРД12
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыcbr_АгентскиеВознаграждения
&НаКлиенте
Процедура cbr_АгентскоеВознаграждениеДоговорАгентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//++ cbr-larkovgeorg 12.02.2026 ПРД12
	
	ТекСтрока = Элементы.cbr_АгентскиеВознаграждения.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.Агент) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Отбор, АгентскоеВознаграждение", Новый Структура("Организация, Контрагент",
			Объект.Организация, ТекСтрока.Агент), Истина);
		ОповещениеЗакрытия = Новый ОписаниеОповещения("cbr_АгентскоеВознаграждениеДоговорАгентаНачалоВыбораЗавершение",
			ЭтотОбъект);
		ОткрытьФорму("Документ.ВерсияСоглашенияКоммерческийДоговор.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , ,
			, ОповещениеЗакрытия);
	КонецЕсли;
	
КонецПроцедуры //-- cbr-larkovgeorg 12.02.2026 ПРД12

&НаКлиенте
Процедура cbr_АгентскоеВознаграждениеДоговорАгентаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	//++ cbr-larkovgeorg 12.02.2026 ПРД12
	Если ЗначениеЗаполнено(Результат) Тогда 
	
		ТекСтрока = Элементы.cbr_АгентскиеВознаграждения.ТекущиеДанные;
		ТекСтрока.ДоговорАгента = Результат;
		
	КонецЕсли
	
КонецПроцедуры //-- cbr-larkovgeorg 12.02.2026 ПРД12
#КонецОбласти
