#Область СлужебныеПроцедурыИФункции

&После("ОбработкаПроведения")
Процедура cbr_ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	//++ БаженоваЕО 30.01.2026 ПРД.18
	// Движение по регистру накопления cbr_ОплатаОтгрузкаПоМенеджерам
	Движения = Объект.Движения.cbr_ОплатаОтгрузкаПоМенеджерам;
	Движения.Записывать = Истина;
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл
		
		ОбъектРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ОбъектРасчетов, "Объект");
		Для каждого СтрокаМенеджер Из ОбъектРасчетов.cbr_ТЧПересечениеМенеджеров Цикл
			Если ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				Движение = Движения.Добавить();
				Движение.Регистратор = Объект.Ссылка;
				Движение.Период = Объект.Дата;				
				Движение.РеализацияТоваровУслуг = ОбъектРасчетов;
				Движение.ЗаказКлиента = ОбъектРасчетов.ЗаказКлиента;
				Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
				Движение.Процент = СтрокаМенеджер.Процент;	
				Движение.СуммаОплачено = Объект.СуммаДокумента * СтрокаМенеджер.Процент;
				
			ИначеЕсли ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
				
				Движение = Движения.Добавить();
				Движение.Регистратор = Объект.Ссылка;
				Движение.Период = Объект.Дата;				
				Движение.ЗаказКлиента = ОбъектРасчетов;
				Движение.ФизическоеЛицо = СтрокаМенеджер.ФизическоеЛицо;	
				Движение.Процент = СтрокаМенеджер.Процент;		
				Движение.СуммаОплачено = Объект.СуммаДокумента * СтрокаМенеджер.Процент;
					
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	//-- БаженоваЕО 30.01.2026
	
КонецПроцедуры

#КонецОбласти
